[Killed] BooleanLiteral
main/components/CourseStaff/CourseStaffTable.jsx:18:60
   courseId,
   testIdPrefix = "CourseStaffTable",
 }) {
-  const [showEditModal, setShowEditModal] = React.useState(false);
+  const [showEditModal, setShowEditModal] = React.useState(true);
   const [editStaff, setEditStaff] = React.useState(null);
   const [showDeleteModal, setShowDeleteModal] = React.useState(false);
killedBy: CourseStaffTable tests renders empty table correctly
statusReason: Found multiple elements with the text: First Name

Here are the matching elements:

Ignored nodes: comments, script, style
<div
  data-testid="CourseStaffTable-header-firstName-sort-header"
  style="cursor: pointer;"

[Killed] BooleanLiteral
main/components/CourseStaff/CourseStaffTable.jsx:20:64
 }) {
   const [showEditModal, setShowEditModal] = React.useState(false);
   const [editStaff, setEditStaff] = React.useState(null);
-  const [showDeleteModal, setShowDeleteModal] = React.useState(false);
+  const [showDeleteModal, setShowDeleteModal] = React.useState(true);
   const [deleteStaff, setDeleteStaff] = React.useState(null);
 
killedBy: InstructorCourseShowPage tests does not show error modal on initial render
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  aria-modal="true"
  class="fade modal show"
  role="dialog"
  style="display: block; padding-right: 0px;"
  tabindex="-1"

[Killed] BlockStatement
main/components/CourseStaff/CourseStaffTable.jsx:23:46
   const [showDeleteModal, setShowDeleteModal] = React.useState(false);
   const [deleteStaff, setDeleteStaff] = React.useState(null);
 
-  function cellToAxiosParamsDelete(formData) {
-    return {
-      // Stryker disable next-line StringLiteral
-      url: "/api/coursestaff/delete",
-      method: "DELETE",
-      params: {
-        id: formData.id,
-        courseId: courseId,
-        removeFromOrg: formData.removeFromOrg,
-      },
-    };
-  }
+  function cellToAxiosParamsDelete(formData) {}
 
   const cellToAxiosParamsEdit = (formData) => ({
killedBy: CourseStaffTable tests Delete button calls delete callback
statusReason: Cannot read properties of undefined (reading 'params')

[Killed] ObjectLiteral
main/components/CourseStaff/CourseStaffTable.jsx:28:15
       // Stryker disable next-line StringLiteral
       url: "/api/coursestaff/delete",
       method: "DELETE",
-      params: {
-        id: formData.id,
-        courseId: courseId,
-        removeFromOrg: formData.removeFromOrg,
-      },
+      params: {},
     };
   }
killedBy: CourseStaffTable tests Delete button calls delete callback
statusReason: expected {} to deeply equal { id: 1, courseId: 7, …(1) }

[Killed] ArrowFunction
main/components/CourseStaff/CourseStaffTable.jsx:36:33
     };
   }
 
-  const cellToAxiosParamsEdit = (formData) => ({
-    url: `/api/coursestaff`,
-    method: "PUT",
-    // Stryker disable next-line ObjectLiteral
-    params: {
-      firstName: formData.firstName,
-      lastName: formData.lastName,
-      id: formData.id,
-      courseId: courseId,
-    },
-  });
+  const cellToAxiosParamsEdit = () => undefined;
 
   const hideModal = () => {
killedBy: CourseStaffTable tests onEditSuccess calls toast and hideModal
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Staff member updated successfully.",

[Killed] BlockStatement
main/components/CourseStaff/CourseStaffTable.jsx:48:27
     },
   });
 
-  const hideModal = () => {
-    setShowEditModal(false);
-  };
+  const hideModal = () => {};
 
   const hideDeleteModal = () => {
killedBy: CourseStaffTable tests onEditSuccess calls toast and hideModal
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-title h4"
>
  Edit Staff Member
</div> instead

[Killed] BooleanLiteral
main/components/CourseStaff/CourseStaffTable.jsx:49:22
   });
 
   const hideModal = () => {
-    setShowEditModal(false);
+    setShowEditModal(true);
   };
 
killedBy: CourseStaffTable tests onEditSuccess calls toast and hideModal
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-title h4"
>
  Edit Staff Member
</div> instead

[Killed] BlockStatement
main/components/CourseStaff/CourseStaffTable.jsx:52:33
     setShowEditModal(false);
   };
 
-  const hideDeleteModal = () => {
-    setShowDeleteModal(false);
-  };
+  const hideDeleteModal = () => {};
 
   const onEditSuccess = () => {
killedBy: CourseStaffTable tests Delete button calls delete callback
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="btn btn-primary"
  type="submit"
>
  Delete Staff
</button> instead

[Killed] BooleanLiteral
main/components/CourseStaff/CourseStaffTable.jsx:53:24
   };
 
   const hideDeleteModal = () => {
-    setShowDeleteModal(false);
+    setShowDeleteModal(true);
   };
 
killedBy: CourseStaffTable tests Delete button calls delete callback
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="btn btn-primary"
  type="submit"
>
  Delete Staff
</button> instead

[Killed] BlockStatement
main/components/CourseStaff/CourseStaffTable.jsx:56:31
     setShowDeleteModal(false);
   };
 
-  const onEditSuccess = () => {
-    toast("Staff member updated successfully.");
-    hideModal();
-  };
+  const onEditSuccess = () => {};
 
   const onDeleteSuccess = () => {
killedBy: CourseStaffTable tests onEditSuccess calls toast and hideModal
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] BlockStatement
main/components/CourseStaff/CourseStaffTable.jsx:61:33
     hideModal();
   };
 
-  const onDeleteSuccess = () => {
-    toast("Staff member deleted successfully.");
-    hideDeleteModal();
-  };
+  const onDeleteSuccess = () => {};
 
   const deleteMutation = useBackendMutation(
killedBy: CourseStaffTable tests Delete button calls delete callback
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="btn btn-primary"
  type="submit"
>
  Delete Staff
</button> instead

[Killed] StringLiteral
main/components/CourseStaff/CourseStaffTable.jsx:62:11
   };
 
   const onDeleteSuccess = () => {
-    toast("Staff member deleted successfully.");
+    toast("");
     hideDeleteModal();
   };
killedBy: CourseStaffTable tests Delete button calls delete callback
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Staff member deleted successfully.",

[Killed] BooleanLiteral
main/components/CourseStaff/CourseStaffTable.jsx:74:24
 
   // Stryker disable next-line all
   const deleteCallback = async (cell) => {
-    setShowDeleteModal(true);
+    setShowDeleteModal(false);
     setDeleteStaff(cell.row.original.id);
   };
killedBy: CourseStaffTable tests Delete button calls delete callback
statusReason: Unable to find an element by: [data-testid="CourseStaffDeleteModal"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CourseStaffTable"

[Killed] BlockStatement
main/components/CourseStaff/CourseStaffTable.jsx:78:38
     setDeleteStaff(cell.row.original.id);
   };
 
-  const submitDeleteForm = (data) => {
-    deleteMutation.mutate({
-      id: deleteStaff,
-      ...data,
-    });
-  };
+  const submitDeleteForm = (data) => {};
 
   const editMutation = useBackendMutation(
killedBy: CourseStaffTable tests Delete button calls delete callback
statusReason: Cannot read properties of undefined (reading 'params')

[Killed] StringLiteral
main/components/CourseStaff/CourseStaffTable.jsx:88:6
   const editMutation = useBackendMutation(
     cellToAxiosParamsEdit,
     { onSuccess: onEditSuccess },
-    [`/api/coursestaff/course?courseId=${courseId}`],
+    [``],
   );
 
killedBy: CourseStaffTable tests useBackendMutation is called with correct cache query key
statusReason: expected 2nd "useBackendMutation" call to have been called with [ Any<Function>, …(2) ]

[Killed] BlockStatement
main/components/CourseStaff/CourseStaffTable.jsx:91:34
     [`/api/coursestaff/course?courseId=${courseId}`],
   );
 
-  const editCallback = (cell) => {
-    setEditStaff(cell.row.original);
-    setShowEditModal(true);
-  };
+  const editCallback = (cell) => {};
 
   const submitEditForm = (data) => {
killedBy: CourseStaffTable tests Edit button navigates to the edit modal
statusReason: Unable to find an element with the text: Edit Staff Member. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CourseStaffTable"

[Killed] BooleanLiteral
main/components/CourseStaff/CourseStaffTable.jsx:93:22
 
   const editCallback = (cell) => {
     setEditStaff(cell.row.original);
-    setShowEditModal(true);
+    setShowEditModal(false);
   };
 
killedBy: CourseStaffTable tests Edit button navigates to the edit modal
statusReason: Unable to find an element with the text: Edit Staff Member. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CourseStaffTable"

[Killed] BlockStatement
main/components/CourseStaff/CourseStaffTable.jsx:96:36
     setShowEditModal(true);
   };
 
-  const submitEditForm = (data) => {
-    editMutation.mutate(data);
-  };
+  const submitEditForm = (data) => {};
 
   const columns = [
killedBy: CourseStaffTable tests onEditSuccess calls toast and hideModal
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] StringLiteral
main/components/CourseStaff/CourseStaffTable.jsx:104:11
     {
       header: "id",
       accessorKey: "id",
-      id: "id",
+      id: "",
     },
     {
killedBy: CourseStaffTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/CourseStaff/CourseStaffTable.jsx:106:5
       accessorKey: "id",
       id: "id",
     },
-    {
-      header: "First Name",
-      accessorKey: "firstName",
-    },
+    {},
     {
       header: "Last Name",
killedBy: CourseStaffTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/CourseStaff/CourseStaffTable.jsx:110:5
       header: "First Name",
       accessorKey: "firstName",
     },
-    {
-      header: "Last Name",
-      accessorKey: "lastName",
-    },
+    {},
     {
       header: "Email",
killedBy: CourseStaffTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/CourseStaff/CourseStaffTable.jsx:118:5
       header: "Email",
       accessorKey: "email",
     },
-    {
-      header: "GitHub Login",
-      accessorKey: "githubLogin",
-    },
+    {},
   ];
 
killedBy: CourseStaffTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] ConditionalExpression
main/components/CourseStaff/CourseStaffTable.jsx:129:9
       let set_message;
 
       switch (orgStatus) {
-        case "PENDING":
-          set_message =
-            "Staff member cannot join the course until it has been completely set up.";
-          break;
+        case "PENDING":
         case "JOINCOURSE":
           set_message =
killedBy: CourseStaffTable tests tooltips for PENDING status
statusReason: Unable to find an element with the text: Staff member cannot join the course until it has been completely set up.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"

[Killed] StringLiteral
main/components/CourseStaff/CourseStaffTable.jsx:131:13
       switch (orgStatus) {
         case "PENDING":
           set_message =
-            "Staff member cannot join the course until it has been completely set up.";
+            "";
           break;
         case "JOINCOURSE":
killedBy: CourseStaffTable tests tooltips for PENDING status
statusReason: Unable to find an element with the text: Staff member cannot join the course until it has been completely set up.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"

[Killed] ConditionalExpression
main/components/CourseStaff/CourseStaffTable.jsx:133:9
           set_message =
             "Staff member cannot join the course until it has been completely set up.";
           break;
-        case "JOINCOURSE":
-          set_message =
-            "Staff member has been prompted to join, but hasn't yet clicked the 'Join Course' button to generate an invite to the organization.";
-          break;
+        case "JOINCOURSE":
         case "INVITED":
           set_message =
killedBy: CourseStaffTable tests tooltips for JOINCOURSE status
statusReason: 
Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CourseStaffTable"

[Killed] ConditionalExpression
main/components/CourseStaff/CourseStaffTable.jsx:137:9
           set_message =
             "Staff member has been prompted to join, but hasn't yet clicked the 'Join Course' button to generate an invite to the organization.";
           break;
-        case "INVITED":
-          set_message =
-            "Staff member has generated an invite, but has not yet accepted or declined the invitation.";
-          break;
+        case "INVITED":
         case "OWNER":
           set_message =
killedBy: CourseStaffTable tests tooltips for INVITED status
statusReason: Unable to find an element with the text: Staff member has generated an invite, but has not yet accepted or declined the invitation.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped tab

[Killed] StringLiteral
main/components/CourseStaff/CourseStaffTable.jsx:137:14
           set_message =
             "Staff member has been prompted to join, but hasn't yet clicked the 'Join Course' button to generate an invite to the organization.";
           break;
-        case "INVITED":
+        case "":
           set_message =
             "Staff member has generated an invite, but has not yet accepted or declined the invitation.";
killedBy: CourseStaffTable tests tooltips for INVITED status
statusReason: Unable to find an element with the text: Staff member has generated an invite, but has not yet accepted or declined the invitation.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped tab

[Killed] ConditionalExpression
main/components/CourseStaff/CourseStaffTable.jsx:141:9
           set_message =
             "Staff member has generated an invite, but has not yet accepted or declined the invitation.";
           break;
-        case "OWNER":
-          set_message =
-            "Staff member is an owner of the GitHub organization associated with this course.";
-          break;
+        case "OWNER":
         case "MEMBER":
           set_message =
killedBy: CourseStaffTable tests tooltips for OWNER status
statusReason: Unable to find an element with the text: Staff member is an owner of the GitHub organization associated with this course.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordere

[Killed] StringLiteral
main/components/CourseStaff/CourseStaffTable.jsx:143:13
           break;
         case "OWNER":
           set_message =
-            "Staff member is an owner of the GitHub organization associated with this course.";
+            "";
           break;
         case "MEMBER":
killedBy: CourseStaffTable tests tooltips for OWNER status
statusReason: Unable to find an element with the text: Staff member is an owner of the GitHub organization associated with this course.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordere

[Killed] ConditionalExpression
main/components/CourseStaff/CourseStaffTable.jsx:145:9
           set_message =
             "Staff member is an owner of the GitHub organization associated with this course.";
           break;
-        case "MEMBER":
-          set_message =
-            "Staff member is a member of the GitHub organization associated with this course.";
-          break;
+        case "MEMBER":
         default:
           set_message = "Tooltip for illegal status that will never occur";
killedBy: CourseStaffTable tests tooltips for MEMBER status
statusReason: Unable to find an element with the text: Staff member is a member of the GitHub organization associated with this course.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordere

[Killed] StringLiteral
main/components/CourseStaff/CourseStaffTable.jsx:150:25
             "Staff member is a member of the GitHub organization associated with this course.";
           break;
         default:
-          set_message = "Tooltip for illegal status that will never occur";
+          set_message = "";
           break;
       }
killedBy: CourseStaffTable tests tooltips for an illegal status
statusReason: Unable to find an element with the text: Tooltip for illegal status that will never occur. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CourseStaf

[Killed] MethodExpression
main/components/CourseStaff/CourseStaffTable.jsx:154:25
           break;
       }
       return (
-        <Tooltip id={`${orgStatus.toLowerCase()}-tooltip`} {...props}>
+        <Tooltip id={`${orgStatus.toUpperCase()}-tooltip`} {...props}>
           {set_message}
         </Tooltip>
killedBy: CourseStaffTable tests expect the correct tooltip ID
statusReason: expect(element).toHaveAttribute("id", "member-tooltip") // element.getAttribute("id") === "member-tooltip"

Expected the element to have attribute:
  id="member-tooltip"
Received:
  id="MEMBER-tooltip"

[Killed] StringLiteral
main/components/CourseStaff/CourseStaffTable.jsx:154:22
           break;
       }
       return (
-        <Tooltip id={`${orgStatus.toLowerCase()}-tooltip`} {...props}>
+        <Tooltip id={``} {...props}>
           {set_message}
         </Tooltip>
killedBy: CourseStaffTable tests expect the correct tooltip ID
statusReason: expect(element).toHaveAttribute("id", "member-tooltip") // element.getAttribute("id") === "member-tooltip"

Expected the element to have attribute:
  id="member-tooltip"
Received:
  id=""

[Killed] EqualityOperator
main/components/CourseStaff/CourseStaffTable.jsx:165:11
     accessorKey: "orgStatus",
     cell: ({ cell }) => {
       const status = cell.row.original.orgStatus;
-      if (status === "PENDING") {
+      if (status !== "PENDING") {
         return (
           <OverlayTrigger placement="right" overlay={renderTooltip("PENDING")}>
killedBy: CourseStaffTable tests Has the expected column headers, content and buttons for admin user
statusReason: Found multiple elements with the text: Pending

Here are the matching elements:

Ignored nodes: comments, script, style
<span
  class="text-warning"
>

[Killed] ConditionalExpression
main/components/CourseStaff/CourseStaffTable.jsx:165:11
     accessorKey: "orgStatus",
     cell: ({ cell }) => {
       const status = cell.row.original.orgStatus;
-      if (status === "PENDING") {
+      if (false) {
         return (
           <OverlayTrigger placement="right" overlay={renderTooltip("PENDING")}>
killedBy: CourseStaffTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element with the text: Pending. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CourseStaffTable"

[Killed] StringLiteral
main/components/CourseStaff/CourseStaffTable.jsx:167:68
       const status = cell.row.original.orgStatus;
       if (status === "PENDING") {
         return (
-          <OverlayTrigger placement="right" overlay={renderTooltip("PENDING")}>
+          <OverlayTrigger placement="right" overlay={renderTooltip("")}>
             <span className="text-warning">Pending</span>
           </OverlayTrigger>
killedBy: CourseStaffTable tests tooltips for PENDING status
statusReason: Unable to find an element with the text: Staff member cannot join the course until it has been completely set up.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"

[Killed] BlockStatement
main/components/CourseStaff/CourseStaffTable.jsx:171:43
             <span className="text-warning">Pending</span>
           </OverlayTrigger>
         );
-      } else if (status === "JOINCOURSE") {
-        return (
-          <OverlayTrigger
-            placement="right"
-            overlay={renderTooltip("JOINCOURSE")}
-          >
-            <span className="text-primary">Join Course</span>
-          </OverlayTrigger>
-        );
-      } else if (status === "INVITED") {
+      } else if (status === "JOINCOURSE") {} else if (status === "INVITED") {
         return (
           <OverlayTrigger placement="right" overlay={renderTooltip("INVITED")}>
killedBy: CourseStaffTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element with the text: Join Course. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CourseStaffTable"

[Killed] ConditionalExpression
main/components/CourseStaff/CourseStaffTable.jsx:171:18
             <span className="text-warning">Pending</span>
           </OverlayTrigger>
         );
-      } else if (status === "JOINCOURSE") {
+      } else if (true) {
         return (
           <OverlayTrigger
killedBy: CourseStaffTable tests Has the expected column headers, content and buttons for admin user
statusReason: Found multiple elements with the text: Join Course

Here are the matching elements:

Ignored nodes: comments, script, style
<span
  class="text-primary"
>

[Killed] EqualityOperator
main/components/CourseStaff/CourseStaffTable.jsx:186:18
             <span className="text-primary">Invited</span>
           </OverlayTrigger>
         );
-      } else if (status === "OWNER") {
+      } else if (status !== "OWNER") {
         return (
           <OverlayTrigger placement="right" overlay={renderTooltip("OWNER")}>
killedBy: CourseStaffTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element with the text: Member. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CourseStaffTable"

[Killed] StringLiteral
main/components/CourseStaff/CourseStaffTable.jsx:188:68
         );
       } else if (status === "OWNER") {
         return (
-          <OverlayTrigger placement="right" overlay={renderTooltip("OWNER")}>
+          <OverlayTrigger placement="right" overlay={renderTooltip("")}>
             <span className="text-info">Owner</span>
           </OverlayTrigger>
killedBy: CourseStaffTable tests tooltips for OWNER status
statusReason: Unable to find an element with the text: Staff member is an owner of the GitHub organization associated with this course.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordere

[Killed] ConditionalExpression
main/components/CourseStaff/CourseStaffTable.jsx:192:18
             <span className="text-info">Owner</span>
           </OverlayTrigger>
         );
-      } else if (status === "MEMBER") {
+      } else if (true) {
         return (
           <OverlayTrigger placement="right" overlay={renderTooltip("MEMBER")}>
killedBy: CourseStaffTable tests tooltips for an illegal status
statusReason: Unable to find an element with the text: Floating in Space. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ConditionalExpression
main/components/CourseStaff/CourseStaffTable.jsx:210:7
     },
   });
 
-  if (hasRole(currentUser, "ROLE_INSTRUCTOR")) {
+  if (false) {
     columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
     columns.push(
killedBy: CourseStaffTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="CourseStaffTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CourseStaffTable"

[Killed] BlockStatement
main/components/CourseStaff/CourseStaffTable.jsx:210:48
     },
   });
 
-  if (hasRole(currentUser, "ROLE_INSTRUCTOR")) {
-    columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
-    columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix),
-    );
-  }
+  if (hasRole(currentUser, "ROLE_INSTRUCTOR")) {}
 
   return (
killedBy: CourseStaffTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="CourseStaffTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CourseStaffTable"

[Killed] StringLiteral
main/components/CourseStaff/CourseStaffTable.jsx:211:39
   });
 
   if (hasRole(currentUser, "ROLE_INSTRUCTOR")) {
-    columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
+    columns.push(ButtonColumn("Edit", "", editCallback, testIdPrefix));
     columns.push(
       ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix),
killedBy: CourseStaffTable tests Has the expected column headers, content and buttons for admin user
statusReason: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn

[Killed] BooleanLiteral
main/components/CourseStaff/CourseStaffTable.jsx:231:29
             initialContents={editStaff}
             submitAction={submitEditForm}
             buttonLabel={"Update"}
-            cancelDisabled={true}
+            cancelDisabled={false}
           />
         </Modal.Body>
killedBy: CourseStaffTable tests Edit button navigates to the edit modal
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="btn btn-Secondary"
  data-testid="CourseStaffForm-cancel"
  type="button"
>
  Cancel
