[Killed] ObjectLiteral
main/pages/Admin/InstructorsIndexPage.jsx:15:5
     status: _status,
   } = useBackend(
     ["/api/admin/instructors/get"],
-    { method: "GET", url: "/api/admin/instructors/get" },
+    {},
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: InstructorsIndexPage tests renders three items correctly
statusReason: Unable to find an element by: [data-testid="InstructorsIndexPage-cell-row-0-col-email"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/Admin/InstructorsIndexPage.jsx:20:30
     [],
   );
 
-  const createButton = () => {
-    return (
-      <Button
-        variant="primary"
-        as={Link}
-        to="/admin/instructors/create"
-        style={{ float: "right" }}
-      >
-        New Instructor
-      </Button>
-    );
-  };
+  const createButton = () => {};
 
   return (
killedBy: InstructorsIndexPage tests Renders with New Instructor Button
statusReason: Unable to find an element with the text: /New Instructor/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
