[Killed] ArithmeticOperator
main/pages/Admin/AdminUsersPage.jsx:14:26
     error: _error,
     status: _status,
   } = useBackend(
-    [`/api/admin/users/${currentPage - 1}`],
+    [`/api/admin/users/${currentPage + 1}`],
     {
       method: "GET",
killedBy: AdminUsersPage tests useBackend is called with correct cache query key
statusReason: expected "useBackend" to be called with arguments: [ [ '/api/admin/users/0' ], …(2) ]

Received: 

  1st useBackend call:

@@ -1,8 +1,8 @@
  [

[Killed] ArrayDeclaration
main/pages/Admin/AdminUsersPage.jsx:14:5
     error: _error,
     status: _status,
   } = useBackend(
-    [`/api/admin/users/${currentPage - 1}`],
+    [],
     {
       method: "GET",
killedBy: AdminUsersPage tests useBackend is called with correct cache query key
statusReason: expected "useBackend" to be called with arguments: [ [ '/api/admin/users/0' ], …(2) ]

Received: 

  1st useBackend call:

@@ -1,9 +1,7 @@
  [

[Killed] ObjectLiteral
main/pages/Admin/AdminUsersPage.jsx:20:26
       url: `/api/admin/users`,
       params: { page: currentPage - 1, size: 50, sort: "id" },
     },
-    { content: [], page: { totalPages: 1 } },
+    { content: [], page: {} },
   );
 
killedBy: AdminUsersPage tests renders empty table when backend unavailable
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a
  class="page-link"
  data-testid="OurPagination-2"
  href="#"
  role="button"
  tabindex="0"

[Killed] ObjectLiteral
main/pages/Admin/AdminUsersPage.jsx:20:5
       url: `/api/admin/users`,
       params: { page: currentPage - 1, size: 50, sort: "id" },
     },
-    { content: [], page: { totalPages: 1 } },
+    {},
   );
 
killedBy: AdminUsersPage tests renders without crashing on three users
statusReason: Cannot read properties of undefined (reading 'totalPages')
