[Killed] ArrayDeclaration
main/components/Settings/CanvasApiForm.jsx:20:5
   } = useForm();
 
   const { data: canvasInfo } = useBackend(
-    [`/api/courses/getCanvasInfo?courseId=${courseId}`],
+    [],
     // Stryker disable next-line StringLiteral : The default value for an empty ("") method is GET. Therefore, there is no way to kill a mutation that transforms "GET" to ""
     { method: "GET", url: `/api/courses/getCanvasInfo?courseId=${courseId}` },
killedBy: CanvasApiForm tests useBackend is called with correct cache query key
statusReason: expected "useBackend" to be called with arguments: [ …(3) ]

Received: 

  1st useBackend call:

@@ -1,9 +1,7 @@
  [

[Killed] StringLiteral
main/components/Settings/CanvasApiForm.jsx:20:6
   } = useForm();
 
   const { data: canvasInfo } = useBackend(
-    [`/api/courses/getCanvasInfo?courseId=${courseId}`],
+    [``],
     // Stryker disable next-line StringLiteral : The default value for an empty ("") method is GET. Therefore, there is no way to kill a mutation that transforms "GET" to ""
     { method: "GET", url: `/api/courses/getCanvasInfo?courseId=${courseId}` },
killedBy: CanvasApiForm tests useBackend is called with correct cache query key
statusReason: expected "useBackend" to be called with arguments: [ …(3) ]

Received: 

  1st useBackend call:

@@ -1,8 +1,8 @@
  [

[Killed] BlockStatement
main/components/Settings/CanvasApiForm.jsx:31:40
 
   return (
     <Form
-      onSubmit={handleSubmit((data) => {
-        const token = data.canvasApiToken.trim();
-        const courseIdVal = data.canvasCourseId.trim();
-
-        if (!token && !courseIdVal) {
-          setError("root", { message: "Please fill in at least one field." });
-          return;
-        }
-        submitAction({ canvasApiToken: token, canvasCourseId: courseIdVal });
-        reset();
-      })}
+      onSubmit={handleSubmit((data) => {})}
     >
       <Form.Group className="mb-3">
killedBy: CanvasApiForm tests At least one field is required.
statusReason: Unable to find an element with the text: Please fill in at least one field.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] MethodExpression
main/components/Settings/CanvasApiForm.jsx:32:23
   return (
     <Form
       onSubmit={handleSubmit((data) => {
-        const token = data.canvasApiToken.trim();
+        const token = data.canvasApiToken;
         const courseIdVal = data.canvasCourseId.trim();
 
killedBy: CanvasApiForm tests Submitting spaces only in fields shows error message
statusReason: Unable to find an element with the text: Please fill in at least one field.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] MethodExpression
main/components/Settings/CanvasApiForm.jsx:33:29
     <Form
       onSubmit={handleSubmit((data) => {
         const token = data.canvasApiToken.trim();
-        const courseIdVal = data.canvasCourseId.trim();
+        const courseIdVal = data.canvasCourseId;
 
         if (!token && !courseIdVal) {
killedBy: CanvasApiForm tests Submitting spaces only in fields shows error message
statusReason: Unable to find an element with the text: Please fill in at least one field.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/Settings/CanvasApiForm.jsx:35:23
         const token = data.canvasApiToken.trim();
         const courseIdVal = data.canvasCourseId.trim();
 
-        if (!token && !courseIdVal) {
+        if (!token && courseIdVal) {
           setError("root", { message: "Please fill in at least one field." });
           return;
killedBy: CanvasApiForm tests At least one field is required.
statusReason: Unable to find an element with the text: Please fill in at least one field.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/Settings/CanvasApiForm.jsx:35:13
         const token = data.canvasApiToken.trim();
         const courseIdVal = data.canvasCourseId.trim();
 
-        if (!token && !courseIdVal) {
+        if (true) {
           setError("root", { message: "Please fill in at least one field." });
           return;
killedBy: CanvasApiForm tests Submitting form with data works
statusReason: expected "spy" to be called with arguments: [ { canvasCourseId: '1234567', …(1) } ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/Settings/CanvasApiForm.jsx:36:20
         const courseIdVal = data.canvasCourseId.trim();
 
         if (!token && !courseIdVal) {
-          setError("root", { message: "Please fill in at least one field." });
+          setError("", { message: "Please fill in at least one field." });
           return;
         }
killedBy: CanvasApiForm tests At least one field is required.
statusReason: Unable to find an element with the text: Please fill in at least one field.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Settings/CanvasApiForm.jsx:39:22
           setError("root", { message: "Please fill in at least one field." });
           return;
         }
-        submitAction({ canvasApiToken: token, canvasCourseId: courseIdVal });
+        submitAction({});
         reset();
       })}
killedBy: CanvasApiForm tests Submitting form with data works
statusReason: expected "spy" to be called with arguments: [ { canvasCourseId: '1234567', …(1) } ]

Received: 

  1st spy call:

  [
-   {

[Killed] StringLiteral
main/components/Settings/CanvasApiForm.jsx:46:39
       <Form.Group className="mb-3">
         <Form.Label htmlFor="canvasApiToken">Canvas API Token</Form.Label>
         <Form.Control
-          data-testid={testIdPrefix + "-canvasApiToken"}
+          data-testid={testIdPrefix + ""}
           id="canvasApiToken"
           type="text"
killedBy: CanvasApiForm tests renders correctly
statusReason: Unable to find an element by: [data-testid="CanvasApiForm-canvasApiToken"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Settings/CanvasApiForm.jsx:66:17
           type="text"
           placeholder={
             canvasInfo.canvasCourseId
-              ? `Current Course ID: ${canvasInfo.canvasCourseId}`
+              ? ``
               : "Course ID not set yet."
           }
killedBy: CanvasApiForm tests Placeholder shows correct text when a token is set
statusReason: expect(element).toHaveAttribute("placeholder", "Current Course ID: 1234567") // element.getAttribute("placeholder") === "Current Course ID: 1234567"

Expected the element to have attribute:
  placeholder="Current Course ID: 1234567"
Received:
  placeholder=""

[Killed] StringLiteral
main/components/Settings/CanvasApiForm.jsx:70:24
               : "Course ID not set yet."
           }
           isInvalid={Boolean(errors.canvasCourseId)}
-          {...register("canvasCourseId")}
+          {...register("")}
         />
       </Form.Group>
killedBy: CanvasApiForm tests renders correctly
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] ConditionalExpression
main/components/Settings/CanvasApiForm.jsx:73:8
           {...register("canvasCourseId")}
         />
       </Form.Group>
-      {errors.root && (
-        <Form.Text className="text-danger d-block mb-2">
-          {errors.root.message}
-        </Form.Text>
-      )}
+      {true}
 
       <Button type="submit" data-testid={testIdPrefix + "-submit"}>
killedBy: CanvasApiForm tests At least one field is required.
statusReason: Unable to find an element with the text: Please fill in at least one field.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/Settings/CanvasApiForm.jsx:73:8
           {...register("canvasCourseId")}
         />
       </Form.Group>
-      {errors.root && (
-        <Form.Text className="text-danger d-block mb-2">
-          {errors.root.message}
-        </Form.Text>
-      )}
+      {errors.root || <Form.Text className="text-danger d-block mb-2">
+          {errors.root.message}
+        </Form.Text>}
 
       <Button type="submit" data-testid={testIdPrefix + "-submit"}>
killedBy: CanvasApiForm tests renders correctly
statusReason: Cannot read properties of undefined (reading 'message')
