[Killed] ArrayDeclaration
src/main/pages/ArtifactSelectionPage.jsx:14:5
     error: _error,
     status: _status,
   } = useBackend(
-    ["/api/collections/list"],
+    [],
     // Stryker disable next-line StringLiteral : The default value for an empty ("") method is GET. Therefore, there is no way to kill a mutation that transforms "GET" to ""
     { method: "GET", url: "/api/collections/list" },
killedBy: ArtifactSelectionPage tests useBackend is called with correct cache query key
statusReason: expected "useBackend" to be called with arguments: [ [ '/api/collections/list' ], …(2) ]

Received: 

  1st useBackend call:

@@ -1,9 +1,7 @@
  [

[Killed] StringLiteral
src/main/pages/ArtifactSelectionPage.jsx:22:31
   );
   return (
     <BasicLayout>
-      <Tabs defaultActiveKey={"select_repos"}>
+      <Tabs defaultActiveKey={""}>
         <Tab
           eventKey={"select_repos"}
killedBy: ArtifactSelectionPage tests Tab assertions
statusReason: expect(element).toHaveAttribute("aria-selected", "true") // element.getAttribute("aria-selected") === "true"

Expected the element to have attribute:
  aria-selected="true"
Received:
  aria-selected="false"

[Killed] StringLiteral
src/main/pages/ArtifactSelectionPage.jsx:25:18
       <Tabs defaultActiveKey={"select_repos"}>
         <Tab
           eventKey={"select_repos"}
-          title={"Select Repositories"}
+          title={""}
           className="pt-2"
         >
killedBy: ArtifactSelectionPage tests Tab assertions
statusReason: Unable to find an element with the text: Select Repositories. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
src/main/pages/ArtifactSelectionPage.jsx:31:21
           <RepositorySelectionForm collections={collections} />
         </Tab>
         <Tab
-          eventKey={"select_artifacts"}
+          eventKey={""}
           title={"Select Artifacts"}
           className="pt-2"
killedBy: ArtifactSelectionPage tests Tab assertions
statusReason: expect(element).toHaveAttribute("data-rr-ui-event-key", "select_artifacts") // element.getAttribute("data-rr-ui-event-key") === "select_artifacts"

Expected the element to have attribute:
  data-rr-ui-event-key="select_artifacts"
Received:
  data-rr-ui-event-key=""
