[Killed] ObjectLiteral
main/pages/Admin/AdminsCreatePage.jsx:8:43
 import { toast } from "react-toastify";
 
 export default function AdminsCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (admin) => ({
-    url: "/api/admin/post",
-    method: "POST",
-    params: {
-      email: admin.email,
-    },
-  });
+  const objectToAxiosParams = (admin) => ({});
 
   const onSuccess = (admin) => {
killedBy: AdminsCreatePage tests on submit, makes request to backend, and redirects to /admin/admins
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div
