[Killed] ArrowFunction
main/pages/Admin/InstructorsCreatePage.jsx:9:31
 
 export default function InstructorsCreatePage({ storybook = false }) {
   const navigation = useNavigate();
-  const objectToAxiosParams = (instructor) => ({
-    url: "/api/admin/instructors/post",
-    method: "POST",
-    params: {
-      email: instructor.email,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (instructor) => {
killedBy: InstructorsCreatePage tests on submit, makes request to backend, and redirects to /admin/instructors
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/pages/Admin/InstructorsCreatePage.jsx:17:37
     },
   });
 
-  const onSuccess = (instructor) => {
-    toast(`New instructor added - email: ${instructor.email}`);
-    if (!storybook) navigation("/admin/instructors");
-  };
+  const onSuccess = (instructor) => {};
 
   const mutation = useBackendMutation(
killedBy: InstructorsCreatePage tests on submit, makes request to backend, and redirects to /admin/instructors
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BooleanLiteral
main/pages/Admin/InstructorsCreatePage.jsx:19:9
 
   const onSuccess = (instructor) => {
     toast(`New instructor added - email: ${instructor.email}`);
-    if (!storybook) navigation("/admin/instructors");
+    if (storybook) navigation("/admin/instructors");
   };
 
killedBy: InstructorsCreatePage tests on submit, makes request to backend, and redirects to /admin/instructors
statusReason: expected "spy" to be called with arguments: [ '/admin/instructors' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
main/pages/Admin/InstructorsCreatePage.jsx:19:9
 
   const onSuccess = (instructor) => {
     toast(`New instructor added - email: ${instructor.email}`);
-    if (!storybook) navigation("/admin/instructors");
+    if (true) navigation("/admin/instructors");
   };
 
killedBy: InstructorsCreatePage tests on storybook, no redirect
statusReason: expected "spy" to not be called with arguments: [ '/admin/instructors' ]

Received: 

  1st spy call:

Compared values have no visual difference.
