[Killed] ArrayDeclaration
src/main/pages/HomePageLoggedIn.jsx:31:5
     error: _instructorError,
     status: _instructorStatus,
   } = useBackend(
-    ["/api/courses/allForInstructors"],
+    [],
     // Stryker disable next-line StringLiteral : The default value for an empty ("") method is GET. Therefore, there is no way to kill a mutation that transforms "GET" to ""
     { method: "GET", url: "/api/courses/allForInstructors" },
killedBy: HomePageLoggedIn tests Can submit new course
statusReason: expected undefined to be truthy

[Killed] ArrowFunction
src/main/pages/HomePageLoggedIn.jsx:42:34
     },
   );
 
-  const cellToAxiosParamsStaff = (cell) => ({
-    url: `/api/coursestaff/joinCourse`,
-    method: "PUT",
-    params: {
-      courseStaffId: cell.row.original.staffId,
-    },
-  });
+  const cellToAxiosParamsStaff = () => undefined;
 
   const onJoinSuccess = (message) => {
killedBy: HomePageLoggedIn tests right message on 400
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
src/main/pages/HomePageLoggedIn.jsx:43:10
   );
 
   const cellToAxiosParamsStaff = (cell) => ({
-    url: `/api/coursestaff/joinCourse`,
+    url: ``,
     method: "PUT",
     params: {
killedBy: HomePageLoggedIn tests right message on 400
statusReason: expected '' to be '/api/coursestaff/joinCourse' // Object.is equality

[Killed] ObjectLiteral
src/main/pages/HomePageLoggedIn.jsx:45:13
   const cellToAxiosParamsStaff = (cell) => ({
     url: `/api/coursestaff/joinCourse`,
     method: "PUT",
-    params: {
-      courseStaffId: cell.row.original.staffId,
-    },
+    params: {},
   });
 
killedBy: HomePageLoggedIn tests right message on 400
statusReason: expected {} to deeply equal { courseStaffId: 32 }

[Killed] BlockStatement
src/main/pages/HomePageLoggedIn.jsx:64:51
     [`/api/courses/staffCourses`],
   );
 
-  const joinStaffCourseCallback = async (cell) => {
-    staffJoinMutation.mutate(cell);
-  };
+  const joinStaffCourseCallback = async (cell) => {};
 
   const isStaffJoining = (cell) => {
killedBy: HomePageLoggedIn tests right message on 400
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
src/main/pages/HomePageLoggedIn.jsx:68:36
     staffJoinMutation.mutate(cell);
   };
 
-  const isStaffJoining = (cell) => {
-    return (
-      staffJoinMutation.isPending &&
-      staffJoinMutation.variables.row.index === cell.row.index
-    );
-  };
+  const isStaffJoining = (cell) => {};
 
   const [viewModal, setViewModal] = React.useState(false);
killedBy: HomePageLoggedIn tests Loading message renders, staff
statusReason: Unable to find an element with the text: Joining.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
src/main/pages/HomePageLoggedIn.jsx:70:7
 
   const isStaffJoining = (cell) => {
     return (
-      staffJoinMutation.isPending &&
-      staffJoinMutation.variables.row.index === cell.row.index
+      staffJoinMutation.isPending || staffJoinMutation.variables.row.index === cell.row.index
     );
   };
killedBy: HomePageLoggedIn tests right message on 400
statusReason: Unable to find an element by: [data-testid="StaffCoursesTable-cell-row-1-col-studentStatus-button"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ConditionalExpression
src/main/pages/HomePageLoggedIn.jsx:70:7
 
   const isStaffJoining = (cell) => {
     return (
-      staffJoinMutation.isPending &&
-      staffJoinMutation.variables.row.index === cell.row.index
+      false
     );
   };
killedBy: HomePageLoggedIn tests Loading message renders, staff
statusReason: Unable to find an element with the text: Joining.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] EqualityOperator
src/main/pages/HomePageLoggedIn.jsx:71:7
   const isStaffJoining = (cell) => {
     return (
       staffJoinMutation.isPending &&
-      staffJoinMutation.variables.row.index === cell.row.index
+      staffJoinMutation.variables.row.index !== cell.row.index
     );
   };
killedBy: HomePageLoggedIn tests Loading message renders, staff
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Join Course
Received:
  Joining...

[Killed] ConditionalExpression
src/main/pages/HomePageLoggedIn.jsx:71:7
   const isStaffJoining = (cell) => {
     return (
       staffJoinMutation.isPending &&
-      staffJoinMutation.variables.row.index === cell.row.index
+      true
     );
   };
killedBy: HomePageLoggedIn tests Loading message renders, staff
statusReason: Found multiple elements with the text: Joining...

Here are the matching elements:

Ignored nodes: comments, script, style
<button
  class="btn btn-primary"
  data-testid="StaffCoursesTable-cell-row-1-col-studentStatus-button"

[Killed] StringLiteral
src/main/pages/HomePageLoggedIn.jsx:105:31
   return (
     <BasicLayout>
       <div className="pt-2">
-        {hasRole(currentUser, "ROLE_INSTRUCTOR") && (
+        {hasRole(currentUser, "") && (
           <>
             <CourseModal
killedBy: HomePageLoggedIn tests tables render correctly for instructor when courses exist
statusReason: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] EqualityOperator
src/main/pages/HomePageLoggedIn.jsx:125:14
                 No instructor courses yet. Click the button above to create one.
               </p>
             )}
-            {instructorCourses.length > 0 && (
+            {instructorCourses.length <= 0 && (
               <>
                 <>
killedBy: HomePageLoggedIn tests tables render correctly for instructor when courses exist
statusReason: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/HomePageLoggedIn.jsx:125:14
                 No instructor courses yet. Click the button above to create one.
               </p>
             )}
-            {instructorCourses.length > 0 && (
-              <>
-                <>
-                  <InstructorCoursesTable
-                    courses={instructorCourses}
-                    currentUser={currentUser}
-                  />
-                </>
-              </>
-            )}
+            {false}
           </>
         )}
killedBy: HomePageLoggedIn tests tables render correctly for instructor when courses exist
statusReason: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
src/main/pages/HomePageLoggedIn.jsx:138:38
           </>
         )}
         <h1>Your Student Courses</h1>
-        <StudentCoursesTable testid={"CoursesTable"} />
+        <StudentCoursesTable testid={""} />
         {staffCourses.length > 0 && (
           <>
killedBy: HomePageLoggedIn tests tables render correctly
statusReason: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/HomePageLoggedIn.jsx:139:10
         )}
         <h1>Your Student Courses</h1>
         <StudentCoursesTable testid={"CoursesTable"} />
-        {staffCourses.length > 0 && (
-          <>
-            <h1>Your Staff Courses</h1>
-            <CoursesTable
-              courses={staffCourses}
-              testId={"StaffCoursesTable"}
-              joinCallback={joinStaffCourseCallback}
-              isLoading={isStaffJoining}
-            />
-          </>
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: HomePageLoggedIn tests right message on 400
statusReason: Unable to find an element by: [data-testid="StaffCoursesTable-cell-row-1-col-studentStatus-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/HomePageLoggedIn.jsx:139:10
         )}
         <h1>Your Student Courses</h1>
         <StudentCoursesTable testid={"CoursesTable"} />
-        {staffCourses.length > 0 && (
+        {true && (
           <>
             <h1>Your Staff Courses</h1>
killedBy: HomePageLoggedIn tests tables render correctly
statusReason: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
src/main/pages/HomePageLoggedIn.jsx:144:23
             <h1>Your Staff Courses</h1>
             <CoursesTable
               courses={staffCourses}
-              testId={"StaffCoursesTable"}
+              testId={""}
               joinCallback={joinStaffCourseCallback}
               isLoading={isStaffJoining}
killedBy: HomePageLoggedIn tests right message on 400
statusReason: Unable to find an element by: [data-testid="StaffCoursesTable-cell-row-1-col-studentStatus-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
