[Killed] BlockStatement
main/components/TabComponent/SettingsTabComponent.jsx:7:49
 import { toast } from "react-toastify";
 
 export default function SettingsTabComponent({ courseId, testIdPrefix }) {
-  const onSuccessCanvasCredentialsAdded = () => {
-    toast("Canvas credentials successfully added.");
-  };
+  const onSuccessCanvasCredentialsAdded = () => {};
 
   const objectToAxiosParamsCanvasToken = (formData) => ({
killedBy: SettingsTabComponent tests Call PUT for Canvas credentials properly
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Canvas credentials successfully added.",

[Killed] ArrowFunction
main/components/TabComponent/SettingsTabComponent.jsx:11:42
     toast("Canvas credentials successfully added.");
   };
 
-  const objectToAxiosParamsCanvasToken = (formData) => ({
-    url: `/api/courses/updateCourseCanvasToken`,
-    method: "PUT",
-    params: {
-      courseId: courseId,
-      canvasCourseId: formData.canvasCourseId,
-      canvasApiToken: formData.canvasApiToken,
-    },
-  });
+  const objectToAxiosParamsCanvasToken = () => undefined;
 
   const canvasMutation = useBackendMutation(
killedBy: SettingsTabComponent tests Call PUT for Canvas credentials properly
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Canvas credentials successfully added.",

[Killed] StringLiteral
main/components/TabComponent/SettingsTabComponent.jsx:12:10
   };
 
   const objectToAxiosParamsCanvasToken = (formData) => ({
-    url: `/api/courses/updateCourseCanvasToken`,
+    url: ``,
     method: "PUT",
     params: {
killedBy: SettingsTabComponent tests Call PUT for Canvas credentials properly
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Canvas credentials successfully added.",

[Killed] ObjectLiteral
main/components/TabComponent/SettingsTabComponent.jsx:14:13
   const objectToAxiosParamsCanvasToken = (formData) => ({
     url: `/api/courses/updateCourseCanvasToken`,
     method: "PUT",
-    params: {
-      courseId: courseId,
-      canvasCourseId: formData.canvasCourseId,
-      canvasApiToken: formData.canvasApiToken,
-    },
+    params: {},
   });
 
killedBy: SettingsTabComponent tests Call PUT for Canvas credentials properly
statusReason: expected {} to deeply equal { courseId: 1, …(2) }

[Killed] ObjectLiteral
main/components/TabComponent/SettingsTabComponent.jsx:23:5
 
   const canvasMutation = useBackendMutation(
     objectToAxiosParamsCanvasToken,
-    {
-      onSuccess: onSuccessCanvasCredentialsAdded,
-    },
+    {},
     [`/api/courses/getCanvasInfo?courseId=${courseId}`],
   );
killedBy: SettingsTabComponent tests Call PUT for Canvas credentials properly
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Canvas credentials successfully added.",

[Killed] ArrayDeclaration
main/components/TabComponent/SettingsTabComponent.jsx:26:5
     {
       onSuccess: onSuccessCanvasCredentialsAdded,
     },
-    [`/api/courses/getCanvasInfo?courseId=${courseId}`],
+    [],
   );
 
killedBy: SettingsTabComponent tests useBackendMutation is called with correct cache query key
statusReason: expected "useBackendMutation" to be called with arguments: [ Any<Function>, …(2) ]

Received: 

  1st useBackendMutation call:

  [
-   Any<Function>,

[Killed] BlockStatement
main/components/TabComponent/SettingsTabComponent.jsx:29:38
     [`/api/courses/getCanvasInfo?courseId=${courseId}`],
   );
 
-  const handleSubmit = (formData) => {
-    canvasMutation.mutate(formData);
-  };
+  const handleSubmit = (formData) => {};
 
   return (
killedBy: SettingsTabComponent tests Call PUT for Canvas credentials properly
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Canvas credentials successfully added.",

[Killed] StringLiteral
main/components/TabComponent/SettingsTabComponent.jsx:34:23
   };
 
   return (
-    <div data-testid={`${testIdPrefix}-canvasForm`}>
+    <div data-testid={``}>
       <CanvasApiForm submitAction={handleSubmit} courseId={courseId} />
     </div>
killedBy: SettingsTabComponent tests Settings tab component renders correctly
statusReason: Unable to find an element by: [data-testid="CanvasApiForm-canvasForm"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid=""
    >
