[Killed] BlockStatement
main/pages/Admin/AdminsIndexPage.js:21:30
     [],
   );
 
-  const createButton = () => {
-    return (
-      <Button
-        variant="primary"
-        href="/swagger-ui/index.html#/Admin/postAdmin"
-        style={{ float: "right" }}
-      >
-        New Admin
-      </Button>
-    );
-  };
+  const createButton = () => {};
 
   return (
killedBy: AdminsIndexPage tests Renders with New Admin Button
statusReason: Error: Unable to find an element with the text: /New Admin/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/pages/Admin/AdminsIndexPage.js:26:16
       <Button
         variant="primary"
         href="/swagger-ui/index.html#/Admin/postAdmin"
-        style={{ float: "right" }}
+        style={{}}
       >
         New Admin
killedBy: AdminsIndexPage tests Renders with New Admin Button
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
