[Killed] BlockStatement
main/pages/Admin/InstructorsIndexPage.js:21:30
     [],
   );
 
-  const createButton = () => {
-    return (
-      <Button
-        variant="primary"
-        href="/swagger-ui/index.html#/Instructors/postInstructor"
-        style={{ float: "right" }}
-      >
-        New Instructor
-      </Button>
-    );
-  };
+  const createButton = () => {};
 
   return (
killedBy: InstructorsIndexPage tests Renders with New Instructor Button
statusReason: Error: Unable to find an element with the text: /New Instructor/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
