[Killed] BooleanLiteral
main/components/TabComponent/TeamsTabComponent.jsx:25:54
   testIdPrefix,
   currentUser,
 }) {
-  const [postTeamModal, setPostTeamModal] = useState(false);
+  const [postTeamModal, setPostTeamModal] = useState(true);
   const [csvModal, setCsvModal] = useState(false);
   const [errorPostTeamModal, setErrorPostTeamModal] = useState(false);
killedBy: TeamTabComponent tests Table Renders and expected content appears
statusReason: useNavigate() may be used only in the context of a <Router> component.

[Killed] BooleanLiteral
main/components/TabComponent/TeamsTabComponent.jsx:26:44
   currentUser,
 }) {
   const [postTeamModal, setPostTeamModal] = useState(false);
-  const [csvModal, setCsvModal] = useState(false);
+  const [csvModal, setCsvModal] = useState(true);
   const [errorPostTeamModal, setErrorPostTeamModal] = useState(false);
   const [errorPostCSVTeamModal, setErrorPostCSVTeamModal] = useState(false);
killedBy: TeamTabComponent tests Modals close on close buttons, push teams button is enabled
statusReason: Found multiple elements with the role "button" and name "Close"

Here are the matching elements:

Ignored nodes: comments, script, style
<button
  aria-label="Close"
  class="btn-close"

[Killed] BooleanLiteral
main/components/TabComponent/TeamsTabComponent.jsx:27:64
 }) {
   const [postTeamModal, setPostTeamModal] = useState(false);
   const [csvModal, setCsvModal] = useState(false);
-  const [errorPostTeamModal, setErrorPostTeamModal] = useState(false);
+  const [errorPostTeamModal, setErrorPostTeamModal] = useState(true);
   const [errorPostCSVTeamModal, setErrorPostCSVTeamModal] = useState(false);
   const [partialSuccessPostCSVTeamModal, setPartialSuccessPostCSVTeamModal] =
killedBy: TeamTabComponent tests Uploads valid CSV with no errors and clears search filter
statusReason: Found multiple elements with the role "button" and name "Close"

Here are the matching elements:

Ignored nodes: comments, script, style
<button
  aria-label="Close"
  class="btn-close"

[Killed] BooleanLiteral
main/components/TabComponent/TeamsTabComponent.jsx:28:70
   const [postTeamModal, setPostTeamModal] = useState(false);
   const [csvModal, setCsvModal] = useState(false);
   const [errorPostTeamModal, setErrorPostTeamModal] = useState(false);
-  const [errorPostCSVTeamModal, setErrorPostCSVTeamModal] = useState(false);
+  const [errorPostCSVTeamModal, setErrorPostCSVTeamModal] = useState(true);
   const [partialSuccessPostCSVTeamModal, setPartialSuccessPostCSVTeamModal] =
     useState(false);
killedBy: InstructorCourseShowPage tests does not show error modal on initial render
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  aria-modal="true"
  class="fade modal show"
  role="dialog"
  style="display: block; padding-right: 0px;"
  tabindex="-1"

[Killed] BooleanLiteral
main/components/TabComponent/TeamsTabComponent.jsx:30:14
   const [errorPostTeamModal, setErrorPostTeamModal] = useState(false);
   const [errorPostCSVTeamModal, setErrorPostCSVTeamModal] = useState(false);
   const [partialSuccessPostCSVTeamModal, setPartialSuccessPostCSVTeamModal] =
-    useState(false);
+    useState(true);
   const [successPostCSVTeamModal, setSuccessPostCSVTeamModal] = useState(false);
 
killedBy: TeamTabComponent tests Uploads valid CSV with no errors and clears search filter
statusReason: Found multiple elements with the role "button" and name "Close"

Here are the matching elements:

Ignored nodes: comments, script, style
<button
  aria-label="Close"
  class="btn-close"

[Killed] BooleanLiteral
main/components/TabComponent/TeamsTabComponent.jsx:31:74
   const [errorPostCSVTeamModal, setErrorPostCSVTeamModal] = useState(false);
   const [partialSuccessPostCSVTeamModal, setPartialSuccessPostCSVTeamModal] =
     useState(false);
-  const [successPostCSVTeamModal, setSuccessPostCSVTeamModal] = useState(false);
+  const [successPostCSVTeamModal, setSuccessPostCSVTeamModal] = useState(true);
 
   const { data: teams } = useBackend(
killedBy: TeamTabComponent tests Uploads valid CSV with some rejected members and clears search filter
statusReason: Found multiple elements with the role "button" and name "Close"

Here are the matching elements:

Ignored nodes: comments, script, style
<button
  aria-label="Close"
  class="btn-close"

[Killed] ArrayDeclaration
main/components/TabComponent/TeamsTabComponent.jsx:34:5
   const [successPostCSVTeamModal, setSuccessPostCSVTeamModal] = useState(false);
 
   const { data: teams } = useBackend(
-    [`/api/teams/all?courseId=${courseId}`],
+    [],
     // Stryker disable next-line StringLiteral : GET and empty string are equivalent
     { method: "GET", url: `/api/teams/all?courseId=${courseId}` },
killedBy: TeamTabComponent tests Uploads valid CSV with no errors and clears search filter
statusReason: Cannot read properties of undefined (reading 'dataUpdateCount')

[Killed] StringLiteral
main/components/TabComponent/TeamsTabComponent.jsx:34:6
   const [successPostCSVTeamModal, setSuccessPostCSVTeamModal] = useState(false);
 
   const { data: teams } = useBackend(
-    [`/api/teams/all?courseId=${courseId}`],
+    [``],
     // Stryker disable next-line StringLiteral : GET and empty string are equivalent
     { method: "GET", url: `/api/teams/all?courseId=${courseId}` },
killedBy: TeamTabComponent tests Uploads valid CSV with no errors and clears search filter
statusReason: Cannot read properties of undefined (reading 'dataUpdateCount')

[Killed] ArrayDeclaration
main/components/TabComponent/TeamsTabComponent.jsx:37:5
     [`/api/teams/all?courseId=${courseId}`],
     // Stryker disable next-line StringLiteral : GET and empty string are equivalent
     { method: "GET", url: `/api/teams/all?courseId=${courseId}` },
-    [],
+    ["Stryker was here"],
     true,
   );
killedBy: TeamTabComponent tests Table Renders and expected content appears
statusReason: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] StringLiteral
main/components/TabComponent/TeamsTabComponent.jsx:40:50
     [],
     true,
   );
-  const [searchTeams, setSearchTeams] = useState("");
+  const [searchTeams, setSearchTeams] = useState("Stryker was here!");
 
   const objectToAxiosParamsCSV = (formData) => {
killedBy: TeamTabComponent tests Table Renders and expected content appears
statusReason: Unable to find an element with the text: team1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-teams-tab-component"
    >

[Killed] BlockStatement
main/components/TabComponent/TeamsTabComponent.jsx:42:48
   );
   const [searchTeams, setSearchTeams] = useState("");
 
-  const objectToAxiosParamsCSV = (formData) => {
-    const file = new FormData();
-    file.append("file", formData.upload[0]);
-    return {
-      url: `/api/teams/upload/csv`,
-      data: file,
-      params: {
-        courseId: courseId,
-      },
-      method: "POST",
-    };
-  };
+  const objectToAxiosParamsCSV = (formData) => {};
 
   const objectToAxiosParamsPost = (team) => ({
killedBy: TeamTabComponent tests Uploads valid CSV with no errors and clears search filter
statusReason: Cannot read properties of undefined (reading 'params')

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] StringLiteral
main/components/TabComponent/TeamsTabComponent.jsx:46:12
     const file = new FormData();
     file.append("file", formData.upload[0]);
     return {
-      url: `/api/teams/upload/csv`,
+      url: ``,
       data: file,
       params: {
killedBy: TeamTabComponent tests Uploads valid CSV with no errors and clears search filter
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-success-post-csv-team-modal"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 1024px;"
>

[Killed] ArrowFunction
main/components/TabComponent/TeamsTabComponent.jsx:55:35
     };
   };
 
-  const objectToAxiosParamsPost = (team) => ({
-    url: `/api/teams/post`,
-    method: "POST",
-    params: {
-      courseId: courseId,
-      name: team.name,
-    },
-  });
+  const objectToAxiosParamsPost = () => undefined;
 
   const objectToAxiosParamsPushTeamsToGithub = () => ({
killedBy: TeamTabComponent tests TeamsForm submit works and clears search filter
statusReason: expected +0 to deeply equal 2

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] StringLiteral
main/components/TabComponent/TeamsTabComponent.jsx:56:10
   };
 
   const objectToAxiosParamsPost = (team) => ({
-    url: `/api/teams/post`,
+    url: ``,
     method: "POST",
     params: {
killedBy: TeamTabComponent tests TeamsForm submit works and clears search filter
statusReason: expected 1 to deeply equal 2

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] StringLiteral
main/components/TabComponent/TeamsTabComponent.jsx:57:13
 
   const objectToAxiosParamsPost = (team) => ({
     url: `/api/teams/post`,
-    method: "POST",
+    method: "",
     params: {
       courseId: courseId,
killedBy: TeamTabComponent tests TeamsForm submit works and clears search filter
statusReason: expected +0 to deeply equal 2

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ArrowFunction
main/components/TabComponent/TeamsTabComponent.jsx:64:48
     },
   });
 
-  const objectToAxiosParamsPushTeamsToGithub = () => ({
-    url: `/api/jobs/launch/pushTeamsToGithub`,
-    method: "POST",
-    params: {
-      courseId: courseId,
-    },
-  });
+  const objectToAxiosParamsPushTeamsToGithub = () => undefined;
 
   const objectToAxiosParamsPullTeamsFromGithub = () => ({
killedBy: TeamTabComponent tests Push teams to Github button works correctly
statusReason: expected +0 to deeply equal 1

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] ArrowFunction
main/components/TabComponent/TeamsTabComponent.jsx:72:50
     },
   });
 
-  const objectToAxiosParamsPullTeamsFromGithub = () => ({
-    url: `/api/jobs/launch/pullTeamsFromGithub`,
-    method: "POST",
-    params: {
-      courseId: courseId,
-    },
-  });
+  const objectToAxiosParamsPullTeamsFromGithub = () => undefined;
 
   const objectToAxiosParamsAddTeamToGithub = (team) => ({
killedBy: TeamTabComponent tests Pull teams from Github button works correctly
statusReason: expected +0 to deeply equal 1

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] StringLiteral
main/components/TabComponent/TeamsTabComponent.jsx:73:10
   });
 
   const objectToAxiosParamsPullTeamsFromGithub = () => ({
-    url: `/api/jobs/launch/pullTeamsFromGithub`,
+    url: ``,
     method: "POST",
     params: {
killedBy: TeamTabComponent tests Pull teams from Github button works correctly
statusReason: expected '' to be '/api/jobs/launch/pullTeamsFromGithub' // Object.is equality

[Killed] ObjectLiteral
main/components/TabComponent/TeamsTabComponent.jsx:75:13
   const objectToAxiosParamsPullTeamsFromGithub = () => ({
     url: `/api/jobs/launch/pullTeamsFromGithub`,
     method: "POST",
-    params: {
-      courseId: courseId,
-    },
+    params: {},
   });
 
killedBy: TeamTabComponent tests Pull teams from Github button works correctly
statusReason: expected {} to deeply equal { courseId: 1 }

[Killed] ArrowFunction
main/components/TabComponent/TeamsTabComponent.jsx:80:46
     },
   });
 
-  const objectToAxiosParamsAddTeamToGithub = (team) => ({
-    url: `/api/jobs/launch/addTeamToGithub`,
-    method: "POST",
-    params: {
-      courseId: courseId,
-      teamName: team.name,
-    },
-  });
+  const objectToAxiosParamsAddTeamToGithub = () => undefined;
 
   const onSuccessTeams = (modalFn) => {
killedBy: TeamTabComponent tests TeamsForm submit works and clears search filter
statusReason: expected 1 to deeply equal 2

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] ObjectLiteral
main/components/TabComponent/TeamsTabComponent.jsx:80:57
     },
   });
 
-  const objectToAxiosParamsAddTeamToGithub = (team) => ({
-    url: `/api/jobs/launch/addTeamToGithub`,
-    method: "POST",
-    params: {
-      courseId: courseId,
-      teamName: team.name,
-    },
-  });
+  const objectToAxiosParamsAddTeamToGithub = (team) => ({});
 
   const onSuccessTeams = (modalFn) => {
killedBy: TeamTabComponent tests TeamsForm submit works and clears search filter
statusReason: expected 1 to deeply equal 2

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] StringLiteral
main/components/TabComponent/TeamsTabComponent.jsx:82:13
 
   const objectToAxiosParamsAddTeamToGithub = (team) => ({
     url: `/api/jobs/launch/addTeamToGithub`,
-    method: "POST",
+    method: "",
     params: {
       courseId: courseId,
killedBy: TeamTabComponent tests TeamsForm submit works and clears search filter
statusReason: expected 1 to deeply equal 2

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] ObjectLiteral
main/components/TabComponent/TeamsTabComponent.jsx:83:13
   const objectToAxiosParamsAddTeamToGithub = (team) => ({
     url: `/api/jobs/launch/addTeamToGithub`,
     method: "POST",
-    params: {
-      courseId: courseId,
-      teamName: team.name,
-    },
+    params: {},
   });
 
killedBy: TeamTabComponent tests TeamsForm submit works and clears search filter
statusReason: expected {} to deeply equal { courseId: 1, teamName: 'team5' }

[Killed] BlockStatement
main/components/TabComponent/TeamsTabComponent.jsx:89:39
     },
   });
 
-  const onSuccessTeams = (modalFn) => {
-    toast("Team successfully added.");
-    setSearchTeams("");
-    modalFn(false);
-  };
+  const onSuccessTeams = (modalFn) => {};
 
   const onSuccessPushTeamsToGithub = () => {
killedBy: TeamTabComponent tests TeamsForm submit works and clears search filter
statusReason: expected "spy" to be called with arguments: [ 'Team successfully added.' ]

Received: 

  1st spy call:

  [
-   "Team successfully added.",

[Killed] BooleanLiteral
main/components/TabComponent/TeamsTabComponent.jsx:92:13
   const onSuccessTeams = (modalFn) => {
     toast("Team successfully added.");
     setSearchTeams("");
-    modalFn(false);
+    modalFn(true);
   };
 
killedBy: TeamTabComponent tests TeamsForm submit works and clears search filter
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="InstructorCourseShowPage-post-modal"
>
  <div
    class="modal-content"

[Killed] BlockStatement
main/components/TabComponent/TeamsTabComponent.jsx:95:44
     modalFn(false);
   };
 
-  const onSuccessPushTeamsToGithub = () => {
-    toast("Push teams to Github job successfully started.");
-  };
+  const onSuccessPushTeamsToGithub = () => {};
 
   const onSuccessPullTeamsFromGithub = () => {
killedBy: TeamTabComponent tests Push teams to Github button works correctly
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BlockStatement
main/components/TabComponent/TeamsTabComponent.jsx:99:46
     toast("Push teams to Github job successfully started.");
   };
 
-  const onSuccessPullTeamsFromGithub = () => {
-    toast("Pull teams from Github job successfully started.");
-  };
+  const onSuccessPullTeamsFromGithub = () => {};
 
   const onSuccessAddTeamToGithub = () => {
killedBy: TeamTabComponent tests Pull teams from Github button works correctly
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BlockStatement
main/components/TabComponent/TeamsTabComponent.jsx:103:42
     toast("Pull teams from Github job successfully started.");
   };
 
-  const onSuccessAddTeamToGithub = () => {
-    toast("Add team to Github job successfully started.");
-  };
+  const onSuccessAddTeamToGithub = () => {};
 
   const teamPostMutation = useBackendMutation(
killedBy: TeamTabComponent tests TeamsForm submit works and clears search filter
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Add team to Github job successfully started.",

[Killed] BlockStatement
main/components/TabComponent/TeamsTabComponent.jsx:110:35
   const teamPostMutation = useBackendMutation(
     objectToAxiosParamsPost,
     {
-      onSuccess: (createdTeam) => {
-        onSuccessTeams(setPostTeamModal);
-        addTeamToGithubMutation.mutate(createdTeam);
-      },
+      onSuccess: (createdTeam) => {},
       onError: (error) => {
         setPostTeamModal(false);
killedBy: TeamTabComponent tests TeamsForm submit works and clears search filter
statusReason: expected 1 to deeply equal 2

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] BlockStatement
main/components/TabComponent/TeamsTabComponent.jsx:114:27
         onSuccessTeams(setPostTeamModal);
         addTeamToGithubMutation.mutate(createdTeam);
       },
-      onError: (error) => {
-        setPostTeamModal(false);
-        if (error.response.status === 409) {
-          setErrorPostTeamModal({
-            message: `Team name already exists. Please choose a different name.`,
-          });
-        } else {
-          setErrorPostTeamModal({
-            message: `${JSON.stringify(error.response.status)} error occurred while attempting to create team.`,
-          });
-        }
-      },
+      onError: (error) => {},
     },
     [`/api/teams/all?courseId=${courseId}`],
killedBy: TeamTabComponent tests TeamForm (adding individual team) returns correct error when team already exists
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-error-post-team-modal"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 1024px;"
>

[Killed] BooleanLiteral
main/components/TabComponent/TeamsTabComponent.jsx:115:26
         addTeamToGithubMutation.mutate(createdTeam);
       },
       onError: (error) => {
-        setPostTeamModal(false);
+        setPostTeamModal(true);
         if (error.response.status === 409) {
           setErrorPostTeamModal({
killedBy: TeamTabComponent tests TeamForm (adding individual team) returns correct error when team already exists
statusReason: Found multiple elements with the role "button" and name "Close"

Here are the matching elements:

Ignored nodes: comments, script, style
<button
  aria-label="Close"
  class="btn-close"

[Killed] BlockStatement
main/components/TabComponent/TeamsTabComponent.jsx:116:44
       },
       onError: (error) => {
         setPostTeamModal(false);
-        if (error.response.status === 409) {
-          setErrorPostTeamModal({
-            message: `Team name already exists. Please choose a different name.`,
-          });
-        } else {
+        if (error.response.status === 409) {} else {
           setErrorPostTeamModal({
             message: `${JSON.stringify(error.response.status)} error occurred while attempting to create team.`,
killedBy: TeamTabComponent tests TeamForm (adding individual team) returns correct error when team already exists
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-error-post-team-modal"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ConditionalExpression
main/components/TabComponent/TeamsTabComponent.jsx:116:13
       },
       onError: (error) => {
         setPostTeamModal(false);
-        if (error.response.status === 409) {
+        if (true) {
           setErrorPostTeamModal({
             message: `Team name already exists. Please choose a different name.`,
killedBy: TeamTabComponent tests TeamForm (adding individual team) returns correct error modal when an unexpected error occurs
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  500 error occurred while attempting to create team.
Received:
  Error Creating Team Team name already exists. Please choose a different name.

[Killed] BlockStatement
main/components/TabComponent/TeamsTabComponent.jsx:120:16
           setErrorPostTeamModal({
             message: `Team name already exists. Please choose a different name.`,
           });
-        } else {
-          setErrorPostTeamModal({
-            message: `${JSON.stringify(error.response.status)} error occurred while attempting to create team.`,
-          });
-        }
+        } else {}
       },
     },
killedBy: TeamTabComponent tests TeamForm (adding individual team) returns correct error modal when an unexpected error occurs
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-error-post-team-modal"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ObjectLiteral
main/components/TabComponent/TeamsTabComponent.jsx:121:33
             message: `Team name already exists. Please choose a different name.`,
           });
         } else {
-          setErrorPostTeamModal({
-            message: `${JSON.stringify(error.response.status)} error occurred while attempting to create team.`,
-          });
+          setErrorPostTeamModal({});
         }
       },
killedBy: TeamTabComponent tests TeamForm (adding individual team) returns correct error modal when an unexpected error occurs
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  500 error occurred while attempting to create team.
Received:
  Error Creating Team

[Killed] BlockStatement
main/components/TabComponent/TeamsTabComponent.jsx:133:28
   const teamCsvMutation = useBackendMutation(
     objectToAxiosParamsCSV,
     {
-      onSuccess: (data) => {
-        setCsvModal(false);
-        setSearchTeams("");
-        setSuccessPostCSVTeamModal({
-          message: `New members: ${data.created}, Existing members: ${data.existing}`,
-        });
-      },
+      onSuccess: (data) => {},
       onError: (error) => {
         setCsvModal(false);
killedBy: TeamTabComponent tests Uploads valid CSV with no errors and clears search filter
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="InstructorCourseShowPage-csv-modal"
>
  <div
    class="modal-content"

[Killed] BooleanLiteral
main/components/TabComponent/TeamsTabComponent.jsx:134:21
     objectToAxiosParamsCSV,
     {
       onSuccess: (data) => {
-        setCsvModal(false);
+        setCsvModal(true);
         setSearchTeams("");
         setSuccessPostCSVTeamModal({
killedBy: TeamTabComponent tests Uploads valid CSV with no errors and clears search filter
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="InstructorCourseShowPage-csv-modal"
>
  <div
    class="modal-content"

[Killed] ObjectLiteral
main/components/TabComponent/TeamsTabComponent.jsx:136:36
       onSuccess: (data) => {
         setCsvModal(false);
         setSearchTeams("");
-        setSuccessPostCSVTeamModal({
-          message: `New members: ${data.created}, Existing members: ${data.existing}`,
-        });
+        setSuccessPostCSVTeamModal({});
       },
       onError: (error) => {
killedBy: TeamTabComponent tests Uploads valid CSV with no errors and clears search filter
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  New members: 5, Existing members: 0
Received:
  CSV Import Successful

[Killed] StringLiteral
main/components/TabComponent/TeamsTabComponent.jsx:137:20
         setCsvModal(false);
         setSearchTeams("");
         setSuccessPostCSVTeamModal({
-          message: `New members: ${data.created}, Existing members: ${data.existing}`,
+          message: ``,
         });
       },
killedBy: TeamTabComponent tests Uploads valid CSV with no errors and clears search filter
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  New members: 5, Existing members: 0
Received:
  CSV Import Successful

[Killed] BooleanLiteral
main/components/TabComponent/TeamsTabComponent.jsx:141:21
         });
       },
       onError: (error) => {
-        setCsvModal(false);
+        setCsvModal(true);
         setSearchTeams("");
         if (error.response.status === 400) {
killedBy: TeamTabComponent tests Uploads valid CSV with some rejected members and clears search filter
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="InstructorCourseShowPage-csv-modal"
>
  <div
    class="modal-content"

[Killed] StringLiteral
main/components/TabComponent/TeamsTabComponent.jsx:142:24
       },
       onError: (error) => {
         setCsvModal(false);
-        setSearchTeams("");
+        setSearchTeams("Stryker was here!");
         if (error.response.status === 400) {
           setErrorPostCSVTeamModal({
killedBy: TeamTabComponent tests Uploads valid CSV with some rejected members and clears search filter
statusReason: expected 'Stryker was here!' to be '' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] ConditionalExpression
main/components/TabComponent/TeamsTabComponent.jsx:143:13
       onError: (error) => {
         setCsvModal(false);
         setSearchTeams("");
-        if (error.response.status === 400) {
+        if (true) {
           setErrorPostCSVTeamModal({
             message: `Upload failed (Error 400). Please ensure your CSV follows one of the formats documented in the 'Help' section.`,
killedBy: TeamTabComponent tests Uploads valid CSV with some rejected members and clears search filter
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-partial-success-post-csv-team-modal"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 1024px;"
>

[Killed] ConditionalExpression
main/components/TabComponent/TeamsTabComponent.jsx:143:13
       onError: (error) => {
         setCsvModal(false);
         setSearchTeams("");
-        if (error.response.status === 400) {
+        if (false) {
           setErrorPostCSVTeamModal({
             message: `Upload failed (Error 400). Please ensure your CSV follows one of the formats documented in the 'Help' section.`,
killedBy: TeamTabComponent tests Returns correct modal for invalid CSV format and clears search filter
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Upload failed (Error 400). Please ensure your CSV follows one of the formats documented in the 'Help' section.
Received:
  CSV Import Unsuccessful 400 error occurred while processing the CSV file.

[Killed] ConditionalExpression
main/components/TabComponent/TeamsTabComponent.jsx:147:20
           setErrorPostCSVTeamModal({
             message: `Upload failed (Error 400). Please ensure your CSV follows one of the formats documented in the 'Help' section.`,
           });
-        } else if (error.response.status === 409) {
+        } else if (false) {
           setPartialSuccessPostCSVTeamModal({
killedBy: TeamTabComponent tests Uploads valid CSV with some rejected members and clears search filter
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-partial-success-post-csv-team-modal"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 1024px;"
>

[Killed] EqualityOperator
main/components/TabComponent/TeamsTabComponent.jsx:147:20
           setErrorPostCSVTeamModal({
             message: `Upload failed (Error 400). Please ensure your CSV follows one of the formats documented in the 'Help' section.`,
           });
-        } else if (error.response.status === 409) {
+        } else if (error.response.status !== 409) {
           setPartialSuccessPostCSVTeamModal({
killedBy: TeamTabComponent tests Uploads valid CSV with some rejected members and clears search filter
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-partial-success-post-csv-team-modal"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 1024px;"
>

[Killed] BlockStatement
main/components/TabComponent/TeamsTabComponent.jsx:151:16
           setPartialSuccessPostCSVTeamModal({
           });
-        } else {
-          setErrorPostCSVTeamModal({
-            message: `${JSON.stringify(error.response.status, null, 2)} error occurred while processing the CSV file.`,
-          });
-        }
+        } else {}
       },
     },
killedBy: TeamTabComponent tests Returns correct error modal for CSV when unexpected error occurs and clears search filter
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-error-post-csv-team-modal"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>
