[Killed] ArrayDeclaration
main/components/TabComponent/TeamsTabComponent.jsx:158:5
         }
       },
     },
-    [`/api/teams/all?courseId=${courseId}`],
+    [],
   );
 
killedBy: TeamTabComponent tests Uploads valid CSV with no errors and clears search filter
statusReason: expected +0 to deeply equal 1

[Killed] StringLiteral
main/components/TabComponent/TeamsTabComponent.jsx:158:6
         }
       },
     },
-    [`/api/teams/all?courseId=${courseId}`],
+    [``],
   );
 
killedBy: TeamTabComponent tests Uploads valid CSV with no errors and clears search filter
statusReason: expected +0 to deeply equal 1

[Killed] ObjectLiteral
main/components/TabComponent/TeamsTabComponent.jsx:163:5
 
   const pushTeamsToGithubMutation = useBackendMutation(
     objectToAxiosParamsPushTeamsToGithub,
-    { onSuccess: onSuccessPushTeamsToGithub },
+    {},
   );
 
killedBy: TeamTabComponent tests Push teams to Github button works correctly
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] ObjectLiteral
main/components/TabComponent/TeamsTabComponent.jsx:173:5
 
   const addTeamToGithubMutation = useBackendMutation(
     objectToAxiosParamsAddTeamToGithub,
-    { onSuccess: onSuccessAddTeamToGithub },
+    {},
   );
 
killedBy: TeamTabComponent tests TeamsForm submit works and clears search filter
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Add team to Github job successfully started.",

[Killed] BlockStatement
main/components/TabComponent/TeamsTabComponent.jsx:176:41
     { onSuccess: onSuccessAddTeamToGithub },
   );
 
-  const handleCsvSubmit = (formData) => {
-    teamCsvMutation.mutate(formData);
-  };
+  const handleCsvSubmit = (formData) => {};
 
   const handlePostSubmit = (team) => {
killedBy: TeamTabComponent tests Uploads valid CSV with no errors and clears search filter
statusReason: Cannot read properties of undefined (reading 'params')

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] BlockStatement
main/components/TabComponent/TeamsTabComponent.jsx:180:38
     teamCsvMutation.mutate(formData);
   };
 
-  const handlePostSubmit = (team) => {
-    teamPostMutation.mutate(team);
-  };
+  const handlePostSubmit = (team) => {};
 
   const handlePushTeamsToGithub = () => {
killedBy: TeamTabComponent tests TeamsForm submit works and clears search filter
statusReason: expected +0 to deeply equal 2

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] BlockStatement
main/components/TabComponent/TeamsTabComponent.jsx:184:41
     teamPostMutation.mutate(team);
   };
 
-  const handlePushTeamsToGithub = () => {
-    pushTeamsToGithubMutation.mutate();
-  };
+  const handlePushTeamsToGithub = () => {};
 
   const handlePullTeamsFromGithub = () => {
killedBy: TeamTabComponent tests Push teams to Github button works correctly
statusReason: expected +0 to deeply equal 1

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/components/TabComponent/TeamsTabComponent.jsx:188:43
     pushTeamsToGithubMutation.mutate();
   };
 
-  const handlePullTeamsFromGithub = () => {
-    pullTeamsFromGithubMutation.mutate();
-  };
+  const handlePullTeamsFromGithub = () => {};
 
   const openCsvHelp = () => {
killedBy: TeamTabComponent tests Pull teams from Github button works correctly
statusReason: expected +0 to deeply equal 1

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/components/TabComponent/TeamsTabComponent.jsx:192:29
     pullTeamsFromGithubMutation.mutate();
   };
 
-  const openCsvHelp = () => {
-    window.open("/help/csv#team-information", "_blank");
-  };
+  const openCsvHelp = () => {};
 
   return (
killedBy: TeamTabComponent tests Info icon displays tooltip and opens help page on click
statusReason: expected "spy" to be called with arguments: [ '/help/csv#team-information', …(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/TabComponent/TeamsTabComponent.jsx:197:23
   };
 
   return (
-    <div data-testid={`${testIdPrefix}-teams-tab-component`}>
+    <div data-testid={``}>
       <Modal
         show={csvModal}
killedBy: TeamTabComponent tests Table Renders and expected content appears
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-teams-tab-component"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid=""
    >

[Killed] ArrowFunction
main/components/TabComponent/TeamsTabComponent.jsx:211:17
       </Modal>
       <Modal
         show={postTeamModal}
-        onHide={() => setPostTeamModal(false)}
+        onHide={() => undefined}
         centered={true}
         data-testid={`${testIdPrefix}-post-modal`}
killedBy: TeamTabComponent tests Modals close on close buttons, push teams button is enabled
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="InstructorCourseShowPage-post-modal"
>
  <div
    class="modal-content"

[Killed] BooleanLiteral
main/components/TabComponent/TeamsTabComponent.jsx:211:40
       </Modal>
       <Modal
         show={postTeamModal}
-        onHide={() => setPostTeamModal(false)}
+        onHide={() => setPostTeamModal(true)}
         centered={true}
         data-testid={`${testIdPrefix}-post-modal`}
killedBy: TeamTabComponent tests Modals close on close buttons, push teams button is enabled
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="InstructorCourseShowPage-post-modal"
>
  <div
    class="modal-content"

[Killed] BooleanLiteral
main/components/TabComponent/TeamsTabComponent.jsx:212:19
       <Modal
         show={postTeamModal}
         onHide={() => setPostTeamModal(false)}
-        centered={true}
+        centered={false}
         data-testid={`${testIdPrefix}-post-modal`}
       >
killedBy: TeamTabComponent tests TeamsForm submit works and clears search filter
statusReason: expect(element).toHaveClass("modal-dialog modal-dialog-centered")

Expected the element to have class:
  modal-dialog modal-dialog-centered
Received:
  modal-dialog

[Killed] BooleanLiteral
main/components/TabComponent/TeamsTabComponent.jsx:217:70
       >
         <ModalHeader closeButton>Add Individual Team</ModalHeader>
         <ModalBody>
-          <TeamsForm submitAction={handlePostSubmit} cancelDisabled={true} />
+          <TeamsForm submitAction={handlePostSubmit} cancelDisabled={false} />
         </ModalBody>
       </Modal>
killedBy: TeamTabComponent tests Cancel button is not rendered when not editing
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="btn btn-Secondary"
  data-testid="TeamsForm-cancel"
  type="button"
>
  Cancel

[Killed] ArrowFunction
main/components/TabComponent/TeamsTabComponent.jsx:222:17
       </Modal>
       <Modal
         show={errorPostTeamModal}
-        onHide={() => setErrorPostTeamModal(false)}
+        onHide={() => undefined}
         centered={true}
         data-testid={`${testIdPrefix}-error-post-team-modal`}
killedBy: TeamTabComponent tests TeamForm (adding individual team) returns correct error when team already exists
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="InstructorCourseShowPage-error-post-team-modal"
>
  <div
    class="modal-content"

[Killed] BooleanLiteral
main/components/TabComponent/TeamsTabComponent.jsx:222:45
       </Modal>
       <Modal
         show={errorPostTeamModal}
-        onHide={() => setErrorPostTeamModal(false)}
+        onHide={() => setErrorPostTeamModal(true)}
         centered={true}
         data-testid={`${testIdPrefix}-error-post-team-modal`}
killedBy: TeamTabComponent tests TeamForm (adding individual team) returns correct error when team already exists
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="InstructorCourseShowPage-error-post-team-modal"
>
  <div
    class="modal-content"

[Killed] BooleanLiteral
main/components/TabComponent/TeamsTabComponent.jsx:223:19
       <Modal
         show={errorPostTeamModal}
         onHide={() => setErrorPostTeamModal(false)}
-        centered={true}
+        centered={false}
         data-testid={`${testIdPrefix}-error-post-team-modal`}
       >
killedBy: TeamTabComponent tests TeamForm (adding individual team) returns correct error when team already exists
statusReason: expect(element).toHaveClass("modal-dialog modal-dialog-centered")

Expected the element to have class:
  modal-dialog modal-dialog-centered
Received:
  modal-dialog

[Killed] ArrowFunction
main/components/TabComponent/TeamsTabComponent.jsx:233:17
       </Modal>
       <Modal
         show={errorPostCSVTeamModal}
-        onHide={() => setErrorPostCSVTeamModal(false)}
+        onHide={() => undefined}
         centered={true}
         data-testid={`${testIdPrefix}-error-post-csv-team-modal`}
killedBy: TeamTabComponent tests Returns correct modal for invalid CSV format and clears search filter
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="InstructorCourseShowPage-error-post-csv-team-modal"
>
  <div
    class="modal-content"

[Killed] BooleanLiteral
main/components/TabComponent/TeamsTabComponent.jsx:233:48
       </Modal>
       <Modal
         show={errorPostCSVTeamModal}
-        onHide={() => setErrorPostCSVTeamModal(false)}
+        onHide={() => setErrorPostCSVTeamModal(true)}
         centered={true}
         data-testid={`${testIdPrefix}-error-post-csv-team-modal`}
killedBy: TeamTabComponent tests Returns correct modal for invalid CSV format and clears search filter
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="InstructorCourseShowPage-error-post-csv-team-modal"
>
  <div
    class="modal-content"

[Killed] BooleanLiteral
main/components/TabComponent/TeamsTabComponent.jsx:234:19
       <Modal
         show={errorPostCSVTeamModal}
         onHide={() => setErrorPostCSVTeamModal(false)}
-        centered={true}
+        centered={false}
         data-testid={`${testIdPrefix}-error-post-csv-team-modal`}
       >
killedBy: TeamTabComponent tests Returns correct error modal for CSV when unexpected error occurs and clears search filter
statusReason: expect(element).toHaveClass("modal-dialog modal-dialog-centered")

Expected the element to have class:
  modal-dialog modal-dialog-centered
Received:
  modal-dialog

[Killed] ArrowFunction
main/components/TabComponent/TeamsTabComponent.jsx:244:17
       </Modal>
       <Modal
         show={successPostCSVTeamModal}
-        onHide={() => setSuccessPostCSVTeamModal(false)}
+        onHide={() => undefined}
         centered={true}
         data-testid={`${testIdPrefix}-success-post-csv-team-modal`}
killedBy: TeamTabComponent tests Uploads valid CSV with no errors and clears search filter
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="InstructorCourseShowPage-success-post-csv-team-modal"
>
  <div
    class="modal-content"

[Killed] BooleanLiteral
main/components/TabComponent/TeamsTabComponent.jsx:244:50
       </Modal>
       <Modal
         show={successPostCSVTeamModal}
-        onHide={() => setSuccessPostCSVTeamModal(false)}
+        onHide={() => setSuccessPostCSVTeamModal(true)}
         centered={true}
         data-testid={`${testIdPrefix}-success-post-csv-team-modal`}
killedBy: TeamTabComponent tests Uploads valid CSV with no errors and clears search filter
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="InstructorCourseShowPage-success-post-csv-team-modal"
>
  <div
    class="modal-content"

[Killed] BooleanLiteral
main/components/TabComponent/TeamsTabComponent.jsx:245:19
       <Modal
         show={successPostCSVTeamModal}
         onHide={() => setSuccessPostCSVTeamModal(false)}
-        centered={true}
+        centered={false}
         data-testid={`${testIdPrefix}-success-post-csv-team-modal`}
       >
killedBy: TeamTabComponent tests Uploads valid CSV with no errors and clears search filter
statusReason: expect(element).toHaveClass("modal-dialog modal-dialog-centered")

Expected the element to have class:
  modal-dialog modal-dialog-centered
Received:
  modal-dialog

[Killed] StringLiteral
main/components/TabComponent/TeamsTabComponent.jsx:246:22
         show={successPostCSVTeamModal}
         onHide={() => setSuccessPostCSVTeamModal(false)}
         centered={true}
-        data-testid={`${testIdPrefix}-success-post-csv-team-modal`}
+        data-testid={``}
       >
         <ModalHeader closeButton>
killedBy: TeamTabComponent tests Uploads valid CSV with no errors and clears search filter
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-success-post-csv-team-modal"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 1024px;"
>

[Killed] BooleanLiteral
main/components/TabComponent/TeamsTabComponent.jsx:255:57
       </Modal>
       <Modal
         show={partialSuccessPostCSVTeamModal}
-        onHide={() => setPartialSuccessPostCSVTeamModal(false)}
+        onHide={() => setPartialSuccessPostCSVTeamModal(true)}
         centered={true}
         data-testid={`${testIdPrefix}-partial-success-post-csv-team-modal`}
killedBy: TeamTabComponent tests Uploads valid CSV with some rejected members and clears search filter
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="InstructorCourseShowPage-partial-success-post-csv-team-modal"
>
  <div
    class="modal-content"

[Killed] ArrowFunction
main/components/TabComponent/TeamsTabComponent.jsx:255:17
       </Modal>
       <Modal
         show={partialSuccessPostCSVTeamModal}
-        onHide={() => setPartialSuccessPostCSVTeamModal(false)}
+        onHide={() => undefined}
         centered={true}
         data-testid={`${testIdPrefix}-partial-success-post-csv-team-modal`}
killedBy: TeamTabComponent tests Uploads valid CSV with some rejected members and clears search filter
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="InstructorCourseShowPage-partial-success-post-csv-team-modal"
>
  <div
    class="modal-content"

[Killed] BooleanLiteral
main/components/TabComponent/TeamsTabComponent.jsx:256:19
       <Modal
         show={partialSuccessPostCSVTeamModal}
         onHide={() => setPartialSuccessPostCSVTeamModal(false)}
-        centered={true}
+        centered={false}
         data-testid={`${testIdPrefix}-partial-success-post-csv-team-modal`}
       >
killedBy: TeamTabComponent tests Uploads valid CSV with some rejected members and clears search filter
statusReason: expect(element).toHaveClass("modal-dialog modal-dialog-centered")

Expected the element to have class:
  modal-dialog modal-dialog-centered
Received:
  modal-dialog

[Killed] StringLiteral
main/components/TabComponent/TeamsTabComponent.jsx:257:22
         show={partialSuccessPostCSVTeamModal}
         onHide={() => setPartialSuccessPostCSVTeamModal(false)}
         centered={true}
-        data-testid={`${testIdPrefix}-partial-success-post-csv-team-modal`}
+        data-testid={``}
       >
         <ModalHeader closeButton>
killedBy: TeamTabComponent tests Uploads valid CSV with some rejected members and clears search filter
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-partial-success-post-csv-team-modal"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 1024px;"
>

[Killed] ArrowFunction
main/components/TabComponent/TeamsTabComponent.jsx:301:22
         </Col>
         <Col>
           <Button
-            onClick={() => setPostTeamModal(true)}
+            onClick={() => undefined}
             data-testid={`${testIdPrefix}-post-button`}
             className="w-100"
killedBy: TeamTabComponent tests Cancel button is not rendered when not editing
statusReason: Unable to find a label with the text of: Team Name

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-teams-tab-component"
    >

[Killed] BooleanLiteral
main/components/TabComponent/TeamsTabComponent.jsx:301:45
         </Col>
         <Col>
           <Button
-            onClick={() => setPostTeamModal(true)}
+            onClick={() => setPostTeamModal(false)}
             data-testid={`${testIdPrefix}-post-button`}
             className="w-100"
killedBy: TeamTabComponent tests Cancel button is not rendered when not editing
statusReason: Unable to find a label with the text of: Team Name

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-teams-tab-component"
    >

[Killed] StringLiteral
main/components/TabComponent/TeamsTabComponent.jsx:302:26
         <Col>
           <Button
             onClick={() => setPostTeamModal(true)}
-            data-testid={`${testIdPrefix}-post-button`}
+            data-testid={``}
             className="w-100"
           >
killedBy: TeamTabComponent tests Table Renders and expected content appears
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-post-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-teams-tab-component"
    >

[Killed] StringLiteral
main/components/TabComponent/TeamsTabComponent.jsx:312:26
           <Button
             onClick={handlePushTeamsToGithub}
             className="w-100"
-            data-testid={`${testIdPrefix}-push-teams-button`}
+            data-testid={``}
           >
             Push Teams to Github
killedBy: TeamTabComponent tests Modals close on close buttons, push teams button is enabled
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-push-teams-button"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ArrowFunction
main/components/TabComponent/TeamsTabComponent.jsx:338:27
                 type="text"
                 placeholder="Search by Team Name."
                 value={searchTeams}
-                onChange={(e) => setSearchTeams(e.target.value)}
+                onChange={() => undefined}
                 data-testid={`${testIdPrefix}-search`}
               />
killedBy: TeamTabComponent tests Uploads valid CSV with no errors and clears search filter
statusReason: expected '' to be 'test search' // Object.is equality

[Killed] ConditionalExpression
main/components/TabComponent/TeamsTabComponent.jsx:347:19
       </Row>
       <Row>
         <TeamsTable
-          teams={(teams || []).filter((team) => {
+          teams={(true).filter((team) => {
             const searchTermLower = searchTeams.toLowerCase();
             if (team.name.toLowerCase().includes(searchTermLower)) {
killedBy: TeamTabComponent tests Table Renders and expected content appears
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).filter is not a function

[Killed] MethodExpression
main/components/TabComponent/TeamsTabComponent.jsx:347:18
       </Row>
       <Row>
         <TeamsTable
-          teams={(teams || []).filter((team) => {
-            const searchTermLower = searchTeams.toLowerCase();
-            if (team.name.toLowerCase().includes(searchTermLower)) {
-              return true;
-            }
-            return false;
-          })}
+          teams={teams || []}
           currentUser={currentUser}
           courseId={courseId}
killedBy: TeamTabComponent tests Search filter works correctly Search by Team Name.
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h3
  data-testid="InstructorCourseShowPage-teams-table-3-name"
>
  team1
</h3> instead

[Killed] MethodExpression
main/components/TabComponent/TeamsTabComponent.jsx:348:37
       <Row>
         <TeamsTable
           teams={(teams || []).filter((team) => {
-            const searchTermLower = searchTeams.toLowerCase();
+            const searchTermLower = searchTeams.toUpperCase();
             if (team.name.toLowerCase().includes(searchTermLower)) {
               return true;
killedBy: TeamTabComponent tests Search filter works correctly Search by Team Name.
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-teams-table-3-name"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] MethodExpression
main/components/TabComponent/TeamsTabComponent.jsx:349:17
         <TeamsTable
           teams={(teams || []).filter((team) => {
             const searchTermLower = searchTeams.toLowerCase();
-            if (team.name.toLowerCase().includes(searchTermLower)) {
+            if (team.name.toUpperCase().includes(searchTermLower)) {
               return true;
             }
killedBy: TeamTabComponent tests Search filter works correctly Search by Team Name.
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-teams-table-3-name"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] BlockStatement
main/components/TabComponent/TeamsTabComponent.jsx:349:68
         <TeamsTable
           teams={(teams || []).filter((team) => {
             const searchTermLower = searchTeams.toLowerCase();
-            if (team.name.toLowerCase().includes(searchTermLower)) {
-              return true;
-            }
+            if (team.name.toLowerCase().includes(searchTermLower)) {}
             return false;
           })}
killedBy: TeamTabComponent tests Table Renders and expected content appears
statusReason: Unable to find an element with the text: team1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-teams-tab-component"
    >

[Killed] BooleanLiteral
main/components/TabComponent/TeamsTabComponent.jsx:350:22
           teams={(teams || []).filter((team) => {
             const searchTermLower = searchTeams.toLowerCase();
             if (team.name.toLowerCase().includes(searchTermLower)) {
-              return true;
+              return false;
             }
             return false;
killedBy: TeamTabComponent tests Table Renders and expected content appears
statusReason: Unable to find an element with the text: team1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-teams-tab-component"
    >
