[Killed] ConditionalExpression
main/pages/Admin/InstructorsCreatePage.js:33:7
     mutation.mutate(data);
   };
 
-  if (isSuccess & !storybook) {
+  if (false) {
     return <Navigate to="/admin/instructors" />;
   }
killedBy: InstructorsCreatePage tests on submit, makes request to backend, and redirects to /admin/instructors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"to": "/admin/instructors"}

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] ConditionalExpression
main/pages/Admin/InstructorsCreatePage.js:33:7
     mutation.mutate(data);
   };
 
-  if (isSuccess & !storybook) {
+  if (true) {
     return <Navigate to="/admin/instructors" />;
   }
killedBy: InstructorsCreatePage tests renders without crashing
statusReason: Error: Unable to find a label with the text of: Email

Ignored nodes: comments, script, style
<body>
  <div />
</body>
