[Killed] StringLiteral
main/components/Assignments/TeamRepositoryAssignmentForm.jsx:24:24
           type="text"
           isInvalid={Boolean(errors.repoPrefix)}
           data-testid="TeamRepositoryAssignmentForm-repoPrefix"
-          {...register("repoPrefix", {
+          {...register("", {
             required: "Team Repository Prefix is required.",
           })}
killedBy: InstructorCourseShowPage tests renders correctly for instructor user
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/Assignments/TeamRepositoryAssignmentForm.jsx:47:25
         <Form.Label htmlFor="permissions">Team Permissions</Form.Label>
         <Form.Control
           as="select"
-          defaultValue={"MAINTAIN"}
+          defaultValue={""}
           data-testid={"TeamRepositoryAssignmentForm-permissions"}
           {...register("permissions")}
killedBy: Calls team repository assignment successfully
statusReason: expected { courseId: 7, …(3) } to deeply equal { courseId: 7, …(3) }

[Killed] StringLiteral
main/components/Assignments/TeamRepositoryAssignmentForm.jsx:49:24
           as="select"
           defaultValue={"MAINTAIN"}
           data-testid={"TeamRepositoryAssignmentForm-permissions"}
-          {...register("permissions")}
+          {...register("")}
         >
           <option value="READ">Read</option>
killedBy: InstructorCourseShowPage tests renders correctly for instructor user
statusReason: Cannot read properties of undefined (reading '_f')
