[Killed] StringLiteral
main/components/Jobs/DeleteEmptyRepoForm.jsx:7:40
 import { toast } from "react-toastify";
 
 const DeleteEmptyReposForm = ({ courseId }) => {
-  const [prefix, setPrefix] = useState("");
+  const [prefix, setPrefix] = useState("Stryker was here!");
 
   // Configure the Axios request for the DELETE endpoint
killedBy: DeleteEmptyRepoForm tests renders correctly and checks initial state
statusReason: expect(element).toHaveValue()

Expected the element to have value:

Received:
  Stryker was here!

[Killed] ArrowFunction
main/components/Jobs/DeleteEmptyRepoForm.jsx:11:31
 
   // Configure the Axios request for the DELETE endpoint
   // Configure the Axios request for the DELETE endpoint
-  const objectToAxiosParams = () => ({
-    url: "/api/repos",
-    method: "DELETE",
-    params: {
-      courseId,
-      prefix,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   // Setup the mutation using your team's standard hook
killedBy: DeleteEmptyRepoForm tests calls API, toasts success, and clears input on valid submit
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] StringLiteral
main/components/Jobs/DeleteEmptyRepoForm.jsx:12:10
   // Configure the Axios request for the DELETE endpoint
   // Configure the Axios request for the DELETE endpoint
   const objectToAxiosParams = () => ({
-    url: "/api/repos",
+    url: "",
     method: "DELETE",
     params: {
killedBy: DeleteEmptyRepoForm tests calls API, toasts success, and clears input on valid submit
statusReason: expected '' to be '/api/repos' // Object.is equality

[Killed] StringLiteral
main/components/Jobs/DeleteEmptyRepoForm.jsx:13:13
   // Configure the Axios request for the DELETE endpoint
   const objectToAxiosParams = () => ({
     url: "/api/repos",
-    method: "DELETE",
+    method: "",
     params: {
       courseId,
killedBy: DeleteEmptyRepoForm tests calls API, toasts success, and clears input on valid submit
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] BlockStatement
main/components/Jobs/DeleteEmptyRepoForm.jsx:24:24
   const deleteMutation = useBackendMutation(
     objectToAxiosParams,
     {
-      onSuccess: () => {
-        toast(`Delete empty repos job launched for prefix: ${prefix}`);
-        setPrefix(""); // Clear the input after launching
-      },
+      onSuccess: () => {},
       onError: (error) => {
         toast.error(
killedBy: DeleteEmptyRepoForm tests calls API, toasts success, and clears input on valid submit
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BlockStatement
main/components/Jobs/DeleteEmptyRepoForm.jsx:28:27
         toast(`Delete empty repos job launched for prefix: ${prefix}`);
         setPrefix(""); // Clear the input after launching
       },
-      onError: (error) => {
-        toast.error(
-          `Error starting job: ${error.response?.data?.message || error.message}`,
-        );
-      },
+      onError: (error) => {},
     },
     // We don't necessarily need to invalidate a cache key here unless you display jobs on the same page
killedBy: DeleteEmptyRepoForm tests handles API errors (with response data) correctly
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] OptionalChaining
main/components/Jobs/DeleteEmptyRepoForm.jsx:30:34
       },
       onError: (error) => {
         toast.error(
-          `Error starting job: ${error.response?.data?.message || error.message}`,
+          `Error starting job: ${error.response.data?.message || error.message}`,
         );
       },
killedBy: DeleteEmptyRepoForm tests handles API errors (without response data fallback) correctly
statusReason: expected "vi.fn()" to be called with arguments: [ 'Error starting job: Network Error' ]

Number of calls: 0

[Killed] ConditionalExpression
main/components/Jobs/DeleteEmptyRepoForm.jsx:30:34
       },
       onError: (error) => {
         toast.error(
-          `Error starting job: ${error.response?.data?.message || error.message}`,
+          `Error starting job: ${false}`,
         );
       },
killedBy: DeleteEmptyRepoForm tests handles API errors (with response data) correctly
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Error starting job: Course not found",

[Killed] BlockStatement
main/components/Jobs/DeleteEmptyRepoForm.jsx:38:31
     ["/api/repos"],
   );
 
-  const onSubmit = (event) => {
-    event.preventDefault();
-    if (!prefix) {
-      toast.error("Please enter a prefix");
-      return;
-    }
-    deleteMutation.mutate();
-  };
+  const onSubmit = (event) => {};
 
   return (
killedBy: DeleteEmptyRepoForm tests shows error toast if prefix is empty on submit
statusReason: expected "vi.fn()" to be called with arguments: [ 'Please enter a prefix' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
main/components/Jobs/DeleteEmptyRepoForm.jsx:40:9
 
   const onSubmit = (event) => {
     event.preventDefault();
-    if (!prefix) {
+    if (true) {
       toast.error("Please enter a prefix");
       return;
killedBy: DeleteEmptyRepoForm tests calls API, toasts success, and clears input on valid submit
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] ConditionalExpression
main/components/Jobs/DeleteEmptyRepoForm.jsx:40:9
 
   const onSubmit = (event) => {
     event.preventDefault();
-    if (!prefix) {
+    if (false) {
       toast.error("Please enter a prefix");
       return;
killedBy: DeleteEmptyRepoForm tests shows error toast if prefix is empty on submit
statusReason: expected "vi.fn()" to be called with arguments: [ 'Please enter a prefix' ]

Received:

  1st vi.fn() call:

  [
-   "Please enter a prefix",

[Killed] ArrowFunction
main/components/Jobs/DeleteEmptyRepoForm.jsx:58:25
               type="text"
               placeholder="e.g., lab01"
               value={prefix}
-              onChange={(e) => setPrefix(e.target.value)}
+              onChange={() => undefined}
               data-testid="DeleteEmptyReposForm-prefix"
             />
killedBy: DeleteEmptyRepoForm tests calls API, toasts success, and clears input on valid submit
statusReason: expect(element).toHaveValue(lab01)

Expected the element to have value:
  lab01
Received:

[Killed] StringLiteral
main/components/Jobs/DeleteEmptyRepoForm.jsx:70:19
               disabled={deleteMutation.isPending}
             >
               {deleteMutation.isPending
-                ? "Launching..."
+                ? ""
                 : "Delete Empty Matching Repos"}
             </Button>
killedBy: DeleteEmptyRepoForm tests button shows Launching... and is disabled while mutating
statusReason: Unable to find an element with the text: Launching.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class="p-3 border rounded bg-light mb-4"
    >

[Killed] StringLiteral
main/components/Jobs/DeleteEmptyRepoForm.jsx:71:19
             >
               {deleteMutation.isPending
                 ? "Launching..."
-                : "Delete Empty Matching Repos"}
+                : ""}
             </Button>
           </Col>
killedBy: DeleteEmptyRepoForm tests renders correctly and checks initial state
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Delete Empty Matching Repos
Received:
