[Killed] StringLiteral
main/components/TabComponent/AssignmentTabComponent.jsx:17:10
   };
 
   const objectToAxiosParamsIndividualAssignment = (assignment) => ({
-    url: `/api/repos/createRepos`,
+    url: ``,
     method: "POST",
     params: {
killedBy: Calls individual repository assignment successfully
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Repository creation successfully started.",

[Killed] ArrowFunction
main/components/TabComponent/AssignmentTabComponent.jsx:37:45
     indvidiualAssignmentMutation.mutate(assignment);
   };
 
-  const objectToAxiosParamsTeamAssignment = (teamAssignment) => ({
-    url: `/api/repos/createTeamRepos`,
-    method: "POST",
-    params: {
-      courseId: courseId,
-      repoPrefix: teamAssignment.repoPrefix,
-      isPrivate: teamAssignment.assignmentPrivacy,
-      permissions: teamAssignment.permissions,
-      ...(teamAssignment.teamRegex
-        ? { teamRegex: teamAssignment.teamRegex }
-        : {}),
-    },
-  });
+  const objectToAxiosParamsTeamAssignment = () => undefined;
 
   const teamAssignmentMutation = useBackendMutation(
killedBy: Calls team repository assignment successfully
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Team repository creation successfully started.",

[Killed] StringLiteral
main/components/TabComponent/AssignmentTabComponent.jsx:39:13
 
   const objectToAxiosParamsTeamAssignment = (teamAssignment) => ({
     url: `/api/repos/createTeamRepos`,
-    method: "POST",
+    method: "",
     params: {
       courseId: courseId,
killedBy: Calls team repository assignment successfully
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Team repository creation successfully started.",

[Killed] ObjectLiteral
main/components/TabComponent/AssignmentTabComponent.jsx:46:11
       isPrivate: teamAssignment.assignmentPrivacy,
       permissions: teamAssignment.permissions,
       ...(teamAssignment.teamRegex
-        ? { teamRegex: teamAssignment.teamRegex }
+        ? {}
         : {}),
     },
killedBy: Sends teamRegex to backend when provided
statusReason: expected { courseId: 7, …(3) } to deeply equal { courseId: 7, …(4) }

[Killed] ObjectLiteral
main/components/TabComponent/AssignmentTabComponent.jsx:53:5
 
   const teamAssignmentMutation = useBackendMutation(
     objectToAxiosParamsTeamAssignment,
-    { onSuccess: onSuccessTeamAssignment },
+    {},
   );
 
killedBy: Calls team repository assignment successfully
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Team repository creation successfully started.",
