[Timeout] BooleanLiteral
main/components/RosterStudent/RosterStudentForm.jsx:11:20
   initialContents,
   submitAction,
   buttonLabel = "Create",
-  cancelDisabled = false,
+  cancelDisabled = true,
   courseId,
   translateSections = false,

[Timeout] StringLiteral
main/components/RosterStudent/RosterStudentForm.jsx:25:30
   } = useForm({ defaultValues: initialContents || {} });
   // Stryker restore all
 
-  const sectionValue = watch("section");
+  const sectionValue = watch("");
 
   const navigate = useNavigate();

[Killed] ConditionalExpression
main/components/RosterStudent/RosterStudentForm.jsx:81:8
         </Form.Control.Feedback>
       </Form.Group>
 
-      {!initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="email">Email</Form.Label>
-          <Form.Control
-            id="email"
-            type="text"
-            isInvalid={Boolean(errors.email)}
-            {...register("email", {
-              required: "Email is required.",
-              pattern: {
-                value: regexUtils.email,
-                message: "Please enter a valid email.",
-              },
-            })}
-          />
-          <Form.Control.Feedback type="invalid">
-            {errors.email?.message}
-          </Form.Control.Feedback>
-        </Form.Group>
-      )}
+      {false}
 
       {initialContents && (
killedBy: EnrollmentTabComponent Tests RosterStudentForm submit works and clears search filter
statusReason: Unable to find a label with the text of: Email

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] LogicalOperator
main/components/RosterStudent/RosterStudentForm.jsx:81:8
         </Form.Control.Feedback>
       </Form.Group>
 
-      {!initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="email">Email</Form.Label>
-          <Form.Control
-            id="email"
-            type="text"
-            isInvalid={Boolean(errors.email)}
-            {...register("email", {
-              required: "Email is required.",
-              pattern: {
-                value: regexUtils.email,
-                message: "Please enter a valid email.",
-              },
-            })}
-          />
-          <Form.Control.Feedback type="invalid">
-            {errors.email?.message}
-          </Form.Control.Feedback>
-        </Form.Group>
-      )}
+      {!initialContents || <Form.Group className="mb-3">
+          <Form.Label htmlFor="email">Email</Form.Label>
+          <Form.Control id="email" type="text" isInvalid={Boolean(errors.email)} {...register("email", {
+    required: "Email is required.",
+    pattern: {
+      value: regexUtils.email,
+      message: "Please enter a valid email."
+    }
+  })} />
+          <Form.Control.Feedback type="invalid">
+            {errors.email?.message}
+          </Form.Control.Feedback>
+        </Form.Group>}
 
       {initialContents && (
killedBy: EnrollmentTabComponent Tests RosterStudentForm submit works and clears search filter
statusReason: Unable to find a label with the text of: Email

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Timeout] ObjectLiteral
main/components/RosterStudent/RosterStudentForm.jsx:90:24
             isInvalid={Boolean(errors.email)}
             {...register("email", {
               required: "Email is required.",
-              pattern: {
-                value: regexUtils.email,
-                message: "Please enter a valid email.",
-              },
+              pattern: {},
             })}
           />

[Killed] StringLiteral
main/components/RosterStudent/RosterStudentForm.jsx:92:26
               required: "Email is required.",
               pattern: {
                 value: regexUtils.email,
-                message: "Please enter a valid email.",
+                message: "",
               },
             })}
killedBy: RosterStudentForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Please enter a valid email/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/RosterStudent/RosterStudentForm.jsx:119:39
       <Form.Group className="mb-3">
         <Form.Label htmlFor="section">Section</Form.Label>
         <Form.Control
-          data-testid={testIdPrefix + "-section"}
+          data-testid={testIdPrefix + ""}
           id="section"
           type="text"
killedBy: RosterStudentTable tests Edit button navigates to the edit page
statusReason: Unable to find an element by: [data-testid="RosterStudentForm-section"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] LogicalOperator
main/components/RosterStudent/RosterStudentForm.jsx:127:8
         />
       </Form.Group>
 
-      {translateSections && (
-        <SectionTranslator
-          courseId={courseId}
-          section={sectionValue}
-          onChange={(value) => setValue("section", value)}
-          testIdPrefix={testIdPrefix + "-SectionTranslator"}
-        />
-      )}
+      {translateSections || <SectionTranslator courseId={courseId} section={sectionValue} onChange={value => setValue("section", value)} testIdPrefix={testIdPrefix + "-SectionTranslator"} />}
 
       <Button type="submit" data-testid={testIdPrefix + "-submit"}>
killedBy: RosterStudentForm tests does not render SectionTranslator when translateSections is false
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <select
  class="form-select"
  data-testid="RosterStudentForm-SectionTranslator-select"
  id="RosterStudentForm-SectionTranslator-select"
>
  <option

[Killed] ConditionalExpression
main/components/RosterStudent/RosterStudentForm.jsx:127:8
         />
       </Form.Group>
 
-      {translateSections && (
-        <SectionTranslator
-          courseId={courseId}
-          section={sectionValue}
-          onChange={(value) => setValue("section", value)}
-          testIdPrefix={testIdPrefix + "-SectionTranslator"}
-        />
-      )}
+      {false}
 
       <Button type="submit" data-testid={testIdPrefix + "-submit"}>
killedBy: RosterStudentForm tests renders SectionTranslator when translateSections is true, and selecting a section updates the section field
statusReason: Unable to find an element by: [data-testid="RosterStudentForm-SectionTranslator-select"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Timeout] ArrowFunction
main/components/RosterStudent/RosterStudentForm.jsx:131:21
         <SectionTranslator
           courseId={courseId}
           section={sectionValue}
-          onChange={(value) => setValue("section", value)}
+          onChange={() => undefined}
           testIdPrefix={testIdPrefix + "-SectionTranslator"}
         />

[Killed] StringLiteral
main/components/RosterStudent/RosterStudentForm.jsx:131:41
         <SectionTranslator
           courseId={courseId}
           section={sectionValue}
-          onChange={(value) => setValue("section", value)}
+          onChange={(value) => setValue("", value)}
           testIdPrefix={testIdPrefix + "-SectionTranslator"}
         />
killedBy: RosterStudentForm tests renders SectionTranslator when translateSections is true, and selecting a section updates the section field
statusReason: expect(element).toHaveValue(0200)

Expected the element to have value:
  0200
Received:


Ignored nodes: comments, script, style

[Timeout] StringLiteral
main/components/RosterStudent/RosterStudentForm.jsx:132:40
           courseId={courseId}
           section={sectionValue}
           onChange={(value) => setValue("section", value)}
-          testIdPrefix={testIdPrefix + "-SectionTranslator"}
+          testIdPrefix={testIdPrefix + ""}
         />
       )}

[Killed] BooleanLiteral
main/components/RosterStudent/RosterStudentForm.jsx:139:8
       <Button type="submit" data-testid={testIdPrefix + "-submit"}>
         {buttonLabel}
       </Button>
-      {!cancelDisabled && (
+      {cancelDisabled && (
         <Button
           variant="Secondary"
killedBy: EnrollmentTabComponent Tests RosterStudentForm submit works and clears search filter
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="btn btn-Secondary"
  data-testid="RosterStudentForm-cancel"
  type="button"
>
  Cancel
