[Killed] ArrayDeclaration
main/components/RosterStudent/RosterStudentTable.jsx:14:27
 import { toast } from "react-toastify";
 import RosterStudentDeleteModal from "main/components/RosterStudent/RosterStudentDeleteModal";
 
-const PAGE_SIZE_OPTIONS = [10, 25, 50, 100];
+const PAGE_SIZE_OPTIONS = [];
 const DEFAULT_PAGE_SIZE = 100;
 
killedBy: RosterStudentTable tests page size selector defaults to 100 and hides pagination when not needed
statusReason: expect(element).toHaveValue(100)

Expected the element to have value:
  100
Received:
  undefined

[Killed] ObjectLiteral
main/components/RosterStudent/RosterStudentTable.jsx:39:5
     { method: "GET", url: sectionsQueryKey },
     [],
     true,
-    { enabled: translateSections },
+    {},
   );
 
killedBy: EnrollmentTabComponent Tests purge flow sends DELETE with chosen option, toasts, and refetches
statusReason: expected 4 to deeply equal 2

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] ArrowFunction
main/components/RosterStudent/RosterStudentTable.jsx:43:32
   );
 
   const sectionLabelsBySection = React.useMemo(
-    () => new Map(sections.map((s) => [s.section, s.label])),
+    () => new Map(sections.map(() => undefined)),
     [sections],
   );
killedBy: InstructorCourseShowPage tests shows the Sections tab when TRANSLATE_SECTIONS option is enabled
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-sections-table-cell-row-0-col-section"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div />

[Killed] ArrowFunction
main/components/RosterStudent/RosterStudentTable.jsx:43:5
   );
 
   const sectionLabelsBySection = React.useMemo(
-    () => new Map(sections.map((s) => [s.section, s.label])),
+    () => undefined,
     [sections],
   );
killedBy: RosterStudentTable tests shows the translated section label when translateSections is enabled
statusReason: Cannot read properties of undefined (reading 'get')

[Killed] ArrayDeclaration
main/components/RosterStudent/RosterStudentTable.jsx:44:5
 
   const sectionLabelsBySection = React.useMemo(
     () => new Map(sections.map((s) => [s.section, s.label])),
-    [sections],
+    [],
   );
 
killedBy: RosterStudentTable tests shows the translated section label when translateSections is enabled
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Tue 9:00am
Received:
  0100

Ignored nodes: comments, script, style

[Killed] StringLiteral
main/components/RosterStudent/RosterStudentTable.jsx:64:10
   );
 
   const cellToAxiosParamsEdit = (formData) => ({
-    url: `/api/rosterstudents/update`,
+    url: ``,
     method: "PUT",
     params: {
killedBy: RosterStudentTable tests Edit button navigates to the edit page
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-title h4"
>
  Edit Student
</div> instead

[Killed] StringLiteral
main/components/RosterStudent/RosterStudentTable.jsx:89:11
   };
 
   const onDeleteSuccess = () => {
-    toast("Student deleted successfully.");
+    toast("");
     hideDeleteModal();
   };
killedBy: RosterStudentTable tests Delete button calls delete callback
statusReason: expected "vi.fn()" to be called with arguments: [ 'Student deleted successfully.' ]

Received:

  1st vi.fn() call:

  [
-   "Student deleted successfully.",

[Killed] ArrayDeclaration
main/components/RosterStudent/RosterStudentTable.jsx:114:5
   const editMutation = useBackendMutation(
     cellToAxiosParamsEdit,
     { onSuccess: onEditSuccess },
-    [`/api/rosterstudents/course/${courseId}`],
+    [],
   );
 
killedBy: RosterStudentTable tests Edit button navigates to the edit page
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
main/components/RosterStudent/RosterStudentTable.jsx:153:27
     {
       header: "Section",
       accessorKey: "section",
-      cell: ({ cell }) => {
-        const section = cell.row.original.section;
-        if (!translateSections || !section) {
-          return section;
-        }
-        const label = sectionLabelsBySection.get(section);
-        return label ? label : section;
-      },
+      cell: ({ cell }) => {},
     },
     {
killedBy: RosterStudentTable tests shows the raw section value when translateSections is not enabled
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  0100
Received:


Ignored nodes: comments, script, style

[Killed] BooleanLiteral
main/components/RosterStudent/RosterStudentTable.jsx:155:13
       accessorKey: "section",
       cell: ({ cell }) => {
         const section = cell.row.original.section;
-        if (!translateSections || !section) {
+        if (translateSections || !section) {
           return section;
         }
killedBy: RosterStudentTable tests shows the translated section label when translateSections is enabled
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Tue 9:00am
Received:
  0100

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
main/components/RosterStudent/RosterStudentTable.jsx:155:13
       accessorKey: "section",
       cell: ({ cell }) => {
         const section = cell.row.original.section;
-        if (!translateSections || !section) {
+        if (true) {
           return section;
         }
killedBy: RosterStudentTable tests shows the translated section label when translateSections is enabled
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Tue 9:00am
Received:
  0100

Ignored nodes: comments, script, style

[Killed] StringLiteral
main/components/RosterStudent/RosterStudentTable.jsx:181:51
         </OverlayTrigger>
       ),
       accessorFn: (row) =>
-        Array.isArray(row.teams) ? row.teams.join(", ") : "",
+        Array.isArray(row.teams) ? row.teams.join("") : "",
     },
   ];
killedBy: RosterStudentTable tests Has the expected column headers, content and buttons for admin user
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Team A, Team B
Received:
  Team ATeam B

[Killed] StringLiteral
main/components/RosterStudent/RosterStudentTable.jsx:208:13
           break;
         case "MEMBER":
           set_message =
-            "Student is a member of the GitHub organization associated with this course.";
+            "";
           break;
         default:
killedBy: tooltips for MEMBER status
statusReason: Unable to find an element with the text: Student is a member of the GitHub organization associated with this course.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] StringLiteral
main/components/RosterStudent/RosterStudentTable.jsx:294:26
           <RosterStudentForm
             initialContents={editStudent}
             submitAction={submitEditForm}
-            buttonLabel={"Update"}
+            buttonLabel={""}
             cancelDisabled={true}
             courseId={courseId}
killedBy: RosterStudentTable tests Edit button navigates to the edit page
statusReason: Unable to find an element with the text: Update. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] ConditionalExpression
main/components/RosterStudent/RosterStudentTable.jsx:332:8
         columns={columns}
         testid={testIdPrefix}
       />
-      {totalPages > 1 && (
-        <div className="d-flex justify-content-center mb-2">
-          <OurPagination
-            currentActivePage={currentPage}
-            updateActivePage={setCurrentPage}
-            totalPages={totalPages}
-            testId={`${testIdPrefix}-pagination`}
-          />
-        </div>
-      )}
+      {true}
       <div
         style={{ display: "none" }}
killedBy: RosterStudentTable tests pagination appears and lets user navigate when there are more students than the page size
statusReason: Unable to find an element by: [data-testid="RosterStudentTable-pagination-next"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>
