[Timeout] StringLiteral
main/components/Sections/SectionTranslator.jsx:14:18
   courseId,
   section,
   onChange,
-  testIdPrefix = "SectionTranslator",
+  testIdPrefix = "",
 }) {
   const sectionsQueryKey = `/api/courses/${courseId}/sections`;

[Timeout] ArrowFunction
main/components/Sections/SectionTranslator.jsx:27:41
     { enabled: Boolean(courseId) },
   );
 
-  const matchingSection = sections.find((s) => s.section === section);
+  const matchingSection = sections.find(() => undefined);
   const translation = matchingSection ? matchingSection.label : "";
 

[Timeout] ConditionalExpression
main/components/Sections/SectionTranslator.jsx:27:48
     { enabled: Boolean(courseId) },
   );
 
-  const matchingSection = sections.find((s) => s.section === section);
+  const matchingSection = sections.find((s) => false);
   const translation = matchingSection ? matchingSection.label : "";
 

[Timeout] BlockStatement
main/components/Sections/SectionTranslator.jsx:30:41
   const matchingSection = sections.find((s) => s.section === section);
   const translation = matchingSection ? matchingSection.label : "";
 
-  const handleSelectChange = (event) => {
-    onChange(event.target.value);
-  };
+  const handleSelectChange = (event) => {};
 
   return (

[Timeout] StringLiteral
main/components/Sections/SectionTranslator.jsx:36:28
 
   return (
     <Form.Group className="mb-3">
-      <Form.Label htmlFor={`${testIdPrefix}-translation`}>
+      <Form.Label htmlFor={``}>
         Section Translation
       </Form.Label>

[Timeout] StringLiteral
main/components/Sections/SectionTranslator.jsx:47:28
         disabled
         readOnly
       />
-      <Form.Label htmlFor={`${testIdPrefix}-select`} className="mt-2">
+      <Form.Label htmlFor={``} className="mt-2">
         Select Section
       </Form.Label>

[Timeout] LogicalOperator
main/components/Sections/SectionTranslator.jsx:53:16
       <Form.Select
         data-testid={`${testIdPrefix}-select`}
         id={`${testIdPrefix}-select`}
-        value={section ?? ""}
+        value={section && ""}
         onChange={handleSelectChange}
       >

[Timeout] ArrowFunction
main/components/Sections/SectionTranslator.jsx:57:23
         onChange={handleSelectChange}
       >
         <option value="">-- Select a Section --</option>
-        {sections.map((s) => (
-          <option key={s.id} value={s.section}>
-            {s.section} - {s.label}
-          </option>
-        ))}
+        {sections.map(() => undefined)}
       </Form.Select>
     </Form.Group>
