[Killed] StringLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:111:13
 
   const objectToAxiosParamsPurge = (formData) => ({
     url: `/api/rosterstudents/purgeDropped`,
-    method: "DELETE",
+    method: "",
     params: {
       courseId: courseId,
killedBy: EnrollmentTabComponent Tests purge flow sends DELETE with chosen option, toasts, and refetches
statusReason: expected +0 to deeply equal 1

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] StringLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:122:15
     objectToAxiosParamsPurge,
     {
       onSuccess: (data) => {
-        toast(`Purged ${data.deleted} dropped student(s).`);
+        toast(``);
         if (data.orgRemovalErrors.length > 0) {
           toast.error(
killedBy: EnrollmentTabComponent Tests purge flow sends DELETE with chosen option, toasts, and refetches
statusReason: expected "vi.fn()" to be called with arguments: [ 'Purged 1 dropped student(s).' ]

Received:

  1st vi.fn() call:

  [
-   "Purged 1 dropped student(s).",

[Killed] EqualityOperator
main/components/TabComponent/EnrollmentTabComponent.jsx:123:13
     {
       onSuccess: (data) => {
         toast(`Purged ${data.deleted} dropped student(s).`);
-        if (data.orgRemovalErrors.length > 0) {
+        if (data.orgRemovalErrors.length >= 0) {
           toast.error(
             `Some students could not be removed from the GitHub organization: ${data.orgRemovalErrors.join("; ")}`,
killedBy: EnrollmentTabComponent Tests purge flow sends DELETE with chosen option, toasts, and refetches
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "Some students could not be removed from the GitHub organization: ",

[Killed] EqualityOperator
main/components/TabComponent/EnrollmentTabComponent.jsx:123:13
     {
       onSuccess: (data) => {
         toast(`Purged ${data.deleted} dropped student(s).`);
-        if (data.orgRemovalErrors.length > 0) {
+        if (data.orgRemovalErrors.length <= 0) {
           toast.error(
             `Some students could not be removed from the GitHub organization: ${data.orgRemovalErrors.join("; ")}`,
killedBy: EnrollmentTabComponent Tests purge flow sends DELETE with chosen option, toasts, and refetches
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "Some students could not be removed from the GitHub organization: ",

[Killed] EqualityOperator
main/components/TabComponent/EnrollmentTabComponent.jsx:139:18
   };
 
   const droppedStudents = rosterStudents.filter(
-    (student) => student.rosterStatus === "DROPPED",
+    (student) => student.rosterStatus !== "DROPPED",
   );
 
killedBy: EnrollmentTabComponent Tests Table Renders
statusReason: Found multiple elements with the text: Alice

Here are the matching elements:

Ignored nodes: comments, script, style
<td
  data-testid="InstructorCourseShowPage-RosterStudentTable-cell-row-0-col-firstName"
>
