[Killed] BooleanLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:55:64
   const { data: courseOptions } = useCourseOptions(courseId, {
     enabled: showSettingsTab,
   });
-  const showSectionsTab = courseOptions.TRANSLATE_SECTIONS === true;
+  const showSectionsTab = courseOptions.TRANSLATE_SECTIONS === false;
 
   // The Slack tab is only shown when the SLACK_INTEGRATION course option is
killedBy: InstructorCourseShowPage tests shows the Sections tab when TRANSLATE_SECTIONS option is enabled
statusReason: Unable to find role="tab" and name "Sections"

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:60:35
   // The Slack tab is only shown when the SLACK_INTEGRATION course option is
   // enabled and a Slack token has been saved. The query key is shared with the
   // Slack card on the Settings tab, so saving a token there shows the tab.
-  const slackIntegrationEnabled = courseOptions.SLACK_INTEGRATION === true;
+  const slackIntegrationEnabled = true;
   const { data: slackInfo } = useBackend(
     [slackInfoQueryKey(courseId)],
killedBy: InstructorCourseShowPage tests hides the Slack tab, and does not ask for Slack info, when SLACK_INTEGRATION is disabled
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  aria-controls="react-aria-_r_20_-tabpane-slack"
  aria-selected="false"
  class="nav-link"
  data-rr-ui-event-key="slack"
  id="react-aria-_r_20_-tab-slack"

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:70:5
     { enabled: slackIntegrationEnabled },
   );
   const showSlackTab =
-    slackIntegrationEnabled && Boolean(slackInfo.slackBotToken);
+    false;
 
   // Stryker disable OptionalChaining -- course?.instructorEmail is more readable than course && course.instructorEmail
killedBy: InstructorCourseShowPage tests shows the Slack tab when SLACK_INTEGRATION is enabled and a token is set; loads Slack data only when the tab is opened
statusReason: Unable to find role="tab" and name "Slack"

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] LogicalOperator
main/pages/Instructor/InstructorCourseShowPage.jsx:75:5
   // Stryker disable OptionalChaining -- course?.instructorEmail is more readable than course && course.instructorEmail
   const getCourseFailed = courseBackendFailureCount > 0;
   const canEditCourseOptions =
-    hasRole(currentUser, "ROLE_ADMIN") ||
-    currentUser?.root?.user?.email === course?.instructorEmail;
+    hasRole(currentUser, "ROLE_ADMIN") && currentUser?.root?.user?.email === course?.instructorEmail;
   // Stryker enable OptionalChaining
 
killedBy: InstructorCourseShowPage tests instructor assigned to course can edit course option toggles
statusReason: expect(element).not.toBeDisabled()

Received element is disabled:
  <input
  class="form-check-input"
  data-testid="CourseOptionsForm-toggle-ENABLE_CANVAS"
  disabled=""
  id="course-option-ENABLE_CANVAS"

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:206:10
             canManageTeams={canManageTeams}
           />
         </Tab>
-        {showSectionsTab && (
-          <Tab eventKey={"sections"} title={"Sections"} className="pt-2">
-            <SectionsTabComponent courseId={courseId} testIdPrefix={testId} />
-          </Tab>
-        )}
+        {false}
         <Tab eventKey={"default"} title={"Assignments"} className="pt-2">
           <AssignmentTabComponent
killedBy: InstructorCourseShowPage tests shows the Sections tab when TRANSLATE_SECTIONS option is enabled
statusReason: Unable to find role="tab" and name "Sections"

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:211:24
             <SectionsTabComponent courseId={courseId} testIdPrefix={testId} />
           </Tab>
         )}
-        <Tab eventKey={"default"} title={"Assignments"} className="pt-2">
+        <Tab eventKey={""} title={"Assignments"} className="pt-2">
           <AssignmentTabComponent
             courseId={courseId}
killedBy: InstructorCourseShowPage tests Tab assertions
statusReason: expect(element).toHaveAttribute("data-rr-ui-event-key", "default") // element.getAttribute("data-rr-ui-event-key") === "default"

Expected the element to have attribute:
  data-rr-ui-event-key="default"
Received:
  data-rr-ui-event-key=""

[Killed] LogicalOperator
main/pages/Instructor/InstructorCourseShowPage.jsx:224:10
         <Tab eventKey={"downloads"} title={"Downloads"} className="pt-2">
           <DownloadsTabComponent courseId={courseId} testIdPrefix={testId} />
         </Tab>
-        {showSlackTab && (
-          <Tab
-            eventKey={"slack"}
-            title={"Slack"}
-            className="pt-2"
-            mountOnEnter={true}
-          >
-            <SlackTabComponent
-              courseId={courseId}
-              testIdPrefix={testId}
-              slackTeamName={slackInfo.slackTeamName}
-              slackTeamUrl={slackInfo.slackTeamUrl}
-            />
-          </Tab>
-        )}
+        {showSlackTab || <Tab eventKey={"slack"} title={"Slack"} className="pt-2" mountOnEnter={true}>
+            <SlackTabComponent courseId={courseId} testIdPrefix={testId} slackTeamName={slackInfo.slackTeamName} slackTeamUrl={slackInfo.slackTeamUrl} />
+          </Tab>}
         {showSettingsTab && (
           <Tab eventKey={"settings"} title={"Settings"} className="pt-2">
killedBy: InstructorCourseShowPage tests shows the Slack tab when SLACK_INTEGRATION is enabled and a token is set; loads Slack data only when the tab is opened
statusReason: Cannot read properties of undefined (reading 'url')

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:224:10
         <Tab eventKey={"downloads"} title={"Downloads"} className="pt-2">
           <DownloadsTabComponent courseId={courseId} testIdPrefix={testId} />
         </Tab>
-        {showSlackTab && (
-          <Tab
-            eventKey={"slack"}
-            title={"Slack"}
-            className="pt-2"
-            mountOnEnter={true}
-          >
-            <SlackTabComponent
-              courseId={courseId}
-              testIdPrefix={testId}
-              slackTeamName={slackInfo.slackTeamName}
-              slackTeamUrl={slackInfo.slackTeamUrl}
-            />
-          </Tab>
-        )}
+        {true}
         {showSettingsTab && (
           <Tab eventKey={"settings"} title={"Settings"} className="pt-2">
killedBy: InstructorCourseShowPage tests shows the Slack tab when SLACK_INTEGRATION is enabled and a token is set; loads Slack data only when the tab is opened
statusReason: Unable to find role="tab" and name "Slack"

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:226:23
         </Tab>
         {showSlackTab && (
           <Tab
-            eventKey={"slack"}
+            eventKey={""}
             title={"Slack"}
             className="pt-2"
killedBy: InstructorCourseShowPage tests shows the Slack tab when SLACK_INTEGRATION is enabled and a token is set; loads Slack data only when the tab is opened
statusReason: expect(element).toHaveAttribute("data-rr-ui-event-key", "slack") // element.getAttribute("data-rr-ui-event-key") === "slack"

Expected the element to have attribute:
  data-rr-ui-event-key="slack"
Received:
  data-rr-ui-event-key=""
