[Killed] BooleanLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:27:23
   testIdPrefix,
   currentUser,
   canEditStudents,
-  translateSections = false,
+  translateSections = true,
   canvasEnabled = false,
 }) {
killedBy: EnrollmentTabComponent Tests purge flow sends DELETE with chosen option, toasts, and refetches
statusReason: expected 4 to deeply equal 2

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] BooleanLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:28:19
   currentUser,
   canEditStudents,
   translateSections = false,
-  canvasEnabled = false,
+  canvasEnabled = true,
 }) {
   const [postModal, setPostModal] = useState(false);
killedBy: EnrollmentTabComponent Load Students from Canvas button is not shown by default, or when Canvas is not enabled
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="w-100 btn btn-primary"
  data-testid="InstructorCourseShowPage-canvas-sync-button"
  type="button"
>
  Load Students from Canvas

[Killed] BooleanLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:34:48
   const [csvModal, setCsvModal] = useState(false);
   const [csvErrorModal, setCsvErrorModal] = useState(false);
   const [csvErrorModalData, setCsvErrorModalData] = useState(null);
-  const [purgeModal, setPurgeModal] = useState(false);
+  const [purgeModal, setPurgeModal] = useState(true);
 
   const { data: rosterStudents } = useBackend(
killedBy: InstructorCourseShowPage tests does not show error modal on initial render
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  aria-modal="true"
  class="fade modal show"
  role="dialog"
  style="display: block; padding-right: 0px;"
  tabindex="-1"

[Killed] ObjectLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:48:12
   const objectToAxiosParamsCSV = (formData) => {
     const file = new FormData();
     file.append("file", formData.upload[0]);
-    return {
-      url: `/api/rosterstudents/upload/csv`,
-      data: file,
-      params: {
-        courseId: courseId,
-      },
-      method: "POST",
-    };
+    return {};
   };
 
killedBy: EnrollmentTabComponent Tests Successfully makes a call to the backend on submit and clears search filter
statusReason: Cannot read properties of undefined (reading 'params')

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] StringLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:54:15
       params: {
         courseId: courseId,
       },
-      method: "POST",
+      method: "",
     };
   };
killedBy: EnrollmentTabComponent Tests Successfully makes a call to the backend on submit and clears search filter
statusReason: Cannot read properties of undefined (reading 'params')

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ArrowFunction
main/components/TabComponent/EnrollmentTabComponent.jsx:58:35
     };
   };
 
-  const objectToAxiosParamsPost = (student) => ({
-    url: `/api/rosterstudents/post`,
-    method: "POST",
-    params: {
-      courseId: courseId,
-      firstName: student.firstName,
-      lastName: student.lastName,
-      studentId: student.studentId,
-      email: student.email,
-      section: student.section,
-    },
-  });
+  const objectToAxiosParamsPost = () => undefined;
 
   const onSuccessRoster = (modalFn) => {
killedBy: EnrollmentTabComponent Tests RosterStudentForm submit works and clears search filter
statusReason: expected +0 to deeply equal 1

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] StringLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:72:11
   });
 
   const onSuccessRoster = (modalFn) => {
-    toast("Roster successfully updated.");
+    toast("");
     // Clear the search filter to show the updated roster
     setSearchTerm("");
killedBy: EnrollmentTabComponent Tests Successfully makes a call to the backend on submit and clears search filter
statusReason: expected "vi.fn()" to be called with arguments: [ 'Roster successfully updated.' ]

Received:

  1st vi.fn() call:

  [
-   "Roster successfully updated.",

[Killed] ArrowFunction
main/components/TabComponent/EnrollmentTabComponent.jsx:91:41
     [`/api/rosterstudents/course/${courseId}`],
   );
 
-  const objectToAxiosParamsCanvasSync = () => ({
-    url: `/api/courses/canvas/sync/students`,
-    method: "POST",
-    params: {
-      courseId: courseId,
-    },
-  });
+  const objectToAxiosParamsCanvasSync = () => undefined;
 
   const canvasSyncMutation = useBackendMutation(
killedBy: InstructorCourseShowPage tests Load Students from Canvas button on the Students tab is shown when the ENABLE_CANVAS course option is enabled, and loads students for this course
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] StringLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:92:10
   );
 
   const objectToAxiosParamsCanvasSync = () => ({
-    url: `/api/courses/canvas/sync/students`,
+    url: ``,
     method: "POST",
     params: {
killedBy: InstructorCourseShowPage tests Load Students from Canvas button on the Students tab is shown when the ENABLE_CANVAS course option is enabled, and loads students for this course
statusReason: expected '' to be '/api/courses/canvas/sync/students' // Object.is equality

[Killed] BlockStatement
main/components/TabComponent/EnrollmentTabComponent.jsx:102:24
   const canvasSyncMutation = useBackendMutation(
     objectToAxiosParamsCanvasSync,
     {
-      onSuccess: () => {
-        toast("Roster successfully updated.");
-        setSearchTerm("");
-      },
+      onSuccess: () => {},
       onError: (error) => {
         toast.error(
killedBy: EnrollmentTabComponent Load Students from Canvas button POSTs to the Canvas sync endpoint for the current course, then refreshes the roster and clears the search
statusReason: expected "vi.fn()" to be called with arguments: [ 'Roster successfully updated.' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/components/TabComponent/EnrollmentTabComponent.jsx:106:27
         toast("Roster successfully updated.");
         setSearchTerm("");
       },
-      onError: (error) => {
-        toast.error(
-          `Error loading students from Canvas: ${JSON.stringify(error.response.data, null, 2)}`,
-        );
-      },
+      onError: (error) => {},
     },
     [`/api/rosterstudents/course/${courseId}`],
killedBy: EnrollmentTabComponent Load Students from Canvas button shows the error from the backend if loading from Canvas fails
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] BlockStatement
main/components/TabComponent/EnrollmentTabComponent.jsx:115:34
     [`/api/rosterstudents/course/${courseId}`],
   );
 
-  const handleCanvasSync = () => {
-    canvasSyncMutation.mutate();
-  };
+  const handleCanvasSync = () => {};
 
   const rosterCsvMutation = useBackendMutation(
killedBy: InstructorCourseShowPage tests Load Students from Canvas button on the Students tab is shown when the ENABLE_CANVAS course option is enabled, and loads students for this course
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] ConditionalExpression
main/components/TabComponent/EnrollmentTabComponent.jsx:124:13
     {
       onSuccess: () => onSuccessRoster(setCsvModal),
       onError: (error) => {
-        if (error.response.status !== 409) {
+        if (true) {
           toast.error(
             `Error uploading CSV: ${JSON.stringify(error.response.data, null, 2)}`,
killedBy: EnrollmentTabComponent Tests CsvForm rejected shows modal
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-csv-error-modal"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Timeout] ArrowFunction
main/components/TabComponent/EnrollmentTabComponent.jsx:138:36
     [`/api/rosterstudents/course/${courseId}`],
   );
 
-  const objectToAxiosParamsPurge = (formData) => ({
-    url: `/api/rosterstudents/purgeDropped`,
-    method: "DELETE",
-    params: {
-      courseId: courseId,
-      removeFromOrg: formData.removeFromOrg,
-    },
-  });
+  const objectToAxiosParamsPurge = () => undefined;
 
   const purgeMutation = useBackendMutation(

[Killed] ObjectLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:138:51
     [`/api/rosterstudents/course/${courseId}`],
   );
 
-  const objectToAxiosParamsPurge = (formData) => ({
-    url: `/api/rosterstudents/purgeDropped`,
-    method: "DELETE",
-    params: {
-      courseId: courseId,
-      removeFromOrg: formData.removeFromOrg,
-    },
-  });
+  const objectToAxiosParamsPurge = (formData) => ({});
 
   const purgeMutation = useBackendMutation(
killedBy: EnrollmentTabComponent Tests purge flow sends DELETE with chosen option, toasts, and refetches
statusReason: expected +0 to deeply equal 1

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] StringLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:139:10
   );
 
   const objectToAxiosParamsPurge = (formData) => ({
-    url: `/api/rosterstudents/purgeDropped`,
+    url: ``,
     method: "DELETE",
     params: {
killedBy: EnrollmentTabComponent Tests purge flow sends DELETE with chosen option, toasts, and refetches
statusReason: expected '' to be '/api/rosterstudents/purgeDropped' // Object.is equality

[Killed] BlockStatement
main/components/TabComponent/EnrollmentTabComponent.jsx:150:28
   const purgeMutation = useBackendMutation(
     objectToAxiosParamsPurge,
     {
-      onSuccess: (data) => {
-        toast(`Purged ${data.deleted} dropped student(s).`);
-        if (data.orgRemovalErrors.length > 0) {
-          toast.error(
-            `Some students could not be removed from the GitHub organization: ${data.orgRemovalErrors.join("; ")}`,
-          );
-        }
-        setPurgeModal(false);
-      },
+      onSuccess: (data) => {},
     },
     [`/api/rosterstudents/course/${courseId}`],
killedBy: EnrollmentTabComponent Tests purge flow sends DELETE with chosen option, toasts, and refetches
statusReason: expected "vi.fn()" to be called with arguments: [ 'Purged 1 dropped student(s).' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
main/components/TabComponent/EnrollmentTabComponent.jsx:152:13
     {
       onSuccess: (data) => {
         toast(`Purged ${data.deleted} dropped student(s).`);
-        if (data.orgRemovalErrors.length > 0) {
+        if (false) {
           toast.error(
             `Some students could not be removed from the GitHub organization: ${data.orgRemovalErrors.join("; ")}`,
killedBy: EnrollmentTabComponent Tests purge reports GitHub org removal errors
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BlockStatement
main/components/TabComponent/EnrollmentTabComponent.jsx:152:47
     {
       onSuccess: (data) => {
         toast(`Purged ${data.deleted} dropped student(s).`);
-        if (data.orgRemovalErrors.length > 0) {
-          toast.error(
-            `Some students could not be removed from the GitHub organization: ${data.orgRemovalErrors.join("; ")}`,
-          );
-        }
+        if (data.orgRemovalErrors.length > 0) {}
         setPurgeModal(false);
       },
killedBy: EnrollmentTabComponent Tests purge reports GitHub org removal errors
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] StringLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:154:13
         toast(`Purged ${data.deleted} dropped student(s).`);
         if (data.orgRemovalErrors.length > 0) {
           toast.error(
-            `Some students could not be removed from the GitHub organization: ${data.orgRemovalErrors.join("; ")}`,
+            ``,
           );
         }
killedBy: EnrollmentTabComponent Tests purge reports GitHub org removal errors
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Some students could not be removed from the GitHub organization: a@ucsb.edu: boom; b@ucsb.edu: bang",

[Killed] BooleanLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:157:23
             `Some students could not be removed from the GitHub organization: ${data.orgRemovalErrors.join("; ")}`,
           );
         }
-        setPurgeModal(false);
+        setPurgeModal(true);
       },
     },
killedBy: EnrollmentTabComponent Tests purge flow sends DELETE with chosen option, toasts, and refetches
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="PurgeDroppedStudentsModal"
>
  <div
    class="modal-content"

[Killed] BlockStatement
main/components/TabComponent/EnrollmentTabComponent.jsx:163:43
     [`/api/rosterstudents/course/${courseId}`],
   );
 
-  const handlePurgeSubmit = (formData) => {
-    purgeMutation.mutate(formData);
-  };
+  const handlePurgeSubmit = (formData) => {};
 
   const droppedStudents = rosterStudents.filter(
killedBy: EnrollmentTabComponent Tests purge flow sends DELETE with chosen option, toasts, and refetches
statusReason: expected +0 to deeply equal 1

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] MethodExpression
main/components/TabComponent/EnrollmentTabComponent.jsx:167:27
     purgeMutation.mutate(formData);
   };
 
-  const droppedStudents = rosterStudents.filter(
-    (student) => student.rosterStatus === "DROPPED",
-  );
+  const droppedStudents = rosterStudents;
 
   const handleCsvSubmit = (formData) => {
killedBy: EnrollmentTabComponent Tests Table Renders
statusReason: Found multiple elements with the text: Alice

Here are the matching elements:

Ignored nodes: comments, script, style
<td
  data-testid="InstructorCourseShowPage-RosterStudentTable-cell-row-0-col-firstName"
>

[Killed] ConditionalExpression
main/components/TabComponent/EnrollmentTabComponent.jsx:168:18
   };
 
   const droppedStudents = rosterStudents.filter(
-    (student) => student.rosterStatus === "DROPPED",
+    (student) => true,
   );
 
killedBy: EnrollmentTabComponent Tests Table Renders
statusReason: Found multiple elements with the text: Alice

Here are the matching elements:

Ignored nodes: comments, script, style
<td
  data-testid="InstructorCourseShowPage-RosterStudentTable-cell-row-0-col-firstName"
>

[Killed] ArrowFunction
main/components/TabComponent/EnrollmentTabComponent.jsx:168:5
   };
 
   const droppedStudents = rosterStudents.filter(
-    (student) => student.rosterStatus === "DROPPED",
+    () => undefined,
   );
 
killedBy: EnrollmentTabComponent Tests Dropped Students appear correctly
statusReason: Unable to find an element by: [data-testid="DroppedStudentsTable-cell-row-0-col-studentId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-EnrollmentTabComponent"
    >

[Killed] StringLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:223:22
         show={postModal}
         onHide={() => setPostModal(false)}
         centered={true}
-        data-testid={`${testIdPrefix}-post-modal`}
+        data-testid={``}
       >
         <ModalHeader closeButton>Add Individual Student</ModalHeader>
killedBy: EnrollmentTabComponent Tests RosterStudentForm submit works and clears search filter
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-post-modal"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] StringLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:255:24
                 onClick={openCsvHelp}
                 style={{
                   position: "absolute",
-                  top: "50%",
+                  top: "",
                   right: "0.75rem",
                   transform: "translateY(-50%)",
killedBy: EnrollmentTabComponent Tests Info icon displays tooltip and opens help page on click
statusReason: expect(element).toHaveStyle()

- Expected

- top: 50%;

[Killed] StringLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:257:30
                   position: "absolute",
                   top: "50%",
                   right: "0.75rem",
-                  transform: "translateY(-50%)",
+                  transform: "",
                   color: "#fff",
                   cursor: "pointer",
killedBy: EnrollmentTabComponent Tests Info icon displays tooltip and opens help page on click
statusReason: expect(element).toHaveStyle()

- Expected

- transform: translateY(-50%);

[Killed] ConditionalExpression
main/components/TabComponent/EnrollmentTabComponent.jsx:268:10
             </OverlayTrigger>
           </div>
         </Col>
-        {canvasEnabled && (
-          <Col>
-            <Button
-              onClick={handleCanvasSync}
-              data-testid={`${testIdPrefix}-canvas-sync-button`}
-              className="w-100"
-            >
-              Load Students from Canvas
-            </Button>
-          </Col>
-        )}
+        {false}
         <Col>
           <Button
killedBy: InstructorCourseShowPage tests Load Students from Canvas button on the Students tab is shown when the ENABLE_CANVAS course option is enabled, and loads students for this course
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-canvas-sync-button"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ConditionalExpression
main/components/TabComponent/EnrollmentTabComponent.jsx:268:10
             </OverlayTrigger>
           </div>
         </Col>
-        {canvasEnabled && (
-          <Col>
-            <Button
-              onClick={handleCanvasSync}
-              data-testid={`${testIdPrefix}-canvas-sync-button`}
-              className="w-100"
-            >
-              Load Students from Canvas
-            </Button>
-          </Col>
-        )}
+        {true}
         <Col>
           <Button
killedBy: InstructorCourseShowPage tests Load Students from Canvas button on the Students tab is shown when the ENABLE_CANVAS course option is enabled, and loads students for this course
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-canvas-sync-button"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ConditionalExpression
main/components/TabComponent/EnrollmentTabComponent.jsx:333:34
               }
               return false;
             })
-            .filter((student) => student.rosterStatus !== "DROPPED")}
+            .filter((student) => true)}
           currentUser={currentUser}
           courseId={courseId}
killedBy: EnrollmentTabComponent Tests Dropped Students appear correctly
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td
  data-testid="InstructorCourseShowPage-RosterStudentTable-cell-row-3-col-email"
>
  aryasue@ucsb.edu
</td> instead

[Killed] ArrowFunction
main/components/TabComponent/EnrollmentTabComponent.jsx:359:22
         <Col>
           <Button
             variant="danger"
-            onClick={() => setPurgeModal(true)}
+            onClick={() => undefined}
             disabled={droppedStudents.length === 0}
             data-testid={`${testIdPrefix}-purge-dropped-button`}
killedBy: EnrollmentTabComponent Tests purge flow sends DELETE with chosen option, toasts, and refetches
statusReason: Unable to find an element by: [data-testid="PurgeDroppedStudentsModal"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] BooleanLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:359:42
         <Col>
           <Button
             variant="danger"
-            onClick={() => setPurgeModal(true)}
+            onClick={() => setPurgeModal(false)}
             disabled={droppedStudents.length === 0}
             data-testid={`${testIdPrefix}-purge-dropped-button`}
killedBy: EnrollmentTabComponent Tests purge flow sends DELETE with chosen option, toasts, and refetches
statusReason: Unable to find an element by: [data-testid="PurgeDroppedStudentsModal"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ConditionalExpression
main/components/TabComponent/EnrollmentTabComponent.jsx:360:23
           <Button
             variant="danger"
             onClick={() => setPurgeModal(true)}
-            disabled={droppedStudents.length === 0}
+            disabled={true}
             data-testid={`${testIdPrefix}-purge-dropped-button`}
           >
killedBy: EnrollmentTabComponent Tests purge flow sends DELETE with chosen option, toasts, and refetches
statusReason: expect(element).not.toBeDisabled()

Received element is disabled:
  <button
  class="btn btn-danger"
  data-testid="InstructorCourseShowPage-purge-dropped-button"
  disabled=""
  type="button"

[Killed] ConditionalExpression
main/components/TabComponent/EnrollmentTabComponent.jsx:360:23
           <Button
             variant="danger"
             onClick={() => setPurgeModal(true)}
-            disabled={droppedStudents.length === 0}
+            disabled={false}
             data-testid={`${testIdPrefix}-purge-dropped-button`}
           >
killedBy: EnrollmentTabComponent Tests purge button is disabled when there are no dropped students
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <button
  class="btn btn-danger"
  data-testid="InstructorCourseShowPage-purge-dropped-button"
  type="button"
/>
