[Killed] BlockStatement
src/main/utils/sectionsUtils.js:9:47
  * Shared onError handler for section create/update mutations. A 409 from the
  * backend means the (course, section) pair already exists.
  */
-export function onSectionMutationError(error) {
-  if (error.response.status === 409) {
-    toast("A section with that section value already exists for this course.");
-  } else {
-    toast(`${error}`);
-  }
-}
+export function onSectionMutationError(error) {}
 
 /**
killedBy: SectionsTabComponent tests create shows duplicate message on 409 and keeps modal open
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
src/main/utils/sectionsUtils.js:10:38
  * backend means the (course, section) pair already exists.
  */
 export function onSectionMutationError(error) {
-  if (error.response.status === 409) {
-    toast("A section with that section value already exists for this course.");
-  } else {
+  if (error.response.status === 409) {} else {
     toast(`${error}`);
   }
killedBy: SectionsTabComponent tests create shows duplicate message on 409 and keeps modal open
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Timeout] EqualityOperator
src/main/utils/sectionsUtils.js:10:7
  * backend means the (course, section) pair already exists.
  */
 export function onSectionMutationError(error) {
-  if (error.response.status === 409) {
+  if (error.response.status !== 409) {
     toast("A section with that section value already exists for this course.");
   } else {

[Timeout] StringLiteral
src/main/utils/sectionsUtils.js:11:11
  */
 export function onSectionMutationError(error) {
   if (error.response.status === 409) {
-    toast("A section with that section value already exists for this course.");
+    toast("");
   } else {
     toast(`${error}`);

[Timeout] BlockStatement
src/main/utils/sectionsUtils.js:12:10
 export function onSectionMutationError(error) {
   if (error.response.status === 409) {
     toast("A section with that section value already exists for this course.");
-  } else {
-    toast(`${error}`);
-  }
+  } else {}
 }
 

[Timeout] StringLiteral
src/main/utils/sectionsUtils.js:13:11
   if (error.response.status === 409) {
     toast("A section with that section value already exists for this course.");
   } else {
-    toast(`${error}`);
+    toast(``);
   }
 }

[Killed] BlockStatement
src/main/utils/sectionsUtils.js:32:53
  * @param {boolean} enabled whether the TRANSLATE_SECTIONS course option is enabled
  * @returns {(section: string) => string} function that translates a raw section value
  */
-export function useSectionLabels(courseId, enabled) {
-  const sectionsQueryKey = `/api/courses/${courseId}/sections`;
-  const { data: sections = [] } = useBackend(
-    [sectionsQueryKey],
-    // Stryker disable next-line StringLiteral : GET and empty string are equivalent
-    { method: "GET", url: sectionsQueryKey },
-    [],
-    true,
-    { enabled },
-  );
-
-  const sectionLabelsBySection = useMemo(
-    () => new Map(sections.map((s) => [s.section, s.label])),
-    [sections],
-  );
-
-  return function translateSection(section) {
-    if (!enabled || !section) {
-      return section;
-    }
-    const label = sectionLabelsBySection.get(section);
-    return label ? label : section;
-  };
-}
+export function useSectionLabels(courseId, enabled) {}
 
killedBy: InstructorCourseShowPage tests Load Students from Canvas button on the Students tab is shown when the ENABLE_CANVAS course option is enabled, and loads students for this course
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-canvas-sync-button"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div />

[Killed] StringLiteral
src/main/utils/sectionsUtils.js:33:28
  * @returns {(section: string) => string} function that translates a raw section value
  */
 export function useSectionLabels(courseId, enabled) {
-  const sectionsQueryKey = `/api/courses/${courseId}/sections`;
+  const sectionsQueryKey = ``;
   const { data: sections = [] } = useBackend(
     [sectionsQueryKey],
killedBy: RosterStudentTable tests shows the translated section label when translateSections is enabled
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Tue 9:00am
Received:
  0100

Ignored nodes: comments, script, style

[Timeout] ArrayDeclaration
src/main/utils/sectionsUtils.js:34:28
  */
 export function useSectionLabels(courseId, enabled) {
   const sectionsQueryKey = `/api/courses/${courseId}/sections`;
-  const { data: sections = [] } = useBackend(
+  const { data: sections = ["Stryker was here"] } = useBackend(
     [sectionsQueryKey],
     // Stryker disable next-line StringLiteral : GET and empty string are equivalent

[Killed] ObjectLiteral
src/main/utils/sectionsUtils.js:40:5
     { method: "GET", url: sectionsQueryKey },
     [],
     true,
-    { enabled },
+    {},
   );
 
killedBy: EnrollmentTabComponent Tests purge flow sends DELETE with chosen option, toasts, and refetches
statusReason: expected 4 to deeply equal 2

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] ArrowFunction
src/main/utils/sectionsUtils.js:44:32
   );
 
   const sectionLabelsBySection = useMemo(
-    () => new Map(sections.map((s) => [s.section, s.label])),
+    () => new Map(sections.map(() => undefined)),
     [sections],
   );
killedBy: InstructorCourseShowPage tests shows the Sections tab when TRANSLATE_SECTIONS option is enabled
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-sections-table-cell-row-0-col-section"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div />

[Killed] ArrowFunction
src/main/utils/sectionsUtils.js:44:5
   );
 
   const sectionLabelsBySection = useMemo(
-    () => new Map(sections.map((s) => [s.section, s.label])),
+    () => undefined,
     [sections],
   );
killedBy: RosterStudentTable tests shows the translated section label when translateSections is enabled
statusReason: Cannot read properties of undefined (reading 'get')

[Killed] BlockStatement
src/main/utils/sectionsUtils.js:48:45
     [sections],
   );
 
-  return function translateSection(section) {
-    if (!enabled || !section) {
-      return section;
-    }
-    const label = sectionLabelsBySection.get(section);
-    return label ? label : section;
-  };
+  return function translateSection(section) {};
 }
 
killedBy: RosterStudentTable tests shows the raw section value when translateSections is not enabled
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  0100
Received:


Ignored nodes: comments, script, style

[Killed] ConditionalExpression
src/main/utils/sectionsUtils.js:49:9
   );
 
   return function translateSection(section) {
-    if (!enabled || !section) {
+    if (true) {
       return section;
     }
killedBy: RosterStudentTable tests shows the translated section label when translateSections is enabled
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Tue 9:00am
Received:
  0100

Ignored nodes: comments, script, style

[Killed] BooleanLiteral
src/main/utils/sectionsUtils.js:49:21
   );
 
   return function translateSection(section) {
-    if (!enabled || !section) {
+    if (!enabled || section) {
       return section;
     }
killedBy: RosterStudentTable tests shows the translated section label when translateSections is enabled
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Tue 9:00am
Received:
  0100

Ignored nodes: comments, script, style
