[Timeout] BooleanLiteral
main/components/RosterStudent/DroppedStudentsTable.jsx:12:23
 export default function DroppedStudentsTable({
   students,
   courseId,
-  translateSections = false,
+  translateSections = true,
 }) {
   const [showDeleteModal, setShowDeleteModal] = useState(false);

[Killed] BooleanLiteral
main/components/RosterStudent/DroppedStudentsTable.jsx:14:58
   courseId,
   translateSections = false,
 }) {
-  const [showDeleteModal, setShowDeleteModal] = useState(false);
+  const [showDeleteModal, setShowDeleteModal] = useState(true);
   const [deleteStudent, setDeleteStudent] = useState(null);
 
killedBy: InstructorCourseShowPage tests does not show error modal on initial render
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  aria-modal="true"
  class="fade modal show"
  role="dialog"
  style="display: block; padding-right: 0px;"
  tabindex="-1"

[Killed] ObjectLiteral
main/components/RosterStudent/DroppedStudentsTable.jsx:26:5
       id: "id",
     },
 
-    {
-      header: "Student Id",
-      accessorKey: "studentId",
-    },
+    {},
 
     {
killedBy: EnrollmentTabComponent Tests Table Renders
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/RosterStudent/DroppedStudentsTable.jsx:27:15
     },
 
     {
-      header: "Student Id",
+      header: "",
       accessorKey: "studentId",
     },
killedBy: DroppedStudentsTable tests renders correctly
statusReason: Unable to find an element with the text: Student Id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="DroppedStudentsTable"

[Killed] StringLiteral
main/components/RosterStudent/DroppedStudentsTable.jsx:36:15
       accessorKey: "firstName",
     },
     {
-      header: "Last Name",
+      header: "",
       accessorKey: "lastName",
     },
killedBy: DroppedStudentsTable tests renders correctly
statusReason: Unable to find an element with the text: Last Name. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="DroppedStudentsTable"

[Killed] StringLiteral
main/components/RosterStudent/DroppedStudentsTable.jsx:37:20
     },
     {
       header: "Last Name",
-      accessorKey: "lastName",
+      accessorKey: "",
     },
     {
killedBy: DroppedStudentsTable tests renders correctly
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/RosterStudent/DroppedStudentsTable.jsx:44:15
       accessorKey: "email",
     },
     {
-      header: "Section",
+      header: "",
       accessorKey: "section",
       cell: ({ cell }) => translateSection(cell.row.original.section),
killedBy: DroppedStudentsTable tests renders correctly
statusReason: Unable to find an element with the text: Section. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="DroppedStudentsTable"

[Killed] ArrowFunction
main/components/RosterStudent/DroppedStudentsTable.jsx:46:13
     {
       header: "Section",
       accessorKey: "section",
-      cell: ({ cell }) => translateSection(cell.row.original.section),
+      cell: () => undefined,
     },
   ];
killedBy: DroppedStudentsTable tests shows the raw section value when translateSections is not enabled
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  0100
Received:


Ignored nodes: comments, script, style

[Killed] ArrowFunction
main/components/RosterStudent/DroppedStudentsTable.jsx:50:36
     },
   ];
 
-  const cellToAxiosParamsRestore = (cell) => ({
-    url: `/api/rosterstudents/restore`,
-    method: "PUT",
-    params: {
-      id: cell.row.original.id,
-    },
-  });
+  const cellToAxiosParamsRestore = () => undefined;
 
   const restoreSuccess = () => {
killedBy: DroppedStudentsTable tests restore works correctly
statusReason: expected +0 to deeply equal 1

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] StringLiteral
main/components/RosterStudent/DroppedStudentsTable.jsx:52:13
 
   const cellToAxiosParamsRestore = (cell) => ({
     url: `/api/rosterstudents/restore`,
-    method: "PUT",
+    method: "",
     params: {
       id: cell.row.original.id,
killedBy: DroppedStudentsTable tests restore works correctly
statusReason: expected +0 to deeply equal 1

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] BlockStatement
main/components/RosterStudent/DroppedStudentsTable.jsx:58:32
     },
   });
 
-  const restoreSuccess = () => {
-    toast("Student successfully restored to course.");
-  };
+  const restoreSuccess = () => {};
 
   const restoreMutation = useBackendMutation(
killedBy: DroppedStudentsTable tests restore works correctly
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] StringLiteral
main/components/RosterStudent/DroppedStudentsTable.jsx:59:11
   });
 
   const restoreSuccess = () => {
-    toast("Student successfully restored to course.");
+    toast("");
   };
 
killedBy: DroppedStudentsTable tests restore works correctly
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Student successfully restored to course.",

[Killed] BlockStatement
main/components/RosterStudent/DroppedStudentsTable.jsx:70:37
     [`/api/rosterstudents/course/${courseId}`],
   );
 
-  const restoreCallback = (cell) => {
-    restoreMutation.mutate(cell);
-  };
+  const restoreCallback = (cell) => {};
 
   const hideDeleteModal = () => {
killedBy: DroppedStudentsTable tests restore works correctly
statusReason: expected +0 to deeply equal 1

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] BlockStatement
main/components/RosterStudent/DroppedStudentsTable.jsx:78:33
     setShowDeleteModal(false);
   };
 
-  const onDeleteSuccess = () => {
-    toast("Student deleted successfully.");
-    hideDeleteModal();
-  };
+  const onDeleteSuccess = () => {};
 
   const deleteMutation = useBackendMutation(
killedBy: DroppedStudentsTable tests delete opens confirmation modal and sends DELETE with chosen org option
statusReason: expected "vi.fn()" to be called with arguments: [ 'Student deleted successfully.' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/components/RosterStudent/DroppedStudentsTable.jsx:89:36
     [`/api/rosterstudents/course/${courseId}`],
   );
 
-  const deleteCallback = (cell) => {
-    setDeleteStudent(cell.row.original.id);
-    setShowDeleteModal(true);
-  };
+  const deleteCallback = (cell) => {};
 
   const submitDeleteForm = (data) => {
killedBy: DroppedStudentsTable tests delete opens confirmation modal and sends DELETE with chosen org option
statusReason: Unable to find an element by: [data-testid="RosterStudentDeleteModal"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="DroppedStudentsTable"

[Killed] BooleanLiteral
main/components/RosterStudent/DroppedStudentsTable.jsx:91:24
 
   const deleteCallback = (cell) => {
     setDeleteStudent(cell.row.original.id);
-    setShowDeleteModal(true);
+    setShowDeleteModal(false);
   };
 
killedBy: DroppedStudentsTable tests delete opens confirmation modal and sends DELETE with chosen org option
statusReason: Unable to find an element by: [data-testid="RosterStudentDeleteModal"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="DroppedStudentsTable"

[Killed] BlockStatement
main/components/RosterStudent/DroppedStudentsTable.jsx:94:38
     setShowDeleteModal(true);
   };
 
-  const submitDeleteForm = (data) => {
-    deleteMutation.mutate({
-      id: deleteStudent,
-      ...data,
-    });
-  };
+  const submitDeleteForm = (data) => {};
 
   columns.push(
killedBy: DroppedStudentsTable tests delete opens confirmation modal and sends DELETE with chosen org option
statusReason: expected +0 to deeply equal 1

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ObjectLiteral
main/components/RosterStudent/DroppedStudentsTable.jsx:95:27
   };
 
   const submitDeleteForm = (data) => {
-    deleteMutation.mutate({
-      id: deleteStudent,
-      ...data,
-    });
+    deleteMutation.mutate({});
   };
 
killedBy: DroppedStudentsTable tests delete opens confirmation modal and sends DELETE with chosen org option
statusReason: expected { id: undefined, …(1) } to deeply equal { id: 4, removeFromOrg: 'true' }

[Killed] StringLiteral
main/components/RosterStudent/DroppedStudentsTable.jsx:102:18
   };
 
   columns.push(
-    ButtonColumn("Restore", "primary", restoreCallback, "RestoreButton"),
+    ButtonColumn("", "primary", restoreCallback, "RestoreButton"),
   );
   columns.push(
killedBy: InstructorCourseShowPage tests renders correctly for instructor user
statusReason: Columns require an id when using a non-string header
