[Killed] BooleanLiteral
main/components/RosterStudent/RosterStudentTable.jsx:28:64
 }) {
   const [showEditModal, setShowEditModal] = React.useState(false);
   const [editStudent, setEditStudent] = React.useState(null);
-  const [showDeleteModal, setShowDeleteModal] = React.useState(false);
+  const [showDeleteModal, setShowDeleteModal] = React.useState(true);
   const [deleteStudent, setDeleteStudent] = React.useState(null);
   const [pageSize, setPageSize] = React.useState(DEFAULT_PAGE_SIZE);
killedBy: InstructorCourseShowPage tests does not show error modal on initial render
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  aria-modal="true"
  class="fade modal show"
  role="dialog"
  style="display: block; padding-right: 0px;"
  tabindex="-1"

[Killed] ArithmeticOperator
main/components/RosterStudent/RosterStudentTable.jsx:35:44
 
   const translateSection = useSectionLabels(courseId, translateSections);
 
-  const totalPages = Math.max(1, Math.ceil(students.length / pageSize));
+  const totalPages = Math.max(1, Math.ceil(students.length * pageSize));
 
   React.useEffect(() => {
killedBy: RosterStudentTable tests page size selector defaults to 100 and hides pagination when not needed
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a
  class="page-link"
  data-testid="RosterStudentTable-pagination-prev"
  href="#"
  role="button"
  tabindex="0"

[Killed] MethodExpression
main/components/RosterStudent/RosterStudentTable.jsx:35:22
 
   const translateSection = useSectionLabels(courseId, translateSections);
 
-  const totalPages = Math.max(1, Math.ceil(students.length / pageSize));
+  const totalPages = Math.min(1, Math.ceil(students.length / pageSize));
 
   React.useEffect(() => {
killedBy: StaffCourseShowPage tests staff users can still manage students and teams
statusReason: Unable to find an element by: [data-testid="StaffCourseShowPage-RosterStudentTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] BlockStatement
main/components/RosterStudent/RosterStudentTable.jsx:37:25
 
   const totalPages = Math.max(1, Math.ceil(students.length / pageSize));
 
-  React.useEffect(() => {
-    setCurrentPage((prevPage) => Math.min(prevPage, totalPages));
-  }, [totalPages]);
+  React.useEffect(() => {}, [totalPages]);
 
   const handlePageSizeChange = (event) => {
killedBy: RosterStudentTable tests resets to the last valid page if the student list shrinks below the current page
statusReason: Unable to find an element by: [data-testid="RosterStudentTable-cell-row-0-col-studentId"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] MethodExpression
main/components/RosterStudent/RosterStudentTable.jsx:38:34
   const totalPages = Math.max(1, Math.ceil(students.length / pageSize));
 
   React.useEffect(() => {
-    setCurrentPage((prevPage) => Math.min(prevPage, totalPages));
+    setCurrentPage((prevPage) => Math.max(prevPage, totalPages));
   }, [totalPages]);
 
killedBy: RosterStudentTable tests pagination appears and lets user navigate when there are more students than the page size
statusReason: Unable to find an element by: [data-testid="RosterStudentTable-cell-row-9-col-studentId"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ArrowFunction
main/components/RosterStudent/RosterStudentTable.jsx:38:20
   const totalPages = Math.max(1, Math.ceil(students.length / pageSize));
 
   React.useEffect(() => {
-    setCurrentPage((prevPage) => Math.min(prevPage, totalPages));
+    setCurrentPage(() => undefined);
   }, [totalPages]);
 
killedBy: EnrollmentTabComponent Tests Table Renders
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-RosterStudentTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-EnrollmentTabComponent"
    >

[Killed] BlockStatement
main/components/RosterStudent/RosterStudentTable.jsx:41:43
     setCurrentPage((prevPage) => Math.min(prevPage, totalPages));
   }, [totalPages]);
 
-  const handlePageSizeChange = (event) => {
-    setPageSize(Number(event.target.value));
-    setCurrentPage(1);
-  };
+  const handlePageSizeChange = (event) => {};
 
   const paginatedStudents = students.slice(
killedBy: RosterStudentTable tests pagination appears and lets user navigate when there are more students than the page size
statusReason: expect(element).toHaveValue(10)

Expected the element to have value:
  10
Received:
  100

[Killed] MethodExpression
main/components/RosterStudent/RosterStudentTable.jsx:46:29
     setCurrentPage(1);
   };
 
-  const paginatedStudents = students.slice(
-    (currentPage - 1) * pageSize,
-    currentPage * pageSize,
-  );
+  const paginatedStudents = students;
 
   const cellToAxiosParamsEdit = (formData) => ({
killedBy: RosterStudentTable tests pagination appears and lets user navigate when there are more students than the page size
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td
  data-testid="RosterStudentTable-cell-row-10-col-studentId"
>
  S11
</td> instead

[Killed] ArithmeticOperator
main/components/RosterStudent/RosterStudentTable.jsx:47:6
   };
 
   const paginatedStudents = students.slice(
-    (currentPage - 1) * pageSize,
+    (currentPage + 1) * pageSize,
     currentPage * pageSize,
   );
killedBy: EnrollmentTabComponent Tests Table Renders
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-RosterStudentTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-EnrollmentTabComponent"
    >

[Killed] ArithmeticOperator
main/components/RosterStudent/RosterStudentTable.jsx:47:5
   };
 
   const paginatedStudents = students.slice(
-    (currentPage - 1) * pageSize,
+    (currentPage - 1) / pageSize,
     currentPage * pageSize,
   );
killedBy: RosterStudentTable tests pagination appears and lets user navigate when there are more students than the page size
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  S11
Received:
  S1

[Killed] ArithmeticOperator
main/components/RosterStudent/RosterStudentTable.jsx:48:5
 
   const paginatedStudents = students.slice(
     (currentPage - 1) * pageSize,
-    currentPage * pageSize,
+    currentPage / pageSize,
   );
 
killedBy: EnrollmentTabComponent Tests Table Renders
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-RosterStudentTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-EnrollmentTabComponent"
    >

[Killed] ArrowFunction
main/components/RosterStudent/RosterStudentTable.jsx:51:33
     currentPage * pageSize,
   );
 
-  const cellToAxiosParamsEdit = (formData) => ({
-    url: `/api/rosterstudents/update`,
-    method: "PUT",
-    params: {
-      studentId: formData.studentId,
-      firstName: formData.firstName,
-      lastName: formData.lastName,
-      section: formData.section,
-      id: formData.id,
-    },
-  });
+  const cellToAxiosParamsEdit = () => undefined;
 
   const hideEditModal = () => {
killedBy: RosterStudentTable tests Edit button navigates to the edit page
statusReason: Cannot read properties of undefined (reading 'params')

[Killed] StringLiteral
main/components/RosterStudent/RosterStudentTable.jsx:53:13
 
   const cellToAxiosParamsEdit = (formData) => ({
     url: `/api/rosterstudents/update`,
-    method: "PUT",
+    method: "",
     params: {
       studentId: formData.studentId,
killedBy: RosterStudentTable tests Edit button navigates to the edit page
statusReason: Cannot read properties of undefined (reading 'params')

[Killed] BlockStatement
main/components/RosterStudent/RosterStudentTable.jsx:63:31
     },
   });
 
-  const hideEditModal = () => {
-    setShowEditModal(false);
-  };
+  const hideEditModal = () => {};
 
   const hideDeleteModal = () => {
killedBy: RosterStudentTable tests Edit button navigates to the edit page
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-title h4"
>
  Edit Student
</div> instead

[Killed] BooleanLiteral
main/components/RosterStudent/RosterStudentTable.jsx:64:22
   });
 
   const hideEditModal = () => {
-    setShowEditModal(false);
+    setShowEditModal(true);
   };
 
killedBy: RosterStudentTable tests Edit button navigates to the edit page
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-title h4"
>
  Edit Student
</div> instead

[Killed] BlockStatement
main/components/RosterStudent/RosterStudentTable.jsx:71:31
     setShowDeleteModal(false);
   };
 
-  const onEditSuccess = () => {
-    toast("Student updated successfully.");
-    hideEditModal();
-  };
+  const onEditSuccess = () => {};
 
   const onDeleteSuccess = () => {
killedBy: RosterStudentTable tests Edit button navigates to the edit page
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-title h4"
>
  Edit Student
</div> instead

[Killed] BlockStatement
main/components/RosterStudent/RosterStudentTable.jsx:87:42
     [`/api/rosterstudents/course/${courseId}`],
   );
 
-  const deleteCallback = async (cell) => {
-    setShowDeleteModal(true);
-    setDeleteStudent(cell.row.original.id);
-  };
+  const deleteCallback = async (cell) => {};
 
   const submitDeleteForm = (data) => {
killedBy: RosterStudentTable tests Delete button calls delete callback
statusReason: Unable to find an element by: [data-testid="RosterStudentDeleteModal"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] StringLiteral
main/components/RosterStudent/RosterStudentTable.jsx:102:6
   const editMutation = useBackendMutation(
     cellToAxiosParamsEdit,
     { onSuccess: onEditSuccess },
-    [`/api/rosterstudents/course/${courseId}`],
+    [``],
   );
 
killedBy: RosterStudentTable tests Edit button navigates to the edit page
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
main/components/RosterStudent/RosterStudentTable.jsx:105:34
     [`/api/rosterstudents/course/${courseId}`],
   );
 
-  const editCallback = (cell) => {
-    setEditStudent(cell.row.original);
-    setShowEditModal(true);
-  };
+  const editCallback = (cell) => {};
 
   const submitEditForm = (data) => {
killedBy: RosterStudentTable tests Edit button navigates to the edit page
statusReason: Unable to find an element with the text: Edit Student. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex justify-content-end align-items-center mb-2"
    >

[Killed] BooleanLiteral
main/components/RosterStudent/RosterStudentTable.jsx:107:22
 
   const editCallback = (cell) => {
     setEditStudent(cell.row.original);
-    setShowEditModal(true);
+    setShowEditModal(false);
   };
 
killedBy: RosterStudentTable tests Edit button navigates to the edit page
statusReason: Unable to find an element with the text: Edit Student. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex justify-content-end align-items-center mb-2"
    >

[Killed] StringLiteral
main/components/RosterStudent/RosterStudentTable.jsx:123:20
 
     {
       header: "Student Id",
-      accessorKey: "studentId",
+      accessorKey: "",
     },
 
killedBy: StaffCourseShowPage tests renders course header and staff-appropriate tabs
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/RosterStudent/RosterStudentTable.jsx:144:15
       cell: ({ cell }) => translateSection(cell.row.original.section),
     },
     {
-      header: "GitHub Login",
+      header: "",
       accessorKey: "githubLogin",
     },
killedBy: RosterStudentTable tests renders empty table correctly
statusReason: Unable to find an element with the text: GitHub Login. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex justify-content-end align-items-center mb-2"
    >

[Killed] ArrowFunction
main/components/RosterStudent/RosterStudentTable.jsx:149:15
     },
     {
       id: "teams",
-      header: () => (
-        <OverlayTrigger
-          placement="right"
-          overlay={
-            <Tooltip id={`tooltip-teams-header`}>
-              A list of teams that the student is a member of.
-            </Tooltip>
-          }
-        >
-          <span>Teams</span>
-        </OverlayTrigger>
-      ),
+      header: () => undefined,
       accessorFn: (row) =>
         Array.isArray(row.teams) ? row.teams.join(", ") : "",
killedBy: RosterStudentTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Teams. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex justify-content-end align-items-center mb-2"
    >

[Killed] StringLiteral
main/components/RosterStudent/RosterStudentTable.jsx:153:26
         <OverlayTrigger
           placement="right"
           overlay={
-            <Tooltip id={`tooltip-teams-header`}>
+            <Tooltip id={``}>
               A list of teams that the student is a member of.
             </Tooltip>
killedBy: tooltips for Team column name
statusReason: expect(element).toHaveAttribute("id", "tooltip-teams-header") // element.getAttribute("id") === "tooltip-teams-header"

Expected the element to have attribute:
  id="tooltip-teams-header"
Received:
  id=""

[Killed] ArrowFunction
main/components/RosterStudent/RosterStudentTable.jsx:161:19
           <span>Teams</span>
         </OverlayTrigger>
       ),
-      accessorFn: (row) =>
-        Array.isArray(row.teams) ? row.teams.join(", ") : "",
+      accessorFn: () => undefined,
     },
   ];
killedBy: RosterStudentTable tests Has the expected column headers, content and buttons for admin user
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Team A, Team B
Received:

[Killed] ConditionalExpression
main/components/RosterStudent/RosterStudentTable.jsx:171:9
       let set_message;
 
       switch (orgStatus) {
-        case "PENDING":
-          set_message =
-            "Student cannot join the course until it has been completely set up.";
-          break;
+        case "PENDING":
         case "JOINCOURSE":
           set_message =
killedBy: tooltips for PENDING status
statusReason: Unable to find an element with the text: Student cannot join the course until it has been completely set up.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ConditionalExpression
main/components/RosterStudent/RosterStudentTable.jsx:175:9
           set_message =
             "Student cannot join the course until it has been completely set up.";
           break;
-        case "JOINCOURSE":
-          set_message =
-            "Student has been prompted to join, but hasn't yet clicked the 'Join Course' button to generate an invite to the organization.";
-          break;
+        case "JOINCOURSE":
         case "INVITED":
           set_message =
killedBy: tooltips for JOINCOURSE status
statusReason: 
Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ConditionalExpression
main/components/RosterStudent/RosterStudentTable.jsx:179:9
           set_message =
             "Student has been prompted to join, but hasn't yet clicked the 'Join Course' button to generate an invite to the organization.";
           break;
-        case "INVITED":
-          set_message =
-            "Student has generated an invite, but has not yet accepted or declined the invitation.";
-          break;
+        case "INVITED":
         case "OWNER":
           set_message =
killedBy: tooltips for INVITED status
statusReason: Unable to find an element with the text: Student has generated an invite, but has not yet accepted or declined the invitation.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ConditionalExpression
main/components/RosterStudent/RosterStudentTable.jsx:183:9
           set_message =
             "Student has generated an invite, but has not yet accepted or declined the invitation.";
           break;
-        case "OWNER":
-          set_message =
-            "Student is an owner of the GitHub organization associated with this course.";
-          break;
+        case "OWNER":
         case "MEMBER":
           set_message =
killedBy: tooltips for OWNER status
statusReason: Unable to find an element with the text: Student is an owner of the GitHub organization associated with this course.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ConditionalExpression
main/components/RosterStudent/RosterStudentTable.jsx:187:9
           set_message =
             "Student is an owner of the GitHub organization associated with this course.";
           break;
-        case "MEMBER":
-          set_message =
-            "Student is a member of the GitHub organization associated with this course.";
-          break;
+        case "MEMBER":
         default:
           set_message = "Tooltip for illegal status that will never occur";
killedBy: tooltips for MEMBER status
statusReason: Unable to find an element with the text: Student is a member of the GitHub organization associated with this course.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] BlockStatement
main/components/RosterStudent/RosterStudentTable.jsx:207:33
     accessorKey: "orgStatus",
     cell: ({ cell }) => {
       const status = cell.row.original.orgStatus;
-      if (status === "PENDING") {
-        return (
-          <OverlayTrigger placement="right" overlay={renderTooltip("PENDING")}>
-            <span className="text-danger">Pending</span>
-          </OverlayTrigger>
-        );
-      } else if (status === "JOINCOURSE") {
+      if (status === "PENDING") {} else if (status === "JOINCOURSE") {
         return (
           <OverlayTrigger
killedBy: RosterStudentTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element with the text: Pending. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex justify-content-end align-items-center mb-2"
    >

[Killed] ConditionalExpression
main/components/RosterStudent/RosterStudentTable.jsx:222:18
             <span className="text-primary">Join Course</span>
           </OverlayTrigger>
         );
-      } else if (status === "INVITED") {
+      } else if (false) {
         return (
           <OverlayTrigger placement="right" overlay={renderTooltip("INVITED")}>
killedBy: RosterStudentTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element with the text: Invited. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex justify-content-end align-items-center mb-2"
    >

[Killed] BlockStatement
main/components/RosterStudent/RosterStudentTable.jsx:234:39
             <span style={{ color: "purple" }}>Owner</span>
           </OverlayTrigger>
         );
-      } else if (status === "MEMBER") {
-        return (
-          <OverlayTrigger placement="right" overlay={renderTooltip("MEMBER")}>
-            <span className="text-success">Member</span>
-          </OverlayTrigger>
-        );
-      }
+      } else if (status === "MEMBER") {}
       return (
         <OverlayTrigger
killedBy: RosterStudentTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element with the text: Member. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex justify-content-end align-items-center mb-2"
    >

[Killed] LogicalOperator
main/components/RosterStudent/RosterStudentTable.jsx:253:5
   });
 
   const canEditRoster =
-    canEditStudents ?? hasRole(currentUser, "ROLE_INSTRUCTOR");
+    canEditStudents && hasRole(currentUser, "ROLE_INSTRUCTOR");
 
   if (canEditRoster) {
killedBy: RosterStudentTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="RosterStudentTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex justify-content-end align-items-center mb-2"
    >

[Killed] ConditionalExpression
main/components/RosterStudent/RosterStudentTable.jsx:255:7
   const canEditRoster =
     canEditStudents ?? hasRole(currentUser, "ROLE_INSTRUCTOR");
 
-  if (canEditRoster) {
+  if (true) {
     columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
     columns.push(
killedBy: RosterStudentTable tests Has the expected column headers, content for ordinary user
statusReason: Found multiple elements with the text: Delete

Here are the matching elements:

Ignored nodes: comments, script, style
<div
  data-testid="RosterStudentTable-header-Delete-sort-header"
>

[Killed] BlockStatement
main/components/RosterStudent/RosterStudentTable.jsx:255:22
   const canEditRoster =
     canEditStudents ?? hasRole(currentUser, "ROLE_INSTRUCTOR");
 
-  if (canEditRoster) {
-    columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
-    columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix),
-    );
-  }
+  if (canEditRoster) {}
 
   return (
killedBy: StaffCourseShowPage tests staff users can still manage students and teams
statusReason: Unable to find an element by: [data-testid="StaffCourseShowPage-RosterStudentTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] StringLiteral
main/components/RosterStudent/RosterStudentTable.jsx:256:39
     canEditStudents ?? hasRole(currentUser, "ROLE_INSTRUCTOR");
 
   if (canEditRoster) {
-    columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
+    columns.push(ButtonColumn("Edit", "", editCallback, testIdPrefix));
     columns.push(
       ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix),
killedBy: RosterStudentTable tests Has the expected column headers, content and buttons for admin user
statusReason: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn

[Killed] StringLiteral
main/components/RosterStudent/RosterStudentTable.jsx:296:24
         </Form.Label>
         <Form.Select
           id={`${testIdPrefix}-pageSizeSelect`}
-          data-testid={`${testIdPrefix}-pageSizeSelect`}
+          data-testid={``}
           style={{ width: "auto" }}
           value={pageSize}
killedBy: RosterStudentTable tests page size selector defaults to 100 and hides pagination when not needed
statusReason: Unable to find an element by: [data-testid="RosterStudentTable-pageSizeSelect"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ObjectLiteral
main/components/RosterStudent/RosterStudentTable.jsx:297:18
         <Form.Select
           id={`${testIdPrefix}-pageSizeSelect`}
           data-testid={`${testIdPrefix}-pageSizeSelect`}
-          style={{ width: "auto" }}
+          style={{}}
           value={pageSize}
           onChange={handlePageSizeChange}
killedBy: RosterStudentTable tests page size selector defaults to 100 and hides pagination when not needed
statusReason: expect(element).toHaveStyle()

- Expected

- width: auto;

[Killed] StringLiteral
main/components/RosterStudent/RosterStudentTable.jsx:297:27
         <Form.Select
           id={`${testIdPrefix}-pageSizeSelect`}
           data-testid={`${testIdPrefix}-pageSizeSelect`}
-          style={{ width: "auto" }}
+          style={{ width: "" }}
           value={pageSize}
           onChange={handlePageSizeChange}
killedBy: RosterStudentTable tests page size selector defaults to 100 and hides pagination when not needed
statusReason: expect(element).toHaveStyle()

- Expected

- width: auto;

[Killed] ArrowFunction
main/components/RosterStudent/RosterStudentTable.jsx:301:34
           value={pageSize}
           onChange={handlePageSizeChange}
         >
-          {PAGE_SIZE_OPTIONS.map((size) => (
-            <option key={size} value={size}>
-              {size}
-            </option>
-          ))}
+          {PAGE_SIZE_OPTIONS.map(() => undefined)}
         </Form.Select>
       </div>
killedBy: RosterStudentTable tests page size selector defaults to 100 and hides pagination when not needed
statusReason: expect(element).toHaveValue(100)

Expected the element to have value:
  100
Received:
  undefined

[Killed] EqualityOperator
main/components/RosterStudent/RosterStudentTable.jsx:313:8
         columns={columns}
         testid={testIdPrefix}
       />
-      {totalPages > 1 && (
+      {totalPages <= 1 && (
         <div className="d-flex justify-content-center mb-2">
           <OurPagination
killedBy: RosterStudentTable tests page size selector defaults to 100 and hides pagination when not needed
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a
  class="page-link"
  data-testid="RosterStudentTable-pagination-prev"
  href="#"
  role="button"
  tabindex="0"

[Killed] ConditionalExpression
main/components/RosterStudent/RosterStudentTable.jsx:313:8
         columns={columns}
         testid={testIdPrefix}
       />
-      {totalPages > 1 && (
-        <div className="d-flex justify-content-center mb-2">
-          <OurPagination
-            currentActivePage={currentPage}
-            updateActivePage={setCurrentPage}
-            totalPages={totalPages}
-            testId={`${testIdPrefix}-pagination`}
-          />
-        </div>
-      )}
+      {false}
       <div
         style={{ display: "none" }}
killedBy: RosterStudentTable tests pagination appears and lets user navigate when there are more students than the page size
statusReason: Unable to find an element by: [data-testid="RosterStudentTable-pagination-next"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] StringLiteral
main/components/RosterStudent/RosterStudentTable.jsx:319:21
             currentActivePage={currentPage}
             updateActivePage={setCurrentPage}
             totalPages={totalPages}
-            testId={`${testIdPrefix}-pagination`}
+            testId={``}
           />
         </div>
killedBy: RosterStudentTable tests pagination appears and lets user navigate when there are more students than the page size
statusReason: Unable to find an element by: [data-testid="RosterStudentTable-pagination-next"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] StringLiteral
main/components/RosterStudent/RosterStudentTable.jsx:324:27
         </div>
       )}
       <div
-        style={{ display: "none" }}
+        style={{ display: "" }}
         data-testid={`${testIdPrefix}-courseId`}
         data-course-id={`${courseId}`}
killedBy: RosterStudentTable tests renders empty table correctly
statusReason: expect(element).toHaveStyle()

- Expected

- display: none;
