[Killed] StringLiteral
main/components/NewAssignments/NewIndividualAssignmentForm.jsx:8:22
   PERMISSION_LABELS,
 } from "main/utils/newAssignmentsUtils";
 
-const testIdPrefix = "NewIndividualAssignmentForm";
+const testIdPrefix = "";
 
 export default function NewIndividualAssignmentForm({
killedBy: NewAssignmentsTable tests editing an individual assignment opens the individual form, prefilled, without a way to change the type
statusReason: Unable to find an element by: [data-testid="NewIndividualAssignmentForm-repoPrefix"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Timeout] ArrowFunction
main/components/NewAssignments/NewIndividualAssignmentForm.jsx:40:23
           isInvalid={Boolean(errors.repoPrefix)}
           data-testid={`${testIdPrefix}-repoPrefix`}
           {...register("repoPrefix", {
-            validate: (value) =>
-              value.trim().length > 0 || "Repository Prefix is required.",
+            validate: () => undefined,
           })}
         />

[Killed] EqualityOperator
main/components/NewAssignments/NewIndividualAssignmentForm.jsx:41:15
           data-testid={`${testIdPrefix}-repoPrefix`}
           {...register("repoPrefix", {
             validate: (value) =>
-              value.trim().length > 0 || "Repository Prefix is required.",
+              value.trim().length <= 0 || "Repository Prefix is required.",
           })}
         />
killedBy: NewAssignmentsTable tests submitting the individual edit sends PUT without the type, toasts the job, and closes the modal
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ConditionalExpression
main/components/NewAssignments/NewIndividualAssignmentForm.jsx:41:15
           data-testid={`${testIdPrefix}-repoPrefix`}
           {...register("repoPrefix", {
             validate: (value) =>
-              value.trim().length > 0 || "Repository Prefix is required.",
+              true,
           })}
         />
killedBy: NewIndividualAssignmentForm tests requires a repository prefix, and does not submit without one
statusReason: Unable to find an element with the text: Repository Prefix is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      data-testid="NewIndividualAssignmentForm"

[Killed] OptionalChaining
main/components/NewAssignments/NewIndividualAssignmentForm.jsx:45:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.repoPrefix?.message}
+          {errors.repoPrefix.message}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: NewAssignmentsTable tests editing an individual assignment opens the individual form, prefilled, without a way to change the type
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/NewAssignments/NewIndividualAssignmentForm.jsx:53:24
           id="isPrivate"
           type="switch"
           label="Private Repositories?"
-          data-testid={`${testIdPrefix}-isPrivate`}
+          data-testid={``}
           {...register("isPrivate")}
         />
killedBy: NewAssignmentsTable tests editing an individual assignment opens the individual form, prefilled, without a way to change the type
statusReason: Unable to find an element by: [data-testid="NewIndividualAssignmentForm-isPrivate"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] StringLiteral
main/components/NewAssignments/NewIndividualAssignmentForm.jsx:62:24
         <Form.Select
           id="permission"
           data-testid={`${testIdPrefix}-permission`}
-          {...register("permission")}
+          {...register("")}
         >
           {Object.entries(PERMISSION_LABELS).map(([value, label]) => (
killedBy: NewAssignmentsTable tests editing an individual assignment opens the individual form, prefilled, without a way to change the type
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] ArrowFunction
main/components/NewAssignments/NewIndividualAssignmentForm.jsx:64:50
           data-testid={`${testIdPrefix}-permission`}
           {...register("permission")}
         >
-          {Object.entries(PERMISSION_LABELS).map(([value, label]) => (
-            <option key={value} value={value}>
-              {label}
-            </option>
-          ))}
+          {Object.entries(PERMISSION_LABELS).map(() => undefined)}
         </Form.Select>
       </Form.Group>
killedBy: NewAssignmentsTable tests editing an individual assignment opens the individual form, prefilled, without a way to change the type
statusReason: expect(element).toHaveValue(READ)

Expected the element to have value:
  READ
Received:
  undefined

[Killed] ArrowFunction
main/components/NewAssignments/NewIndividualAssignmentForm.jsx:80:56
           data-testid={`${testIdPrefix}-createReposFor`}
           {...register("createReposFor")}
         >
-          {Object.entries(CREATE_REPOS_FOR_LABELS).map(([value, label]) => (
-            <option key={value} value={value}>
-              {label}
-            </option>
-          ))}
+          {Object.entries(CREATE_REPOS_FOR_LABELS).map(() => undefined)}
         </Form.Select>
       </Form.Group>
killedBy: NewAssignmentsTabComponent tests Create Individual Assignment opens the individual form; submitting sends POST, toasts the job, closes the modal and refreshes
statusReason: expected { courseId: 7, …(5) } to deeply equal { courseId: 7, …(5) }

[Killed] StringLiteral
main/components/NewAssignments/NewIndividualAssignmentForm.jsx:87:42
           ))}
         </Form.Select>
       </Form.Group>
-      <Button type="submit" data-testid={`${testIdPrefix}-submit`}>
+      <Button type="submit" data-testid={``}>
         {buttonLabel}
       </Button>
killedBy: NewAssignmentsTabComponent tests Create Individual Assignment opens the individual form; submitting sends POST, toasts the job, closes the modal and refreshes
statusReason: Unable to find an element by: [data-testid="NewIndividualAssignmentForm-submit"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>
