[Killed] StringLiteral
main/components/NewAssignments/NewTeamAssignmentForm.jsx:39:24
           id="repoPrefix"
           type="text"
           isInvalid={Boolean(errors.repoPrefix)}
-          data-testid={`${testIdPrefix}-repoPrefix`}
+          data-testid={``}
           {...register("repoPrefix", {
             validate: (value) =>
killedBy: NewAssignmentsTable tests editing a team assignment opens the team form, and submitting sends the team regex
statusReason: Unable to find an element by: [data-testid="NewTeamAssignmentForm-repoPrefix"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] StringLiteral
main/components/NewAssignments/NewTeamAssignmentForm.jsx:40:24
           type="text"
           isInvalid={Boolean(errors.repoPrefix)}
           data-testid={`${testIdPrefix}-repoPrefix`}
-          {...register("repoPrefix", {
+          {...register("", {
             validate: (value) =>
               value.trim().length > 0 || "Team Repository Prefix is required.",
killedBy: NewAssignmentsTable tests editing a team assignment opens the team form, and submitting sends the team regex
statusReason: Cannot read properties of undefined (reading '_f')

[Timeout] ArrowFunction
main/components/NewAssignments/NewTeamAssignmentForm.jsx:41:23
           isInvalid={Boolean(errors.repoPrefix)}
           data-testid={`${testIdPrefix}-repoPrefix`}
           {...register("repoPrefix", {
-            validate: (value) =>
-              value.trim().length > 0 || "Team Repository Prefix is required.",
+            validate: () => undefined,
           })}
         />

[Killed] LogicalOperator
main/components/NewAssignments/NewTeamAssignmentForm.jsx:42:15
           data-testid={`${testIdPrefix}-repoPrefix`}
           {...register("repoPrefix", {
             validate: (value) =>
-              value.trim().length > 0 || "Team Repository Prefix is required.",
+              value.trim().length > 0 && "Team Repository Prefix is required.",
           })}
         />
killedBy: NewAssignmentsTable tests editing a team assignment opens the team form, and submitting sends the team regex
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ConditionalExpression
main/components/NewAssignments/NewTeamAssignmentForm.jsx:42:15
           data-testid={`${testIdPrefix}-repoPrefix`}
           {...register("repoPrefix", {
             validate: (value) =>
-              value.trim().length > 0 || "Team Repository Prefix is required.",
+              false,
           })}
         />
killedBy: NewAssignmentsTable tests editing a team assignment opens the team form, and submitting sends the team regex
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] StringLiteral
main/components/NewAssignments/NewTeamAssignmentForm.jsx:92:24
           id="teamRegex"
           type="text"
           isInvalid={Boolean(errors.teamRegex)}
-          data-testid={`${testIdPrefix}-teamRegex`}
+          data-testid={``}
           {...register("teamRegex", {
             validate: (value) =>
killedBy: NewAssignmentsTabComponent tests Create Team Assignment opens the team form with the default team regex; submitting sends POST with the team regex
statusReason: Unable to find an element by: [data-testid="NewTeamAssignmentForm-teamRegex"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Timeout] ArrowFunction
main/components/NewAssignments/NewTeamAssignmentForm.jsx:94:23
           isInvalid={Boolean(errors.teamRegex)}
           data-testid={`${testIdPrefix}-teamRegex`}
           {...register("teamRegex", {
-            validate: (value) =>
-              value.trim().length > 0 || "Team Regex is required.",
+            validate: () => undefined,
           })}
         />

[Killed] EqualityOperator
main/components/NewAssignments/NewTeamAssignmentForm.jsx:95:15
           data-testid={`${testIdPrefix}-teamRegex`}
           {...register("teamRegex", {
             validate: (value) =>
-              value.trim().length > 0 || "Team Regex is required.",
+              value.trim().length <= 0 || "Team Regex is required.",
           })}
         />
killedBy: NewAssignmentsTable tests editing a team assignment opens the team form, and submitting sends the team regex
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] LogicalOperator
main/components/NewAssignments/NewTeamAssignmentForm.jsx:95:15
           data-testid={`${testIdPrefix}-teamRegex`}
           {...register("teamRegex", {
             validate: (value) =>
-              value.trim().length > 0 || "Team Regex is required.",
+              value.trim().length > 0 && "Team Regex is required.",
           })}
         />
killedBy: NewAssignmentsTable tests editing a team assignment opens the team form, and submitting sends the team regex
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] OptionalChaining
main/components/NewAssignments/NewTeamAssignmentForm.jsx:99:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.teamRegex?.message}
+          {errors.teamRegex.message}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: NewAssignmentsTable tests editing a team assignment opens the team form, and submitting sends the team regex
statusReason: Cannot read properties of undefined (reading 'message')
