[Killed] ArrowFunction
main/components/TabComponent/NewAssignmentsTabComponent.jsx:37:35
     true,
   );
 
-  const objectToAxiosParamsPost = (formData) => ({
-    url: `${NEW_ASSIGNMENTS_URL}/post`,
-    method: "POST",
-    params: {
-      courseId: courseId,
-      asnType: createType,
-      ...formDataToParams(createType, formData),
-    },
-  });
+  const objectToAxiosParamsPost = () => undefined;
 
   const onCreateSuccess = (data) => {
killedBy: NewAssignmentsTabComponent tests Create Individual Assignment opens the individual form; submitting sends POST, toasts the job, closes the modal and refreshes
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ObjectLiteral
main/components/TabComponent/NewAssignmentsTabComponent.jsx:37:50
     true,
   );
 
-  const objectToAxiosParamsPost = (formData) => ({
-    url: `${NEW_ASSIGNMENTS_URL}/post`,
-    method: "POST",
-    params: {
-      courseId: courseId,
-      asnType: createType,
-      ...formDataToParams(createType, formData),
-    },
-  });
+  const objectToAxiosParamsPost = (formData) => ({});
 
   const onCreateSuccess = (data) => {
killedBy: NewAssignmentsTabComponent tests Create Individual Assignment opens the individual form; submitting sends POST, toasts the job, closes the modal and refreshes
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] BlockStatement
main/components/TabComponent/NewAssignmentsTabComponent.jsx:47:37
     },
   });
 
-  const onCreateSuccess = (data) => {
-    toast(jobStartedMessage("created", data));
-    setCreateType(null);
-  };
+  const onCreateSuccess = (data) => {};
 
   const createMutation = useBackendMutation(
killedBy: NewAssignmentsTabComponent tests Create Individual Assignment opens the individual form; submitting sends POST, toasts the job, closes the modal and refreshes
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/TabComponent/NewAssignmentsTabComponent.jsx:48:29
   });
 
   const onCreateSuccess = (data) => {
-    toast(jobStartedMessage("created", data));
+    toast(jobStartedMessage("", data));
     setCreateType(null);
   };
killedBy: NewAssignmentsTabComponent tests Create Individual Assignment opens the individual form; submitting sends POST, toasts the job, closes the modal and refreshes
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Assignment created. Job 99 started to create its repositories; click the job number in the table to watch its log.",

[Killed] ArrayDeclaration
main/components/TabComponent/NewAssignmentsTabComponent.jsx:55:5
   const createMutation = useBackendMutation(
     objectToAxiosParamsPost,
     { onSuccess: onCreateSuccess, onError: onAssignmentMutationError },
-    [queryKey, JOBS_QUERY_KEY],
+    [],
   );
 
killedBy: NewAssignmentsTabComponent tests Create Individual Assignment opens the individual form; submitting sends POST, toasts the job, closes the modal and refreshes
statusReason: expected 1 to be 2 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] BlockStatement
main/components/TabComponent/NewAssignmentsTabComponent.jsx:58:44
     [queryKey, JOBS_QUERY_KEY],
   );
 
-  const handleCreateSubmit = (formData) => {
-    createMutation.mutate(formData);
-  };
+  const handleCreateSubmit = (formData) => {};
 
   const creatingTeam = createType === "TEAM";
killedBy: NewAssignmentsTabComponent tests Create Individual Assignment opens the individual form; submitting sends POST, toasts the job, closes the modal and refreshes
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ConditionalExpression
main/components/TabComponent/NewAssignmentsTabComponent.jsx:62:24
     createMutation.mutate(formData);
   };
 
-  const creatingTeam = createType === "TEAM";
+  const creatingTeam = false;
   const CreateForm = creatingTeam
     ? NewTeamAssignmentForm
killedBy: NewAssignmentsTabComponent tests Create Team Assignment opens the team form with the default team regex; submitting sends POST with the team regex
statusReason: Unable to find an element with the text: Create Team Assignment, which matches selector '.modal-title'. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-ri

[Killed] EqualityOperator
main/components/TabComponent/NewAssignmentsTabComponent.jsx:62:24
     createMutation.mutate(formData);
   };
 
-  const creatingTeam = createType === "TEAM";
+  const creatingTeam = createType !== "TEAM";
   const CreateForm = creatingTeam
     ? NewTeamAssignmentForm
killedBy: NewAssignmentsTabComponent tests Create Individual Assignment opens the individual form; submitting sends POST, toasts the job, closes the modal and refreshes
statusReason: Unable to find an element with the text: Create Individual Assignment, which matches selector '.modal-title'. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padd

[Killed] ConditionalExpression
main/components/TabComponent/NewAssignmentsTabComponent.jsx:70:15
   return (
     <div data-testid={`${testIdPrefix}-new-assignments-tab-component`}>
       <Modal
-        show={createType !== null}
+        show={true}
         onHide={() => setCreateType(null)}
         centered={true}
killedBy: NewAssignmentsTabComponent tests renders the two create buttons and the assignments from the backend
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="InstructorCourseShowPage-create-assignment-modal"
>
  <div
    class="modal-content"

[Killed] ConditionalExpression
main/components/TabComponent/NewAssignmentsTabComponent.jsx:70:15
   return (
     <div data-testid={`${testIdPrefix}-new-assignments-tab-component`}>
       <Modal
-        show={createType !== null}
+        show={false}
         onHide={() => setCreateType(null)}
         centered={true}
killedBy: NewAssignmentsTabComponent tests Create Individual Assignment opens the individual form; submitting sends POST, toasts the job, closes the modal and refreshes
statusReason: Unable to find an element with the text: Create Individual Assignment, which matches selector '.modal-title'. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-new-assignments-t

[Killed] ArrowFunction
main/components/TabComponent/NewAssignmentsTabComponent.jsx:71:17
     <div data-testid={`${testIdPrefix}-new-assignments-tab-component`}>
       <Modal
         show={createType !== null}
-        onHide={() => setCreateType(null)}
+        onHide={() => undefined}
         centered={true}
         data-testid={`${testIdPrefix}-create-assignment-modal`}
killedBy: NewAssignmentsTabComponent tests the create modal can be closed, and reopened for the other kind of assignment
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-title h4"
>
  Create 
  Individual
   Assignment

[Killed] BooleanLiteral
main/components/TabComponent/NewAssignmentsTabComponent.jsx:72:19
       <Modal
         show={createType !== null}
         onHide={() => setCreateType(null)}
-        centered={true}
+        centered={false}
         data-testid={`${testIdPrefix}-create-assignment-modal`}
       >
killedBy: NewAssignmentsTabComponent tests Create Individual Assignment opens the individual form; submitting sends POST, toasts the job, closes the modal and refreshes
statusReason: expect(element).toHaveClass("modal-dialog modal-dialog-centered")

Expected the element to have class:
  modal-dialog modal-dialog-centered
Received:
  modal-dialog

[Killed] StringLiteral
main/components/TabComponent/NewAssignmentsTabComponent.jsx:73:22
         show={createType !== null}
         onHide={() => setCreateType(null)}
         centered={true}
-        data-testid={`${testIdPrefix}-create-assignment-modal`}
+        data-testid={``}
       >
         <Modal.Header closeButton>
killedBy: NewAssignmentsTabComponent tests Create Individual Assignment opens the individual form; submitting sends POST, toasts the job, closes the modal and refreshes
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-create-assignment-modal"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] StringLiteral
main/components/TabComponent/NewAssignmentsTabComponent.jsx:77:45
       >
         <Modal.Header closeButton>
           <Modal.Title>
-            Create {creatingTeam ? "Team" : "Individual"} Assignment
+            Create {creatingTeam ? "Team" : ""} Assignment
           </Modal.Title>
         </Modal.Header>
killedBy: NewAssignmentsTabComponent tests Create Individual Assignment opens the individual form; submitting sends POST, toasts the job, closes the modal and refreshes
statusReason: Unable to find an element with the text: Create Individual Assignment, which matches selector '.modal-title'. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padd

[Killed] ArrowFunction
main/components/TabComponent/NewAssignmentsTabComponent.jsx:90:22
       <Row sm={4} className="p-2 g-3">
         <Col>
           <Button
-            onClick={() => setCreateType("INDIVIDUAL")}
+            onClick={() => undefined}
             data-testid={`${testIdPrefix}-create-individual-assignment-button`}
             className="w-100"
killedBy: NewAssignmentsTabComponent tests Create Individual Assignment opens the individual form; submitting sends POST, toasts the job, closes the modal and refreshes
statusReason: Unable to find an element with the text: Create Individual Assignment, which matches selector '.modal-title'. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-new-assignments-t

[Killed] ArrowFunction
main/components/TabComponent/NewAssignmentsTabComponent.jsx:99:22
         </Col>
         <Col>
           <Button
-            onClick={() => setCreateType("TEAM")}
+            onClick={() => undefined}
             data-testid={`${testIdPrefix}-create-team-assignment-button`}
             className="w-100"
killedBy: NewAssignmentsTabComponent tests Create Team Assignment opens the team form with the default team regex; submitting sends POST with the team regex
statusReason: Unable to find an element with the text: Create Team Assignment, which matches selector '.modal-title'. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] StringLiteral
main/components/TabComponent/NewAssignmentsTabComponent.jsx:99:42
         </Col>
         <Col>
           <Button
-            onClick={() => setCreateType("TEAM")}
+            onClick={() => setCreateType("")}
             data-testid={`${testIdPrefix}-create-team-assignment-button`}
             className="w-100"
killedBy: NewAssignmentsTabComponent tests Create Team Assignment opens the team form with the default team regex; submitting sends POST with the team regex
statusReason: Unable to find an element with the text: Create Team Assignment, which matches selector '.modal-title'. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-ri

[Killed] StringLiteral
main/components/TabComponent/NewAssignmentsTabComponent.jsx:100:26
         <Col>
           <Button
             onClick={() => setCreateType("TEAM")}
-            data-testid={`${testIdPrefix}-create-team-assignment-button`}
+            data-testid={``}
             className="w-100"
           >
killedBy: NewAssignmentsTabComponent tests renders the two create buttons and the assignments from the backend
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-create-team-assignment-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-new-assignments-tab-component"
    >
