[Killed] BooleanLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:35:21
 
 export default function InstructorCourseShowPage({
   testId = "InstructorCourseShowPage",
-  showSettingsTab = true,
+  showSettingsTab = false,
   staffTabIsInstructor = true,
   canEditStudents,
killedBy: InstructorCourseShowPage tests Tab assertions
statusReason: Unable to find an element with the text: Settings. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] BooleanLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:36:26
 export default function InstructorCourseShowPage({
   testId = "InstructorCourseShowPage",
   showSettingsTab = true,
-  staffTabIsInstructor = true,
+  staffTabIsInstructor = false,
   canEditStudents,
   canManageTeams,
killedBy: InstructorCourseShowPage tests staff tab defaults to instructor controls
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:52:5
   } = useBackend(
     [`/api/courses/${courseId}`],
     // Stryker disable next-line StringLiteral : GET and empty string are equivalent
-    { method: "GET", url: `/api/courses/${courseId}` },
+    {},
     null,
     true,
killedBy: StaffCourseShowPage tests renders course header and staff-appropriate tabs
statusReason: Unable to find an element by: [data-testid="StaffCourseShowPage-title"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:63:27
   const { data: courseOptions } = useCourseOptions(courseId, {
     enabled: showSettingsTab,
   });
-  const showSectionsTab = courseOptions.TRANSLATE_SECTIONS === true;
+  const showSectionsTab = true;
 
   // The New Assignments tab is only shown when the NEW_ASSIGNMENT_FEATURES
killedBy: StaffCourseShowPage tests does not fetch course options and never shows the Sections tab
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  aria-controls="react-aria-_r_d_-tabpane-sections"
  aria-selected="false"
  class="nav-link"
  data-rr-ui-event-key="sections"
  id="react-aria-_r_d_-tab-sections"

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:63:27
   const { data: courseOptions } = useCourseOptions(courseId, {
     enabled: showSettingsTab,
   });
-  const showSectionsTab = courseOptions.TRANSLATE_SECTIONS === true;
+  const showSectionsTab = false;
 
   // The New Assignments tab is only shown when the NEW_ASSIGNMENT_FEATURES
killedBy: InstructorCourseShowPage tests shows the Sections tab when TRANSLATE_SECTIONS option is enabled
statusReason: Unable to find role="tab" and name "Sections"

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] EqualityOperator
main/pages/Instructor/InstructorCourseShowPage.jsx:67:33
 
   // The New Assignments tab is only shown when the NEW_ASSIGNMENT_FEATURES
   // course option is enabled.
-  const showNewAssignmentsTab = courseOptions.NEW_ASSIGNMENT_FEATURES === true;
+  const showNewAssignmentsTab = courseOptions.NEW_ASSIGNMENT_FEATURES !== true;
 
   // The Dokku tab is only shown when the DOKKU_MANAGER course option is enabled.
killedBy: InstructorCourseShowPage tests New Assignments tab is shown, right after Assignments, when the NEW_ASSIGNMENT_FEATURES option is enabled
statusReason: expect(element).toHaveAttribute("aria-selected", "true") // element.getAttribute("aria-selected") === "true"

Expected the element to have attribute:
  aria-selected="true"
Received:
  aria-selected="false"

[Killed] BooleanLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:67:75
 
   // The New Assignments tab is only shown when the NEW_ASSIGNMENT_FEATURES
   // course option is enabled.
-  const showNewAssignmentsTab = courseOptions.NEW_ASSIGNMENT_FEATURES === true;
+  const showNewAssignmentsTab = courseOptions.NEW_ASSIGNMENT_FEATURES === false;
 
   // The Dokku tab is only shown when the DOKKU_MANAGER course option is enabled.
killedBy: InstructorCourseShowPage tests New Assignments tab is shown, right after Assignments, when the NEW_ASSIGNMENT_FEATURES option is enabled
statusReason: Unable to find role="tab" and name "New Assignments"

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] EqualityOperator
main/pages/Instructor/InstructorCourseShowPage.jsx:70:24
   const showNewAssignmentsTab = courseOptions.NEW_ASSIGNMENT_FEATURES === true;
 
   // The Dokku tab is only shown when the DOKKU_MANAGER course option is enabled.
-  const showDokkuTab = courseOptions.DOKKU_MANAGER === true;
+  const showDokkuTab = courseOptions.DOKKU_MANAGER !== true;
 
   // The Slack tab is only shown when the SLACK_INTEGRATION course option is
killedBy: InstructorCourseShowPage tests New Assignments tab is shown, right after Assignments, when the NEW_ASSIGNMENT_FEATURES option is enabled
statusReason: expected [ 'Students', 'Staff', 'Teams', …(6) ] to deeply equal [ 'Students', 'Staff', 'Teams', …(5) ]

[Killed] BooleanLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:70:56
   const showNewAssignmentsTab = courseOptions.NEW_ASSIGNMENT_FEATURES === true;
 
   // The Dokku tab is only shown when the DOKKU_MANAGER course option is enabled.
-  const showDokkuTab = courseOptions.DOKKU_MANAGER === true;
+  const showDokkuTab = courseOptions.DOKKU_MANAGER === false;
 
   // The Slack tab is only shown when the SLACK_INTEGRATION course option is
killedBy: InstructorCourseShowPage tests New Assignments tab is shown, right after Assignments, when the NEW_ASSIGNMENT_FEATURES option is enabled
statusReason: expected [ 'Students', 'Staff', 'Teams', …(6) ] to deeply equal [ 'Students', 'Staff', 'Teams', …(5) ]

[Killed] BooleanLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:75:71
   // The Slack tab is only shown when the SLACK_INTEGRATION course option is
   // enabled and a Slack token has been saved. The query key is shared with the
   // Slack card on the Settings tab, so saving a token there shows the tab.
-  const slackIntegrationEnabled = courseOptions.SLACK_INTEGRATION === true;
+  const slackIntegrationEnabled = courseOptions.SLACK_INTEGRATION === false;
   const { data: slackInfo } = useBackend(
     [slackInfoQueryKey(courseId)],
killedBy: InstructorCourseShowPage tests shows the Slack tab when SLACK_INTEGRATION is enabled and a token is set; loads Slack data only when the tab is opened
statusReason: Unable to find role="tab" and name "Slack"

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] EqualityOperator
main/pages/Instructor/InstructorCourseShowPage.jsx:75:35
   // The Slack tab is only shown when the SLACK_INTEGRATION course option is
   // enabled and a Slack token has been saved. The query key is shared with the
   // Slack card on the Settings tab, so saving a token there shows the tab.
-  const slackIntegrationEnabled = courseOptions.SLACK_INTEGRATION === true;
+  const slackIntegrationEnabled = courseOptions.SLACK_INTEGRATION !== true;
   const { data: slackInfo } = useBackend(
     [slackInfoQueryKey(courseId)],
killedBy: InstructorCourseShowPage tests shows the Slack tab when SLACK_INTEGRATION is enabled and a token is set; loads Slack data only when the tab is opened
statusReason: Unable to find role="tab" and name "Slack"

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] BooleanLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:81:5
     // Stryker disable next-line StringLiteral : GET and empty string are equivalent
     { method: "GET", url: slackInfoQueryKey(courseId) },
     {},
-    true,
+    false,
     { enabled: slackIntegrationEnabled },
   );
killedBy: InstructorCourseShowPage tests shows the Slack tab when SLACK_INTEGRATION is enabled and a token is set; loads Slack data only when the tab is opened
statusReason: expected "useBackend" to be called with arguments: [ …(5) ]

Received:

  1st useBackend call:

  [
    [

[Killed] ObjectLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:82:5
     { method: "GET", url: slackInfoQueryKey(courseId) },
     {},
     true,
-    { enabled: slackIntegrationEnabled },
+    {},
   );
   const showSlackTab =
killedBy: InstructorCourseShowPage tests shows the Slack tab when SLACK_INTEGRATION is enabled and a token is set; loads Slack data only when the tab is opened
statusReason: expected "useBackend" to be called with arguments: [ …(5) ]

Received:

  1st useBackend call:

  [
    [

[Killed] LogicalOperator
main/pages/Instructor/InstructorCourseShowPage.jsx:85:5
     { enabled: slackIntegrationEnabled },
   );
   const showSlackTab =
-    slackIntegrationEnabled && Boolean(slackInfo.slackBotToken);
+    slackIntegrationEnabled || Boolean(slackInfo.slackBotToken);
 
   // Which tab is showing is kept in the URL as ?tab=<name>, so that a tab can be
killedBy: InstructorCourseShowPage tests hides the Slack tab when SLACK_INTEGRATION is enabled but no token has been set
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  aria-controls="react-aria-_r_2o_-tabpane-slack"
  aria-selected="false"
  class="nav-link"
  data-rr-ui-event-key="slack"
  id="react-aria-_r_2o_-tab-slack"

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:85:5
     { enabled: slackIntegrationEnabled },
   );
   const showSlackTab =
-    slackIntegrationEnabled && Boolean(slackInfo.slackBotToken);
+    true;
 
   // Which tab is showing is kept in the URL as ?tab=<name>, so that a tab can be
killedBy: InstructorCourseShowPage tests New Assignments tab is shown, right after Assignments, when the NEW_ASSIGNMENT_FEATURES option is enabled
statusReason: expected [ 'Students', 'Staff', 'Teams', …(6) ] to deeply equal [ 'Students', 'Staff', 'Teams', …(5) ]

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:90:41
   // Which tab is showing is kept in the URL as ?tab=<name>, so that a tab can be
   // linked to and survives a refresh; see main/utils/courseTabUtils
   const [searchParams, setSearchParams] = useSearchParams();
-  const requestedTab = searchParams.get("tab");
+  const requestedTab = searchParams.get("");
   const visibleTabs = COURSE_TABS.filter(
     (tab) =>
killedBy: InstructorCourseShowPage tests Tab assertions
statusReason: expect(element).toHaveAttribute("aria-selected", "true") // element.getAttribute("aria-selected") === "true"

Expected the element to have attribute:
  aria-selected="true"
Received:
  aria-selected="false"

[Killed] MethodExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:91:23
   // linked to and survives a refresh; see main/utils/courseTabUtils
   const [searchParams, setSearchParams] = useSearchParams();
   const requestedTab = searchParams.get("tab");
-  const visibleTabs = COURSE_TABS.filter(
-    (tab) =>
-      (tab !== "sections" || showSectionsTab) &&
-      (tab !== "new-assignments" || showNewAssignmentsTab) &&
-      (tab !== "dokku" || showDokkuTab) &&
-      (tab !== "slack" || showSlackTab) &&
-      (tab !== "settings" || showSettingsTab),
-  );
+  const visibleTabs = COURSE_TABS;
   const activeTab = chooseCourseTab({
     requestedTab,
killedBy: InstructorCourseShowPage tests ?tab= in the URL ?tab= for a tab the course does not have shows the Assignments tab
statusReason: expected [] to deeply equal [ 'Assignments' ]

[Killed] ArrowFunction
main/pages/Instructor/InstructorCourseShowPage.jsx:92:5
   const [searchParams, setSearchParams] = useSearchParams();
   const requestedTab = searchParams.get("tab");
   const visibleTabs = COURSE_TABS.filter(
-    (tab) =>
-      (tab !== "sections" || showSectionsTab) &&
-      (tab !== "new-assignments" || showNewAssignmentsTab) &&
-      (tab !== "dokku" || showDokkuTab) &&
-      (tab !== "slack" || showSlackTab) &&
-      (tab !== "settings" || showSettingsTab),
+    () => undefined,
   );
   const activeTab = chooseCourseTab({
killedBy: InstructorCourseShowPage tests Tab assertions
statusReason: expect(element).toHaveAttribute("aria-selected", "true") // element.getAttribute("aria-selected") === "true"

Expected the element to have attribute:
  aria-selected="true"
Received:
  aria-selected="false"

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:93:7
   const requestedTab = searchParams.get("tab");
   const visibleTabs = COURSE_TABS.filter(
     (tab) =>
-      (tab !== "sections" || showSectionsTab) &&
-      (tab !== "new-assignments" || showNewAssignmentsTab) &&
-      (tab !== "dokku" || showDokkuTab) &&
-      (tab !== "slack" || showSlackTab) &&
-      (tab !== "settings" || showSettingsTab),
+      false,
   );
   const activeTab = chooseCourseTab({
killedBy: InstructorCourseShowPage tests Tab assertions
statusReason: expect(element).toHaveAttribute("aria-selected", "true") // element.getAttribute("aria-selected") === "true"

Expected the element to have attribute:
  aria-selected="true"
Received:
  aria-selected="false"

[Killed] LogicalOperator
main/pages/Instructor/InstructorCourseShowPage.jsx:93:7
   const requestedTab = searchParams.get("tab");
   const visibleTabs = COURSE_TABS.filter(
     (tab) =>
-      (tab !== "sections" || showSectionsTab) &&
-      (tab !== "new-assignments" || showNewAssignmentsTab) &&
-      (tab !== "dokku" || showDokkuTab) &&
+      (tab !== "sections" || showSectionsTab) && (tab !== "new-assignments" || showNewAssignmentsTab) || tab !== "dokku" || showDokkuTab &&
       (tab !== "slack" || showSlackTab) &&
       (tab !== "settings" || showSettingsTab),
killedBy: InstructorCourseShowPage tests ?tab= in the URL ?tab= for a tab the course does not have shows the Assignments tab
statusReason: expected [] to deeply equal [ 'Assignments' ]

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:94:8
   const visibleTabs = COURSE_TABS.filter(
     (tab) =>
       (tab !== "sections" || showSectionsTab) &&
-      (tab !== "new-assignments" || showNewAssignmentsTab) &&
+      (false || showNewAssignmentsTab) &&
       (tab !== "dokku" || showDokkuTab) &&
       (tab !== "slack" || showSlackTab) &&
killedBy: InstructorCourseShowPage tests Tab assertions
statusReason: expect(element).toHaveAttribute("aria-selected", "true") // element.getAttribute("aria-selected") === "true"

Expected the element to have attribute:
  aria-selected="true"
Received:
  aria-selected="false"

[Killed] LogicalOperator
main/pages/Instructor/InstructorCourseShowPage.jsx:94:8
   const visibleTabs = COURSE_TABS.filter(
     (tab) =>
       (tab !== "sections" || showSectionsTab) &&
-      (tab !== "new-assignments" || showNewAssignmentsTab) &&
+      (tab !== "new-assignments" && showNewAssignmentsTab) &&
       (tab !== "dokku" || showDokkuTab) &&
       (tab !== "slack" || showSlackTab) &&
killedBy: InstructorCourseShowPage tests Tab assertions
statusReason: expect(element).toHaveAttribute("aria-selected", "true") // element.getAttribute("aria-selected") === "true"

Expected the element to have attribute:
  aria-selected="true"
Received:
  aria-selected="false"

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:95:8
     (tab) =>
       (tab !== "sections" || showSectionsTab) &&
       (tab !== "new-assignments" || showNewAssignmentsTab) &&
-      (tab !== "dokku" || showDokkuTab) &&
+      (true) &&
       (tab !== "slack" || showSlackTab) &&
       (tab !== "settings" || showSettingsTab),
killedBy: InstructorCourseShowPage tests ?tab= in the URL ?tab=dokku shows the Assignments tab when the Dokku Manager option is off
statusReason: expected [] to deeply equal [ 'Assignments' ]

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:95:8
     (tab) =>
       (tab !== "sections" || showSectionsTab) &&
       (tab !== "new-assignments" || showNewAssignmentsTab) &&
-      (tab !== "dokku" || showDokkuTab) &&
+      (false || showDokkuTab) &&
       (tab !== "slack" || showSlackTab) &&
       (tab !== "settings" || showSettingsTab),
killedBy: InstructorCourseShowPage tests Tab assertions
statusReason: expect(element).toHaveAttribute("aria-selected", "true") // element.getAttribute("aria-selected") === "true"

Expected the element to have attribute:
  aria-selected="true"
Received:
  aria-selected="false"

[Killed] EqualityOperator
main/pages/Instructor/InstructorCourseShowPage.jsx:96:8
       (tab !== "sections" || showSectionsTab) &&
       (tab !== "new-assignments" || showNewAssignmentsTab) &&
       (tab !== "dokku" || showDokkuTab) &&
-      (tab !== "slack" || showSlackTab) &&
+      (tab === "slack" || showSlackTab) &&
       (tab !== "settings" || showSettingsTab),
   );
killedBy: InstructorCourseShowPage tests Tab assertions
statusReason: expect(element).toHaveAttribute("aria-selected", "true") // element.getAttribute("aria-selected") === "true"

Expected the element to have attribute:
  aria-selected="true"
Received:
  aria-selected="false"

[Killed] LogicalOperator
main/pages/Instructor/InstructorCourseShowPage.jsx:96:8
       (tab !== "sections" || showSectionsTab) &&
       (tab !== "new-assignments" || showNewAssignmentsTab) &&
       (tab !== "dokku" || showDokkuTab) &&
-      (tab !== "slack" || showSlackTab) &&
+      (tab !== "slack" && showSlackTab) &&
       (tab !== "settings" || showSettingsTab),
   );
killedBy: InstructorCourseShowPage tests Tab assertions
statusReason: expect(element).toHaveAttribute("aria-selected", "true") // element.getAttribute("aria-selected") === "true"

Expected the element to have attribute:
  aria-selected="true"
Received:
  aria-selected="false"

[Killed] LogicalOperator
main/pages/Instructor/InstructorCourseShowPage.jsx:97:8
       (tab !== "new-assignments" || showNewAssignmentsTab) &&
       (tab !== "dokku" || showDokkuTab) &&
       (tab !== "slack" || showSlackTab) &&
-      (tab !== "settings" || showSettingsTab),
+      (tab !== "settings" && showSettingsTab),
   );
   const activeTab = chooseCourseTab({
killedBy: InstructorCourseShowPage tests ?tab= in the URL ?tab=settings opens the Settings tab, and remembers it
statusReason: expected [ 'Assignments' ] to deeply equal [ 'Settings' ]

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:97:8
       (tab !== "new-assignments" || showNewAssignmentsTab) &&
       (tab !== "dokku" || showDokkuTab) &&
       (tab !== "slack" || showSlackTab) &&
-      (tab !== "settings" || showSettingsTab),
+      (true),
   );
   const activeTab = chooseCourseTab({
killedBy: InstructorCourseShowPage tests ?tab= in the URL ?tab=settings shows the Assignments tab when there is no Settings tab
statusReason: expected [] to deeply equal [ 'Assignments' ]

[Killed] ObjectLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:99:37
       (tab !== "slack" || showSlackTab) &&
       (tab !== "settings" || showSettingsTab),
   );
-  const activeTab = chooseCourseTab({
-    requestedTab,
-    storedTab: getStoredCourseTab(courseId),
-    visibleTabs,
-  });
+  const activeTab = chooseCourseTab({});
   // Remember the tab for the next time this course is opened without ?tab=
   useEffect(() => {
killedBy: InstructorCourseShowPage tests renders correctly for instructor user
statusReason: Cannot read properties of undefined (reading 'includes')

[Killed] BlockStatement
main/pages/Instructor/InstructorCourseShowPage.jsx:105:19
     visibleTabs,
   });
   // Remember the tab for the next time this course is opened without ?tab=
-  useEffect(() => {
-    if (COURSE_TABS.includes(requestedTab)) {
-      storeCourseTab(courseId, requestedTab);
-    }
-  }, [courseId, requestedTab]);
+  useEffect(() => {}, [courseId, requestedTab]);
 
   // Stryker disable OptionalChaining -- course?.instructorEmail is more readable than course && course.instructorEmail
killedBy: InstructorCourseShowPage tests ?tab= in the URL ?tab=students opens the Students tab, and remembers it
statusReason: expected null to be 'students' // Object.is equality

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:106:9
   });
   // Remember the tab for the next time this course is opened without ?tab=
   useEffect(() => {
-    if (COURSE_TABS.includes(requestedTab)) {
+    if (false) {
       storeCourseTab(courseId, requestedTab);
     }
killedBy: InstructorCourseShowPage tests ?tab= in the URL ?tab=students opens the Students tab, and remembers it
statusReason: expected null to be 'students' // Object.is equality

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:106:9
   });
   // Remember the tab for the next time this course is opened without ?tab=
   useEffect(() => {
-    if (COURSE_TABS.includes(requestedTab)) {
+    if (true) {
       storeCourseTab(courseId, requestedTab);
     }
killedBy: InstructorCourseShowPage tests ?tab= in the URL with no ?tab=, and nothing remembered, the Assignments tab is shown and the URL is left alone
statusReason: expected 'null' to be null

[Killed] EqualityOperator
main/pages/Instructor/InstructorCourseShowPage.jsx:112:27
   }, [courseId, requestedTab]);
 
   // Stryker disable OptionalChaining -- course?.instructorEmail is more readable than course && course.instructorEmail
-  const getCourseFailed = courseBackendFailureCount > 0;
+  const getCourseFailed = courseBackendFailureCount <= 0;
   const canEditCourseOptions =
     hasRole(currentUser, "ROLE_ADMIN") ||
killedBy: StaffCourseShowPage tests returns to course list when course lookup fails
statusReason: expected "vi.fn()" to be called with arguments: [ '/', { replace: true } ]

Number of calls: 0

[Killed] EqualityOperator
main/pages/Instructor/InstructorCourseShowPage.jsx:112:27
   }, [courseId, requestedTab]);
 
   // Stryker disable OptionalChaining -- course?.instructorEmail is more readable than course && course.instructorEmail
-  const getCourseFailed = courseBackendFailureCount > 0;
+  const getCourseFailed = courseBackendFailureCount >= 0;
   const canEditCourseOptions =
     hasRole(currentUser, "ROLE_ADMIN") ||
killedBy: InstructorCourseShowPage tests renders correctly for instructor user
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-title h4"
>
  Course Not Found
</div> instead

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:114:5
   // Stryker disable OptionalChaining -- course?.instructorEmail is more readable than course && course.instructorEmail
   const getCourseFailed = courseBackendFailureCount > 0;
   const canEditCourseOptions =
-    hasRole(currentUser, "ROLE_ADMIN") ||
-    currentUser?.root?.user?.email === course?.instructorEmail;
+    true;
   // Stryker enable OptionalChaining
 
killedBy: InstructorCourseShowPage tests non-admin non-instructor cannot edit course option toggles
statusReason: expect(element).toBeDisabled()

Received element is not disabled:
  <input
  class="form-check-input"
  data-testid="CourseOptionsForm-toggle-ENABLE_CANVAS"
  id="course-option-ENABLE_CANVAS"
  type="checkbox"

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:114:5
   // Stryker disable OptionalChaining -- course?.instructorEmail is more readable than course && course.instructorEmail
   const getCourseFailed = courseBackendFailureCount > 0;
   const canEditCourseOptions =
-    hasRole(currentUser, "ROLE_ADMIN") ||
-    currentUser?.root?.user?.email === course?.instructorEmail;
+    false;
   // Stryker enable OptionalChaining
 
killedBy: InstructorCourseShowPage tests instructor assigned to course can edit course option toggles
statusReason: expect(element).not.toBeDisabled()

Received element is disabled:
  <input
  class="form-check-input"
  data-testid="CourseOptionsForm-toggle-ENABLE_CANVAS"
  disabled=""
  id="course-option-ENABLE_CANVAS"

[Killed] EqualityOperator
main/pages/Instructor/InstructorCourseShowPage.jsx:115:5
   const getCourseFailed = courseBackendFailureCount > 0;
   const canEditCourseOptions =
     hasRole(currentUser, "ROLE_ADMIN") ||
-    currentUser?.root?.user?.email === course?.instructorEmail;
+    currentUser?.root?.user?.email !== course?.instructorEmail;
   // Stryker enable OptionalChaining
 
killedBy: InstructorCourseShowPage tests instructor assigned to course can edit course option toggles
statusReason: expect(element).not.toBeDisabled()

Received element is disabled:
  <input
  class="form-check-input"
  data-testid="CourseOptionsForm-toggle-ENABLE_CANVAS"
  disabled=""
  id="course-option-ENABLE_CANVAS"

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:115:5
   const getCourseFailed = courseBackendFailureCount > 0;
   const canEditCourseOptions =
     hasRole(currentUser, "ROLE_ADMIN") ||
-    currentUser?.root?.user?.email === course?.instructorEmail;
+    false;
   // Stryker enable OptionalChaining
 
killedBy: InstructorCourseShowPage tests instructor assigned to course can edit course option toggles
statusReason: expect(element).not.toBeDisabled()

Received element is disabled:
  <input
  class="form-check-input"
  data-testid="CourseOptionsForm-toggle-ENABLE_CANVAS"
  disabled=""
  id="course-option-ENABLE_CANVAS"

[Killed] LogicalOperator
main/pages/Instructor/InstructorCourseShowPage.jsx:151:36
       <CourseWarningBanner
         courseId={courseId}
         orgName={course?.orgName}
-        hideBasePermissionWarning={course?.hideBasePermissionWarning ?? false}
+        hideBasePermissionWarning={course?.hideBasePermissionWarning && false}
       />
       {!course ? (
killedBy: InstructorCourseShowPage tests hides default base permission warning when hideBasePermissionWarning is true
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="fade alert alert-warning show"
  data-testid="CourseWarningBanner-defaultBasePermission"
  role="alert"
>
  Warning: the organization setting for Default Base Permission is not the recommended value of None. This means that students in the organization may be able to access other students' privat

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:170:32
             <div>
               <div className="d-flex align-items-center gap-2">
                 <h1
-                  data-testid={`${testId}-title`}
+                  data-testid={``}
                   className="h3 mb-0 fw-semibold"
                 >
killedBy: InstructorCourseShowPage tests renders correctly for instructor user
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BooleanLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:221:64
       )}
       <Tabs
         activeKey={activeTab}
-        onSelect={(tab) => setSearchParams({ tab }, { replace: true })}
+        onSelect={(tab) => setSearchParams({ tab }, { replace: false })}
       >
         <Tab eventKey={"students"} title={"Students"} className="pt-2">
killedBy: InstructorCourseShowPage tests ?tab= in the URL clicking a tab replaces the history entry instead of adding one
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  REPLACE
Received:
  PUSH

[Killed] ArrowFunction
main/pages/Instructor/InstructorCourseShowPage.jsx:221:19
       )}
       <Tabs
         activeKey={activeTab}
-        onSelect={(tab) => setSearchParams({ tab }, { replace: true })}
+        onSelect={() => undefined}
       >
         <Tab eventKey={"students"} title={"Students"} className="pt-2">
killedBy: InstructorCourseShowPage tests Tab assertions
statusReason: expect(element).toHaveAttribute("aria-selected", "true") // element.getAttribute("aria-selected") === "true"

Expected the element to have attribute:
  aria-selected="true"
Received:
  aria-selected="false"

[Killed] BooleanLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:230:60
             currentUser={currentUser}
             canEditStudents={canEditStudents}
             translateSections={showSectionsTab}
-            canvasEnabled={courseOptions.ENABLE_CANVAS === true}
+            canvasEnabled={courseOptions.ENABLE_CANVAS === false}
           />
         </Tab>
killedBy: InstructorCourseShowPage tests Load Students from Canvas button on the Students tab is shown when the ENABLE_CANVAS course option is enabled, and loads students for this course
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-canvas-sync-button"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>
