[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:230:28
             currentUser={currentUser}
             canEditStudents={canEditStudents}
             translateSections={showSectionsTab}
-            canvasEnabled={courseOptions.ENABLE_CANVAS === true}
+            canvasEnabled={true}
           />
         </Tab>
killedBy: InstructorCourseShowPage tests Load Students from Canvas button on the Students tab is not shown when the ENABLE_CANVAS course option is disabled
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="w-100 btn btn-primary"
  data-testid="InstructorCourseShowPage-canvas-sync-button"
  type="button"
>
  Load Students from Canvas

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:241:40
             isInstructor={staffTabIsInstructor}
           />
         </Tab>
-        <Tab eventKey={"teams"} title={"Teams"} className="pt-2">
+        <Tab eventKey={"teams"} title={""} className="pt-2">
           <TeamsTabComponent
             courseId={courseId}
killedBy: InstructorCourseShowPage tests Tab assertions
statusReason: Unable to find an accessible element with the role "tab" and name "Teams"

Here are the accessible roles:

  navigation:

  Name "":
  <nav

[Killed] LogicalOperator
main/pages/Instructor/InstructorCourseShowPage.jsx:249:10
             canManageTeams={canManageTeams}
           />
         </Tab>
-        {showSectionsTab && (
-          <Tab eventKey={"sections"} title={"Sections"} className="pt-2">
-            <SectionsTabComponent courseId={courseId} testIdPrefix={testId} />
-          </Tab>
-        )}
+        {showSectionsTab || <Tab eventKey={"sections"} title={"Sections"} className="pt-2">
+            <SectionsTabComponent courseId={courseId} testIdPrefix={testId} />
+          </Tab>}
         <Tab eventKey={"assignments"} title={"Assignments"} className="pt-2">
           <AssignmentTabComponent
killedBy: InstructorCourseShowPage tests shows the Sections tab when TRANSLATE_SECTIONS option is enabled
statusReason: expect(element).toHaveAttribute("aria-selected", "true") // element.getAttribute("aria-selected") === "true"

Expected the element to have attribute:
  aria-selected="true"
Received:
  aria-selected="false"

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:249:10
             canManageTeams={canManageTeams}
           />
         </Tab>
-        {showSectionsTab && (
-          <Tab eventKey={"sections"} title={"Sections"} className="pt-2">
-            <SectionsTabComponent courseId={courseId} testIdPrefix={testId} />
-          </Tab>
-        )}
+        {true}
         <Tab eventKey={"assignments"} title={"Assignments"} className="pt-2">
           <AssignmentTabComponent
killedBy: InstructorCourseShowPage tests shows the Sections tab when TRANSLATE_SECTIONS option is enabled
statusReason: Unable to find role="tab" and name "Sections"

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:250:26
           />
         </Tab>
         {showSectionsTab && (
-          <Tab eventKey={"sections"} title={"Sections"} className="pt-2">
+          <Tab eventKey={""} title={"Sections"} className="pt-2">
             <SectionsTabComponent courseId={courseId} testIdPrefix={testId} />
           </Tab>
killedBy: InstructorCourseShowPage tests shows the Sections tab when TRANSLATE_SECTIONS option is enabled
statusReason: expect(element).toHaveAttribute("data-rr-ui-event-key", "sections") // element.getAttribute("data-rr-ui-event-key") === "sections"

Expected the element to have attribute:
  data-rr-ui-event-key="sections"
Received:
  data-rr-ui-event-key=""

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:250:45
           />
         </Tab>
         {showSectionsTab && (
-          <Tab eventKey={"sections"} title={"Sections"} className="pt-2">
+          <Tab eventKey={"sections"} title={""} className="pt-2">
             <SectionsTabComponent courseId={courseId} testIdPrefix={testId} />
           </Tab>
killedBy: InstructorCourseShowPage tests shows the Sections tab when TRANSLATE_SECTIONS option is enabled
statusReason: Unable to find role="tab" and name "Sections"

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:254:46
             <SectionsTabComponent courseId={courseId} testIdPrefix={testId} />
           </Tab>
         )}
-        <Tab eventKey={"assignments"} title={"Assignments"} className="pt-2">
+        <Tab eventKey={"assignments"} title={""} className="pt-2">
           <AssignmentTabComponent
             courseId={courseId}
killedBy: InstructorCourseShowPage tests Tab assertions
statusReason: Unable to find an element with the text: Assignments. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:261:10
             currentUser={currentUser}
           />
         </Tab>
-        {showNewAssignmentsTab && (
-          <Tab
-            eventKey={"new-assignments"}
-            title={"New Assignments"}
-            className="pt-2"
-          >
-            <NewAssignmentsTabComponent
-              courseId={courseId}
-              testIdPrefix={testId}
-            />
-          </Tab>
-        )}
+        {false}
         <Tab eventKey={"jobs"} title={"Jobs"} className="pt-2">
           <JobTabComponent courseId={courseId} testIdPrefix={testId} />
killedBy: InstructorCourseShowPage tests New Assignments tab is shown, right after Assignments, when the NEW_ASSIGNMENT_FEATURES option is enabled
statusReason: Unable to find role="tab" and name "New Assignments"

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:261:10
             currentUser={currentUser}
           />
         </Tab>
-        {showNewAssignmentsTab && (
-          <Tab
-            eventKey={"new-assignments"}
-            title={"New Assignments"}
-            className="pt-2"
-          >
-            <NewAssignmentsTabComponent
-              courseId={courseId}
-              testIdPrefix={testId}
-            />
-          </Tab>
-        )}
+        {true}
         <Tab eventKey={"jobs"} title={"Jobs"} className="pt-2">
           <JobTabComponent courseId={courseId} testIdPrefix={testId} />
killedBy: InstructorCourseShowPage tests New Assignments tab is shown, right after Assignments, when the NEW_ASSIGNMENT_FEATURES option is enabled
statusReason: Unable to find role="tab" and name "New Assignments"

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] StringLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:273:24
             />
           </Tab>
         )}
-        <Tab eventKey={"jobs"} title={"Jobs"} className="pt-2">
+        <Tab eventKey={""} title={"Jobs"} className="pt-2">
           <JobTabComponent courseId={courseId} testIdPrefix={testId} />
         </Tab>
killedBy: InstructorCourseShowPage tests Tab assertions
statusReason: expect(element).toHaveAttribute("data-rr-ui-event-key", "jobs") // element.getAttribute("data-rr-ui-event-key") === "jobs"

Expected the element to have attribute:
  data-rr-ui-event-key="jobs"
Received:
  data-rr-ui-event-key=""

[Killed] LogicalOperator
main/pages/Instructor/InstructorCourseShowPage.jsx:279:10
         <Tab eventKey={"downloads"} title={"Downloads"} className="pt-2">
           <DownloadsTabComponent courseId={courseId} testIdPrefix={testId} />
         </Tab>
-        {showDokkuTab && (
-          <Tab eventKey={"dokku"} title={"Dokku"} className="pt-2">
-            <DokkuTabComponent courseId={courseId} testIdPrefix={testId} />
-          </Tab>
-        )}
+        {showDokkuTab || <Tab eventKey={"dokku"} title={"Dokku"} className="pt-2">
+            <DokkuTabComponent courseId={courseId} testIdPrefix={testId} />
+          </Tab>}
         {showSlackTab && (
           <Tab
killedBy: InstructorCourseShowPage tests New Assignments tab is shown, right after Assignments, when the NEW_ASSIGNMENT_FEATURES option is enabled
statusReason: expected [ 'Students', 'Staff', 'Teams', …(6) ] to deeply equal [ 'Students', 'Staff', 'Teams', …(5) ]

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:279:10
         <Tab eventKey={"downloads"} title={"Downloads"} className="pt-2">
           <DownloadsTabComponent courseId={courseId} testIdPrefix={testId} />
         </Tab>
-        {showDokkuTab && (
-          <Tab eventKey={"dokku"} title={"Dokku"} className="pt-2">
-            <DokkuTabComponent courseId={courseId} testIdPrefix={testId} />
-          </Tab>
-        )}
+        {true}
         {showSlackTab && (
           <Tab
killedBy: InstructorCourseShowPage tests Dokku tab is shown, between Downloads and Settings, when the DOKKU_MANAGER option is enabled
statusReason: Unable to find role="tab" and name "Dokku"

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:284:10
             <DokkuTabComponent courseId={courseId} testIdPrefix={testId} />
           </Tab>
         )}
-        {showSlackTab && (
-          <Tab
-            eventKey={"slack"}
-            title={"Slack"}
-            className="pt-2"
-            mountOnEnter={true}
-          >
-            <SlackTabComponent
-              courseId={courseId}
-              testIdPrefix={testId}
-              slackTeamName={slackInfo.slackTeamName}
-              slackTeamUrl={slackInfo.slackTeamUrl}
-              showSectionChannels={showSectionsTab}
-            />
-          </Tab>
-        )}
+        {false}
         {showSettingsTab && (
           <Tab eventKey={"settings"} title={"Settings"} className="pt-2">
killedBy: InstructorCourseShowPage tests shows the Slack tab when SLACK_INTEGRATION is enabled and a token is set; loads Slack data only when the tab is opened
statusReason: Unable to find role="tab" and name "Slack"

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:284:10
             <DokkuTabComponent courseId={courseId} testIdPrefix={testId} />
           </Tab>
         )}
-        {showSlackTab && (
-          <Tab
-            eventKey={"slack"}
-            title={"Slack"}
-            className="pt-2"
-            mountOnEnter={true}
-          >
-            <SlackTabComponent
-              courseId={courseId}
-              testIdPrefix={testId}
-              slackTeamName={slackInfo.slackTeamName}
-              slackTeamUrl={slackInfo.slackTeamUrl}
-              showSectionChannels={showSectionsTab}
-            />
-          </Tab>
-        )}
+        {true}
         {showSettingsTab && (
           <Tab eventKey={"settings"} title={"Settings"} className="pt-2">
killedBy: InstructorCourseShowPage tests shows the Slack tab when SLACK_INTEGRATION is enabled and a token is set; loads Slack data only when the tab is opened
statusReason: Unable to find role="tab" and name "Slack"

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] BooleanLiteral
main/pages/Instructor/InstructorCourseShowPage.jsx:289:27
             eventKey={"slack"}
             title={"Slack"}
             className="pt-2"
-            mountOnEnter={true}
+            mountOnEnter={false}
           >
             <SlackTabComponent
killedBy: InstructorCourseShowPage tests shows the Slack tab when SLACK_INTEGRATION is enabled and a token is set; loads Slack data only when the tab is opened
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  data-testid="InstructorCourseShowPage-slack-tab-component"
>
  <p
    class="fs-5"
  >

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:300:10
             />
           </Tab>
         )}
-        {showSettingsTab && (
-          <Tab eventKey={"settings"} title={"Settings"} className="pt-2">
-            <SettingsTabComponent
-              courseId={courseId}
-              testIdPrefix={testId}
-              canEditCourseOptions={canEditCourseOptions}
-            />
-          </Tab>
-        )}
+        {false}
       </Tabs>
     </BasicLayout>
killedBy: InstructorCourseShowPage tests Tab assertions
statusReason: Unable to find an element with the text: Settings. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ConditionalExpression
main/pages/Instructor/InstructorCourseShowPage.jsx:300:10
             />
           </Tab>
         )}
-        {showSettingsTab && (
-          <Tab eventKey={"settings"} title={"Settings"} className="pt-2">
-            <SettingsTabComponent
-              courseId={courseId}
-              testIdPrefix={testId}
-              canEditCourseOptions={canEditCourseOptions}
-            />
-          </Tab>
-        )}
+        {true}
       </Tabs>
     </BasicLayout>
killedBy: InstructorCourseShowPage tests Tab assertions
statusReason: Unable to find an element with the text: Settings. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>
