[Killed] BlockStatement
main/components/Jobs/JobLogModal.jsx:15:4
   courseId,
   jobId,
   testIdPrefix = "JobLogModal",
-}) {
-  return (
-    <Modal
-      show={show}
-      onHide={onHide}
-      size="lg"
-      centered={true}
-      data-testid={testIdPrefix}
-    >
-      <Modal.Header closeButton>
-        <Modal.Title>Job {jobId} Log</Modal.Title>
-      </Modal.Header>
-      <Modal.Body>
-        <JobLogTail
-          courseId={courseId}
-          jobId={jobId}
-          testIdPrefix={`${testIdPrefix}-tail`}
-        />
-      </Modal.Body>
-    </Modal>
-  );
-}
+}) {}
 
killedBy: NewAssignmentsTable tests clicking the last job shows its log in a modal, following the job, and the modal can be closed
statusReason: Unable to find an element with the text: Job 12 Log. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="NewAssignmentsTable"

[Timeout] BooleanLiteral
main/components/Jobs/JobLogModal.jsx:21:17
       show={show}
       onHide={onHide}
       size="lg"
-      centered={true}
+      centered={false}
       data-testid={testIdPrefix}
     >
