[Timeout] BlockStatement
main/components/Jobs/JobLogTail.jsx:23:19
   const logRef = useRef(null);
 
   // follow the end of the log as it grows
-  useEffect(() => {
-    logRef.current.scrollTop = logRef.current.scrollHeight;
-  }, [lines]);
+  useEffect(() => {}, [lines]);
 
   let statusText;

[Timeout] ConditionalExpression
main/components/Jobs/JobLogTail.jsx:28:7
   }, [lines]);
 
   let statusText;
-  if (error) {
+  if (true) {
     statusText = "The log could not be loaded.";
   } else if (status === null) {

[Timeout] ConditionalExpression
main/components/Jobs/JobLogTail.jsx:28:7
   }, [lines]);
 
   let statusText;
-  if (error) {
+  if (false) {
     statusText = "The log could not be loaded.";
   } else if (status === null) {

[Timeout] StringLiteral
main/components/Jobs/JobLogTail.jsx:29:18
 
   let statusText;
   if (error) {
-    statusText = "The log could not be loaded.";
+    statusText = "";
   } else if (status === null) {
     statusText = "Loading the log...";

[Timeout] BlockStatement
main/components/Jobs/JobLogTail.jsx:30:31
   let statusText;
   if (error) {
     statusText = "The log could not be loaded.";
-  } else if (status === null) {
-    statusText = "Loading the log...";
-  } else if (isJobFinished(status)) {
+  } else if (status === null) {} else if (isJobFinished(status)) {
     statusText = "The job is over, so the log will not change any more.";
   } else {

[Timeout] ConditionalExpression
main/components/Jobs/JobLogTail.jsx:30:14
   let statusText;
   if (error) {
     statusText = "The log could not be loaded.";
-  } else if (status === null) {
+  } else if (true) {
     statusText = "Loading the log...";
   } else if (isJobFinished(status)) {

[Timeout] ConditionalExpression
main/components/Jobs/JobLogTail.jsx:32:14
     statusText = "The log could not be loaded.";
   } else if (status === null) {
     statusText = "Loading the log...";
-  } else if (isJobFinished(status)) {
+  } else if (true) {
     statusText = "The job is over, so the log will not change any more.";
   } else {

[Timeout] ConditionalExpression
main/components/Jobs/JobLogTail.jsx:32:14
     statusText = "The log could not be loaded.";
   } else if (status === null) {
     statusText = "Loading the log...";
-  } else if (isJobFinished(status)) {
+  } else if (false) {
     statusText = "The job is over, so the log will not change any more.";
   } else {

[Timeout] StringLiteral
main/components/Jobs/JobLogTail.jsx:33:18
   } else if (status === null) {
     statusText = "Loading the log...";
   } else if (isJobFinished(status)) {
-    statusText = "The job is over, so the log will not change any more.";
+    statusText = "";
   } else {
     statusText = `Checking for new lines every ${JOB_LOG_POLL_INTERVAL_SECONDS} seconds.`;

[Timeout] BlockStatement
main/components/Jobs/JobLogTail.jsx:34:10
     statusText = "Loading the log...";
   } else if (isJobFinished(status)) {
     statusText = "The job is over, so the log will not change any more.";
-  } else {
-    statusText = `Checking for new lines every ${JOB_LOG_POLL_INTERVAL_SECONDS} seconds.`;
-  }
+  } else {}
 
   return (

[Timeout] EqualityOperator
main/components/Jobs/JobLogTail.jsx:42:10
     <div data-testid={testIdPrefix}>
       <p data-testid={`${testIdPrefix}-status`}>
         Job {jobId}
-        {status !== null && (
+        {status === null && (
           <>
             {" "}

[Timeout] ConditionalExpression
main/components/Jobs/JobLogTail.jsx:42:10
     <div data-testid={testIdPrefix}>
       <p data-testid={`${testIdPrefix}-status`}>
         Job {jobId}
-        {status !== null && (
-          <>
-            {" "}
-            <Badge bg="secondary" data-testid={`${testIdPrefix}-status-badge`}>
-              {status}
-            </Badge>
-          </>
-        )}
+        {false}
         {" — "}
         <span data-testid={`${testIdPrefix}-status-text`}>{statusText}</span>

[Timeout] StringLiteral
main/components/Jobs/JobLogTail.jsx:50:10
             </Badge>
           </>
         )}
-        {" — "}
+        {""}
         <span data-testid={`${testIdPrefix}-status-text`}>{statusText}</span>
       </p>

[Timeout] ObjectLiteral
main/components/Jobs/JobLogTail.jsx:56:16
       <pre
         ref={logRef}
         data-testid={`${testIdPrefix}-log`}
-        style={{
-          backgroundColor: "black",
-          color: "white",
-          fontFamily: "monospace",
-          maxHeight: "60vh",
-          overflowY: "auto",
-          whiteSpace: "pre-wrap",
-          padding: "0.75rem",
-        }}
+        style={{}}
       >
         {lines.length === 0 ? "No log lines yet." : lines.join("\n")}

[Timeout] StringLiteral
main/components/Jobs/JobLogTail.jsx:58:18
         data-testid={`${testIdPrefix}-log`}
         style={{
           backgroundColor: "black",
-          color: "white",
+          color: "",
           fontFamily: "monospace",
           maxHeight: "60vh",

[Timeout] StringLiteral
main/components/Jobs/JobLogTail.jsx:62:23
           fontFamily: "monospace",
           maxHeight: "60vh",
           overflowY: "auto",
-          whiteSpace: "pre-wrap",
+          whiteSpace: "",
           padding: "0.75rem",
         }}

[Timeout] StringLiteral
main/components/Jobs/JobLogTail.jsx:63:20
           maxHeight: "60vh",
           overflowY: "auto",
           whiteSpace: "pre-wrap",
-          padding: "0.75rem",
+          padding: "",
         }}
       >

[Killed] EqualityOperator
main/components/Jobs/JobLogTail.jsx:66:10
           padding: "0.75rem",
         }}
       >
-        {lines.length === 0 ? "No log lines yet." : lines.join("\n")}
+        {lines.length !== 0 ? "No log lines yet." : lines.join("\n")}
       </pre>
     </div>
killedBy: NewAssignmentsTable tests clicking the last job shows its log in a modal, following the job, and the modal can be closed
statusReason: Unable to find an element with the text: /Creating lab01-cgaucho/, which matches selector 'pre'. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 10

[Timeout] ConditionalExpression
main/components/Jobs/JobLogTail.jsx:66:10
           padding: "0.75rem",
         }}
       >
-        {lines.length === 0 ? "No log lines yet." : lines.join("\n")}
+        {true ? "No log lines yet." : lines.join("\n")}
       </pre>
     </div>
