[Killed] BooleanLiteral
main/components/NewAssignments/NewAssignmentsTable.jsx:34:58
 }) {
   const [showEditModal, setShowEditModal] = useState(false);
   const [editAssignment, setEditAssignment] = useState(null);
-  const [showDeleteModal, setShowDeleteModal] = useState(false);
+  const [showDeleteModal, setShowDeleteModal] = useState(true);
   const [deleteAssignment, setDeleteAssignment] = useState(null);
   const [showLogModal, setShowLogModal] = useState(false);
killedBy: NewAssignmentsTable tests renders headers, rows with readable labels, and buttons
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="ConfirmationModal-base"
>
  <div
    class="modal-content"

[Killed] BooleanLiteral
main/components/NewAssignments/NewAssignmentsTable.jsx:36:52
   const [editAssignment, setEditAssignment] = useState(null);
   const [showDeleteModal, setShowDeleteModal] = useState(false);
   const [deleteAssignment, setDeleteAssignment] = useState(null);
-  const [showLogModal, setShowLogModal] = useState(false);
+  const [showLogModal, setShowLogModal] = useState(true);
   const [logJobId, setLogJobId] = useState(null);
 
killedBy: NewAssignmentsTabComponent tests the create modal can be closed, and reopened for the other kind of assignment
statusReason: Found multiple elements with the text of: Close

Here are the matching elements:

Ignored nodes: comments, script, style
<button
  aria-label="Close"
  class="btn-close"

[Killed] ArrowFunction
main/components/NewAssignments/NewAssignmentsTable.jsx:40:33
   const [logJobId, setLogJobId] = useState(null);
 
   // The type of an assignment cannot be changed, so it is not sent when editing
-  const cellToAxiosParamsEdit = (formData) => ({
-    url: `${NEW_ASSIGNMENTS_URL}/put`,
-    method: "PUT",
-    params: {
-      courseId: courseId,
-      assignmentId: editAssignment.id,
-      ...formDataToParams(editAssignment.asnType, formData),
-    },
-  });
+  const cellToAxiosParamsEdit = () => undefined;
 
   const cellToAxiosParamsDelete = (assignment) => ({
killedBy: NewAssignmentsTabComponent tests editing an assignment through the table refetches the list
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] StringLiteral
main/components/NewAssignments/NewAssignmentsTable.jsx:41:10
 
   // The type of an assignment cannot be changed, so it is not sent when editing
   const cellToAxiosParamsEdit = (formData) => ({
-    url: `${NEW_ASSIGNMENTS_URL}/put`,
+    url: ``,
     method: "PUT",
     params: {
killedBy: NewAssignmentsTable tests submitting the individual edit sends PUT without the type, toasts the job, and closes the modal
statusReason: expected '' to be '/api/assignments/put' // Object.is equality

[Killed] ArrowFunction
main/components/NewAssignments/NewAssignmentsTable.jsx:50:35
     },
   });
 
-  const cellToAxiosParamsDelete = (assignment) => ({
-    url: `${NEW_ASSIGNMENTS_URL}/${assignment.id}`,
-    method: "DELETE",
-    params: { courseId: courseId },
-  });
+  const cellToAxiosParamsDelete = () => undefined;
 
   const cellToAxiosParamsLaunch = (assignment) => ({
killedBy: NewAssignmentsTable tests delete asks for confirmation, then sends DELETE and toasts
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] StringLiteral
main/components/NewAssignments/NewAssignmentsTable.jsx:52:13
 
   const cellToAxiosParamsDelete = (assignment) => ({
     url: `${NEW_ASSIGNMENTS_URL}/${assignment.id}`,
-    method: "DELETE",
+    method: "",
     params: { courseId: courseId },
   });
killedBy: NewAssignmentsTabComponent tests deleting an assignment through the table refetches the list, but not the jobs
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] ArrowFunction
main/components/NewAssignments/NewAssignmentsTable.jsx:56:35
     params: { courseId: courseId },
   });
 
-  const cellToAxiosParamsLaunch = (assignment) => ({
-    url: `${NEW_ASSIGNMENTS_URL}/launch`,
-    method: "POST",
-    params: { courseId: courseId, assignmentId: assignment.id },
-  });
+  const cellToAxiosParamsLaunch = () => undefined;
 
   const onLaunchSuccess = (data) => {
killedBy: NewAssignmentsTable tests Refresh starts the job of the assignment, and says which job
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] StringLiteral
main/components/NewAssignments/NewAssignmentsTable.jsx:58:13
 
   const cellToAxiosParamsLaunch = (assignment) => ({
     url: `${NEW_ASSIGNMENTS_URL}/launch`,
-    method: "POST",
+    method: "",
     params: { courseId: courseId, assignmentId: assignment.id },
   });
killedBy: NewAssignmentsTable tests Refresh starts the job of the assignment, and says which job
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Timeout] BlockStatement
main/components/NewAssignments/NewAssignmentsTable.jsx:62:37
     params: { courseId: courseId, assignmentId: assignment.id },
   });
 
-  const onLaunchSuccess = (data) => {
-    toast(jobLaunchedMessage(data));
-  };
+  const onLaunchSuccess = (data) => {};
 
   const onEditSuccess = (data) => {

[Killed] BlockStatement
main/components/NewAssignments/NewAssignmentsTable.jsx:66:35
     toast(jobLaunchedMessage(data));
   };
 
-  const onEditSuccess = (data) => {
-    toast(jobStartedMessage("updated", data));
-    setShowEditModal(false);
-  };
+  const onEditSuccess = (data) => {};
 
   const onDeleteSuccess = () => {
killedBy: NewAssignmentsTable tests submitting the individual edit sends PUT without the type, toasts the job, and closes the modal
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BooleanLiteral
main/components/NewAssignments/NewAssignmentsTable.jsx:68:22
 
   const onEditSuccess = (data) => {
     toast(jobStartedMessage("updated", data));
-    setShowEditModal(false);
+    setShowEditModal(true);
   };
 
killedBy: NewAssignmentsTable tests submitting the individual edit sends PUT without the type, toasts the job, and closes the modal
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-body"
  data-testid="NewAssignmentsTable-edit-modal-body"
>
  <p
    data-testid="NewAssignmentsTable-edit-modal-note"

[Timeout] BlockStatement
main/components/NewAssignments/NewAssignmentsTable.jsx:71:33
     setShowEditModal(false);
   };
 
-  const onDeleteSuccess = () => {
-    toast("Assignment deleted successfully.");
-  };
+  const onDeleteSuccess = () => {};
 
   const editMutation = useBackendMutation(

[Killed] ArrayDeclaration
main/components/NewAssignments/NewAssignmentsTable.jsx:84:5
   const launchMutation = useBackendMutation(
     cellToAxiosParamsLaunch,
     { onSuccess: onLaunchSuccess, onError: onAssignmentMutationError },
-    [assignmentsQueryKey(courseId), JOBS_QUERY_KEY],
+    [],
   );
 
killedBy: NewAssignmentsTabComponent tests refreshing an assignment through the table refetches the list, so the new job shows, and the jobs
statusReason: expected 1 to be 2 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] ObjectLiteral
main/components/NewAssignments/NewAssignmentsTable.jsx:89:5
 
   const deleteMutation = useBackendMutation(
     cellToAxiosParamsDelete,
-    { onSuccess: onDeleteSuccess, onError: onAssignmentMutationError },
+    {},
     [assignmentsQueryKey(courseId)],
   );
killedBy: NewAssignmentsTable tests delete asks for confirmation, then sends DELETE and toasts
statusReason: expected "vi.fn()" to be called with arguments: [ 'Assignment deleted successfully.' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/components/NewAssignments/NewAssignmentsTable.jsx:93:36
     [assignmentsQueryKey(courseId)],
   );
 
-  const launchCallback = (cell) => {
-    launchMutation.mutate(cell.row.original);
-  };
+  const launchCallback = (cell) => {};
 
   const showLog = (jobId) => {
killedBy: NewAssignmentsTable tests Refresh starts the job of the assignment, and says which job
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] BlockStatement
main/components/NewAssignments/NewAssignmentsTable.jsx:97:30
     launchMutation.mutate(cell.row.original);
   };
 
-  const showLog = (jobId) => {
-    setLogJobId(jobId);
-    setShowLogModal(true);
-  };
+  const showLog = (jobId) => {};
 
   const editCallback = (cell) => {
killedBy: NewAssignmentsTable tests clicking the last job shows its log in a modal, following the job, and the modal can be closed
statusReason: Unable to find an element with the text: Job 12 Log. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="NewAssignmentsTable"

[Killed] BooleanLiteral
main/components/NewAssignments/NewAssignmentsTable.jsx:99:21
 
   const showLog = (jobId) => {
     setLogJobId(jobId);
-    setShowLogModal(true);
+    setShowLogModal(false);
   };
 
killedBy: NewAssignmentsTable tests clicking the last job shows its log in a modal, following the job, and the modal can be closed
statusReason: Unable to find an element with the text: Job 12 Log. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="NewAssignmentsTable"

[Killed] BlockStatement
main/components/NewAssignments/NewAssignmentsTable.jsx:102:34
     setShowLogModal(true);
   };
 
-  const editCallback = (cell) => {
-    setEditAssignment(cell.row.original);
-    setShowEditModal(true);
-  };
+  const editCallback = (cell) => {};
 
   const deleteCallback = (cell) => {
killedBy: NewAssignmentsTable tests editing an individual assignment opens the individual form, prefilled, without a way to change the type
statusReason: Unable to find an element by: [data-testid="NewAssignmentsTable-edit-modal-body"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] BooleanLiteral
main/components/NewAssignments/NewAssignmentsTable.jsx:104:22
 
   const editCallback = (cell) => {
     setEditAssignment(cell.row.original);
-    setShowEditModal(true);
+    setShowEditModal(false);
   };
 
killedBy: NewAssignmentsTable tests editing an individual assignment opens the individual form, prefilled, without a way to change the type
statusReason: Unable to find an element by: [data-testid="NewAssignmentsTable-edit-modal-body"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] BlockStatement
main/components/NewAssignments/NewAssignmentsTable.jsx:107:36
     setShowEditModal(true);
   };
 
-  const deleteCallback = (cell) => {
-    setDeleteAssignment(cell.row.original);
-    setShowDeleteModal(true);
-  };
+  const deleteCallback = (cell) => {};
 
   const submitEditForm = (data) => {
killedBy: NewAssignmentsTabComponent tests deleting an assignment through the table refetches the list, but not the jobs
statusReason: Unable to find an element by: [data-testid="ConfirmationModal-base"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] BooleanLiteral
main/components/NewAssignments/NewAssignmentsTable.jsx:109:24
 
   const deleteCallback = (cell) => {
     setDeleteAssignment(cell.row.original);
-    setShowDeleteModal(true);
+    setShowDeleteModal(false);
   };
 
killedBy: NewAssignmentsTable tests delete asks for confirmation, then sends DELETE and toasts
statusReason: Unable to find an element by: [data-testid="ConfirmationModal-base"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] BlockStatement
main/components/NewAssignments/NewAssignmentsTable.jsx:116:31
     editMutation.mutate(data);
   };
 
-  const confirmDelete = () => {
-    deleteMutation.mutate(deleteAssignment);
-  };
+  const confirmDelete = () => {};
 
   const columns = [
killedBy: NewAssignmentsTable tests delete asks for confirmation, then sends DELETE and toasts
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] ObjectLiteral
main/components/NewAssignments/NewAssignmentsTable.jsx:121:5
   };
 
   const columns = [
-    {
-      header: "Repository Prefix",
-      accessorKey: "repoPrefix",
-      id: "repoPrefix",
-    },
+    {},
     {
       header: "Type",
killedBy: InstructorCourseShowPage tests New Assignments tab is shown, right after Assignments, when the NEW_ASSIGNMENT_FEATURES option is enabled
statusReason: Unable to find role="tab" and name "New Assignments"

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div />

[Killed] StringLiteral
main/components/NewAssignments/NewAssignmentsTable.jsx:122:15
 
   const columns = [
     {
-      header: "Repository Prefix",
+      header: "",
       accessorKey: "repoPrefix",
       id: "repoPrefix",
killedBy: NewAssignmentsTable tests renders headers, rows with readable labels, and buttons
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Repository Prefix
Received:

[Killed] StringLiteral
main/components/NewAssignments/NewAssignmentsTable.jsx:127:15
       id: "repoPrefix",
     },
     {
-      header: "Type",
+      header: "",
       accessorFn: (row) => ASSIGNMENT_TYPE_LABELS[row.asnType],
       id: "asnType",
killedBy: NewAssignmentsTable tests renders headers, rows with readable labels, and buttons
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Type
Received:

[Killed] ArrowFunction
main/components/NewAssignments/NewAssignmentsTable.jsx:128:19
     },
     {
       header: "Type",
-      accessorFn: (row) => ASSIGNMENT_TYPE_LABELS[row.asnType],
+      accessorFn: () => undefined,
       id: "asnType",
     },
killedBy: NewAssignmentsTable tests renders headers, rows with readable labels, and buttons
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Individual
Received:

[Killed] ArrowFunction
main/components/NewAssignments/NewAssignmentsTable.jsx:133:19
     },
     {
       header: "Visibility",
-      accessorFn: (row) => VISIBILITY_LABELS[row.visibility],
+      accessorFn: () => undefined,
       id: "visibility",
     },
killedBy: NewAssignmentsTable tests renders headers, rows with readable labels, and buttons
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Public
Received:

[Killed] StringLiteral
main/components/NewAssignments/NewAssignmentsTable.jsx:134:11
     {
       header: "Visibility",
       accessorFn: (row) => VISIBILITY_LABELS[row.visibility],
-      id: "visibility",
+      id: "",
     },
     {
killedBy: InstructorCourseShowPage tests New Assignments tab is shown, right after Assignments, when the NEW_ASSIGNMENT_FEATURES option is enabled
statusReason: Unable to find role="tab" and name "New Assignments"

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div />

[Killed] ArrowFunction
main/components/NewAssignments/NewAssignmentsTable.jsx:138:19
     },
     {
       header: "Permission",
-      accessorFn: (row) => PERMISSION_LABELS[row.permission],
+      accessorFn: () => undefined,
       id: "permission",
     },
killedBy: NewAssignmentsTable tests renders headers, rows with readable labels, and buttons
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Maintain
Received:

[Killed] StringLiteral
main/components/NewAssignments/NewAssignmentsTable.jsx:139:11
     {
       header: "Permission",
       accessorFn: (row) => PERMISSION_LABELS[row.permission],
-      id: "permission",
+      id: "",
     },
     {
killedBy: InstructorCourseShowPage tests New Assignments tab is shown, right after Assignments, when the NEW_ASSIGNMENT_FEATURES option is enabled
statusReason: Unable to find role="tab" and name "New Assignments"

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div />

[Killed] StringLiteral
main/components/NewAssignments/NewAssignmentsTable.jsx:142:15
       id: "permission",
     },
     {
-      header: "Repositories For",
+      header: "",
       accessorFn: (row) => CREATE_REPOS_FOR_LABELS[row.createReposFor] ?? "",
       id: "createReposFor",
killedBy: NewAssignmentsTable tests renders headers, rows with readable labels, and buttons
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Repositories For
Received:

[Killed] ArrowFunction
main/components/NewAssignments/NewAssignmentsTable.jsx:143:19
     },
     {
       header: "Repositories For",
-      accessorFn: (row) => CREATE_REPOS_FOR_LABELS[row.createReposFor] ?? "",
+      accessorFn: () => undefined,
       id: "createReposFor",
     },
killedBy: NewAssignmentsTable tests renders headers, rows with readable labels, and buttons
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Students Only
Received:

[Killed] LogicalOperator
main/components/NewAssignments/NewAssignmentsTable.jsx:143:28
     },
     {
       header: "Repositories For",
-      accessorFn: (row) => CREATE_REPOS_FOR_LABELS[row.createReposFor] ?? "",
+      accessorFn: (row) => CREATE_REPOS_FOR_LABELS[row.createReposFor] && "",
       id: "createReposFor",
     },
killedBy: NewAssignmentsTable tests renders headers, rows with readable labels, and buttons
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Students Only
Received:

[Killed] LogicalOperator
main/components/NewAssignments/NewAssignmentsTable.jsx:148:28
     },
     {
       header: "Team Regex",
-      accessorFn: (row) => row.teamRegex ?? "",
+      accessorFn: (row) => row.teamRegex && "",
       id: "teamRegex",
     },
killedBy: NewAssignmentsTabComponent tests renders the two create buttons and the assignments from the backend
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  s26-.*
Received:

[Killed] ArrowFunction
main/components/NewAssignments/NewAssignmentsTable.jsx:148:19
     },
     {
       header: "Team Regex",
-      accessorFn: (row) => row.teamRegex ?? "",
+      accessorFn: () => undefined,
       id: "teamRegex",
     },
killedBy: NewAssignmentsTable tests renders headers, rows with readable labels, and buttons
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  s26-.*
Received:

[Killed] BlockStatement
main/components/NewAssignments/NewAssignmentsTable.jsx:156:27
       accessorKey: "lastJobId",
       id: "lastJobId",
       // the number of the job is a link that shows the log of the job in a modal
-      cell: ({ cell }) => {
-        const jobId = cell.getValue();
-        if (jobId === null) {
-          return "";
-        }
-        return (
-          <a
-            href={jobLogPagePath(courseId, jobId)}
-            onClick={(event) => {
-              event.preventDefault();
-              showLog(jobId);
-            }}
-            data-testid={`${testIdPrefix}-cell-row-${cell.row.index}-col-lastJobId-link`}
-          >
-            {jobId}
-          </a>
-        );
-      },
+      cell: ({ cell }) => {},
     },
     ButtonColumn("Refresh", "success", launchCallback, testIdPrefix),
killedBy: NewAssignmentsTable tests renders headers, rows with readable labels, and buttons
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  12
Received:

[Killed] EqualityOperator
main/components/NewAssignments/NewAssignmentsTable.jsx:158:13
       // the number of the job is a link that shows the log of the job in a modal
       cell: ({ cell }) => {
         const jobId = cell.getValue();
-        if (jobId === null) {
+        if (jobId !== null) {
           return "";
         }
killedBy: NewAssignmentsTable tests renders headers, rows with readable labels, and buttons
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  12
Received:

[Killed] BlockStatement
main/components/NewAssignments/NewAssignmentsTable.jsx:158:29
       // the number of the job is a link that shows the log of the job in a modal
       cell: ({ cell }) => {
         const jobId = cell.getValue();
-        if (jobId === null) {
-          return "";
-        }
+        if (jobId === null) {}
         return (
           <a
killedBy: NewAssignmentsTable tests the last job is a link to the log of the job, for the assignments that have one
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a
  data-testid="NewAssignmentsTable-cell-row-1-col-lastJobId-link"
  href="/instructor/courses/1/jobs/null/logs"
/> instead

[Killed] StringLiteral
main/components/NewAssignments/NewAssignmentsTable.jsx:159:18
       cell: ({ cell }) => {
         const jobId = cell.getValue();
         if (jobId === null) {
-          return "";
+          return "Stryker was here!";
         }
         return (
killedBy: NewAssignmentsTable tests renders headers, rows with readable labels, and buttons
statusReason: expect(element).toHaveTextContent()

Checking with empty string will always match, use .toBeEmptyDOMElement() instead:

Received:
  Stryker was here!

[Killed] BlockStatement
main/components/NewAssignments/NewAssignmentsTable.jsx:164:33
         return (
           <a
             href={jobLogPagePath(courseId, jobId)}
-            onClick={(event) => {
-              event.preventDefault();
-              showLog(jobId);
-            }}
+            onClick={(event) => {}}
             data-testid={`${testIdPrefix}-cell-row-${cell.row.index}-col-lastJobId-link`}
           >
killedBy: NewAssignmentsTable tests clicking the last job shows its log in a modal, following the job, and the modal can be closed
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
main/components/NewAssignments/NewAssignmentsTable.jsx:175:29
         );
       },
     },
-    ButtonColumn("Refresh", "success", launchCallback, testIdPrefix),
+    ButtonColumn("Refresh", "", launchCallback, testIdPrefix),
     ButtonColumn("Edit", "primary", editCallback, testIdPrefix),
     ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix),
killedBy: NewAssignmentsTable tests renders headers, rows with readable labels, and buttons
statusReason: expect(element).toHaveClass("btn-success")

Expected the element to have class:
  btn-success
Received:
  btn

[Killed] StringLiteral
main/components/NewAssignments/NewAssignmentsTable.jsx:176:26
       },
     },
     ButtonColumn("Refresh", "success", launchCallback, testIdPrefix),
-    ButtonColumn("Edit", "primary", editCallback, testIdPrefix),
+    ButtonColumn("Edit", "", editCallback, testIdPrefix),
     ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix),
   ];
killedBy: NewAssignmentsTable tests renders headers, rows with readable labels, and buttons
statusReason: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn

[Killed] OptionalChaining
main/components/NewAssignments/NewAssignmentsTable.jsx:180:23
     ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix),
   ];
 
-  const editingTeam = editAssignment?.asnType === "TEAM";
+  const editingTeam = editAssignment.asnType === "TEAM";
   const EditForm = editingTeam
     ? NewTeamAssignmentForm
killedBy: InstructorCourseShowPage tests New Assignments tab is shown, right after Assignments, when the NEW_ASSIGNMENT_FEATURES option is enabled
statusReason: Unable to find role="tab" and name "New Assignments"

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div />

[Killed] ConditionalExpression
main/components/NewAssignments/NewAssignmentsTable.jsx:180:23
     ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix),
   ];
 
-  const editingTeam = editAssignment?.asnType === "TEAM";
+  const editingTeam = true;
   const EditForm = editingTeam
     ? NewTeamAssignmentForm
killedBy: NewAssignmentsTable tests editing an individual assignment opens the individual form, prefilled, without a way to change the type
statusReason: Unable to find an element with the text: Edit Individual Assignment. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] ArrowFunction
main/components/NewAssignments/NewAssignmentsTable.jsx:189:17
     <>
       <Modal
         show={showEditModal}
-        onHide={() => setShowEditModal(false)}
+        onHide={() => undefined}
         centered={true}
         data-testid={`${testIdPrefix}-edit-modal`}
killedBy: NewAssignmentsTable tests the edit modal can be closed without submitting
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-body"
  data-testid="NewAssignmentsTable-edit-modal-body"
>
  <p
    data-testid="NewAssignmentsTable-edit-modal-note"

[Killed] BooleanLiteral
main/components/NewAssignments/NewAssignmentsTable.jsx:189:40
     <>
       <Modal
         show={showEditModal}
-        onHide={() => setShowEditModal(false)}
+        onHide={() => setShowEditModal(true)}
         centered={true}
         data-testid={`${testIdPrefix}-edit-modal`}
killedBy: NewAssignmentsTable tests the edit modal can be closed without submitting
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-body"
  data-testid="NewAssignmentsTable-edit-modal-body"
>
  <p
    data-testid="NewAssignmentsTable-edit-modal-note"

[Killed] BooleanLiteral
main/components/NewAssignments/NewAssignmentsTable.jsx:190:19
       <Modal
         show={showEditModal}
         onHide={() => setShowEditModal(false)}
-        centered={true}
+        centered={false}
         data-testid={`${testIdPrefix}-edit-modal`}
       >
killedBy: NewAssignmentsTable tests editing an individual assignment opens the individual form, prefilled, without a way to change the type
statusReason: expect(element).toHaveClass("modal-dialog modal-dialog-centered")

Expected the element to have class:
  modal-dialog modal-dialog-centered
Received:
  modal-dialog

[Killed] ConditionalExpression
main/components/NewAssignments/NewAssignmentsTable.jsx:206:15
           </p>
           <EditForm
             initialContents={
-              editAssignment && assignmentToFormData(editAssignment)
+              false
             }
             submitAction={submitEditForm}
killedBy: NewAssignmentsTable tests editing an individual assignment opens the individual form, prefilled, without a way to change the type
statusReason: expect(element).toHaveValue(lab02)

Expected the element to have value:
  lab02
Received:

[Killed] LogicalOperator
main/components/NewAssignments/NewAssignmentsTable.jsx:206:15
           </p>
           <EditForm
             initialContents={
-              editAssignment && assignmentToFormData(editAssignment)
+              editAssignment || assignmentToFormData(editAssignment)
             }
             submitAction={submitEditForm}
killedBy: InstructorCourseShowPage tests New Assignments tab is shown, right after Assignments, when the NEW_ASSIGNMENT_FEATURES option is enabled
statusReason: Unable to find role="tab" and name "New Assignments"

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div />

[Killed] OptionalChaining
main/components/NewAssignments/NewAssignmentsTable.jsx:220:12
       >
         <span data-testid={`${testIdPrefix}-delete-confirmation-message`}>
           Are you sure you want to delete the assignment{" "}
-          {deleteAssignment?.repoPrefix}? Repositories that have already been
+          {deleteAssignment.repoPrefix}? Repositories that have already been
           created are not deleted.
         </span>
killedBy: InstructorCourseShowPage tests New Assignments tab is shown, right after Assignments, when the NEW_ASSIGNMENT_FEATURES option is enabled
statusReason: Unable to find role="tab" and name "New Assignments"

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div />
