[Killed] BooleanLiteral
main/components/NewAssignments/NewAssignmentsTable.jsx:226:39
       </ConfirmationModal>
       <JobLogModal
         show={showLogModal}
-        onHide={() => setShowLogModal(false)}
+        onHide={() => setShowLogModal(true)}
         courseId={courseId}
         jobId={logJobId}
killedBy: NewAssignmentsTable tests clicking the last job shows its log in a modal, following the job, and the modal can be closed
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-title h4"
>
  Job 
  12
   Log

[Killed] ArrowFunction
main/components/NewAssignments/NewAssignmentsTable.jsx:226:17
       </ConfirmationModal>
       <JobLogModal
         show={showLogModal}
-        onHide={() => setShowLogModal(false)}
+        onHide={() => undefined}
         courseId={courseId}
         jobId={logJobId}
killedBy: NewAssignmentsTable tests clicking the last job shows its log in a modal, following the job, and the modal can be closed
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-title h4"
>
  Job 
  12
   Log
