[Killed] StringLiteral
src/main/utils/courseTabUtils.js:9:3
 // Every tab the page can have; some are only shown for some courses or users.
 export const COURSE_TABS = [
   "students",
-  "staff",
+  "",
   "teams",
   "sections",
killedBy: InstructorCourseShowPage tests ?tab= in the URL ?tab=staff opens the Staff tab, and remembers it
statusReason: expected [ 'Assignments' ] to deeply equal [ 'Staff' ]

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] StringLiteral
src/main/utils/courseTabUtils.js:13:3
   "teams",
   "sections",
   "assignments",
-  "new-assignments",
+  "",
   "jobs",
   "downloads",
killedBy: InstructorCourseShowPage tests New Assignments tab is shown, right after Assignments, when the NEW_ASSIGNMENT_FEATURES option is enabled
statusReason: expect(element).toHaveAttribute("aria-selected", "true") // element.getAttribute("aria-selected") === "true"

Expected the element to have attribute:
  aria-selected="true"
Received:
  aria-selected="false"

[Killed] StringLiteral
src/main/utils/courseTabUtils.js:14:3
   "sections",
   "assignments",
   "new-assignments",
-  "jobs",
+  "",
   "downloads",
   "dokku",
killedBy: InstructorCourseShowPage tests ?tab= in the URL ?tab=jobs opens the Jobs tab, and remembers it
statusReason: expected [ 'Assignments' ] to deeply equal [ 'Jobs' ]

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] StringLiteral
src/main/utils/courseTabUtils.js:16:3
   "new-assignments",
   "jobs",
   "downloads",
-  "dokku",
+  "",
   "slack",
   "settings",
killedBy: InstructorCourseShowPage tests Dokku tab is shown, between Downloads and Settings, when the DOKKU_MANAGER option is enabled
statusReason: expect(element).toHaveAttribute("aria-selected", "true") // element.getAttribute("aria-selected") === "true"

Expected the element to have attribute:
  aria-selected="true"
Received:
  aria-selected="false"

[Killed] StringLiteral
src/main/utils/courseTabUtils.js:18:3
   "downloads",
   "dokku",
   "slack",
-  "settings",
+  "",
 ];
 
killedBy: InstructorCourseShowPage tests ?tab= in the URL ?tab=settings opens the Settings tab, and remembers it
statusReason: expected [ 'Assignments' ] to deeply equal [ 'Settings' ]

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] StringLiteral
src/main/utils/courseTabUtils.js:21:35
   "settings",
 ];
 
-export const DEFAULT_COURSE_TAB = "assignments";
+export const DEFAULT_COURSE_TAB = "";
 
 export function courseTabStorageKey(courseId) {
killedBy: InstructorCourseShowPage tests Tab assertions
statusReason: expect(element).toHaveAttribute("aria-selected", "true") // element.getAttribute("aria-selected") === "true"

Expected the element to have attribute:
  aria-selected="true"
Received:
  aria-selected="false"

[Killed] BlockStatement
src/main/utils/courseTabUtils.js:23:47
 
 export const DEFAULT_COURSE_TAB = "assignments";
 
-export function courseTabStorageKey(courseId) {
-  return `frontiers.courseTab.${courseId}`;
-}
+export function courseTabStorageKey(courseId) {}
 
 // Local storage can be unavailable (for example, blocked by browser settings);
killedBy: InstructorCourseShowPage tests ?tab= in the URL ?tab=students opens the Students tab, and remembers it
statusReason: expected null to be 'students' // Object.is equality

[Killed] BlockStatement
src/main/utils/courseTabUtils.js:29:46
 
 // Local storage can be unavailable (for example, blocked by browser settings);
 // remembering the tab is a convenience, so that is never treated as an error.
-export function getStoredCourseTab(courseId) {
-  try {
-    return window.localStorage.getItem(courseTabStorageKey(courseId));
-  } catch {
-    return null;
-  }
-}
+export function getStoredCourseTab(courseId) {}
 
 export function storeCourseTab(courseId, tab) {
killedBy: InstructorCourseShowPage tests ?tab= in the URL with no ?tab=, the tab remembered for this course is shown, without changing the URL
statusReason: expected [ 'Assignments' ] to deeply equal [ 'Downloads' ]

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] BlockStatement
src/main/utils/courseTabUtils.js:30:7
 // Local storage can be unavailable (for example, blocked by browser settings);
 // remembering the tab is a convenience, so that is never treated as an error.
 export function getStoredCourseTab(courseId) {
-  try {
-    return window.localStorage.getItem(courseTabStorageKey(courseId));
-  } catch {
+  try {} catch {
     return null;
   }
killedBy: InstructorCourseShowPage tests ?tab= in the URL with no ?tab=, the tab remembered for this course is shown, without changing the URL
statusReason: expected [ 'Assignments' ] to deeply equal [ 'Downloads' ]

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] BlockStatement
src/main/utils/courseTabUtils.js:32:11
 export function getStoredCourseTab(courseId) {
   try {
     return window.localStorage.getItem(courseTabStorageKey(courseId));
-  } catch {
-    return null;
-  }
+  } catch {}
 }
 
killedBy: courseTabUtils tests local storage being unavailable is not an error
statusReason: expected undefined to be null

[Killed] BlockStatement
src/main/utils/courseTabUtils.js:37:47
   }
 }
 
-export function storeCourseTab(courseId, tab) {
-  try {
-    window.localStorage.setItem(courseTabStorageKey(courseId), tab);
-  } catch {
-    // ignored; see above
-  }
-}
+export function storeCourseTab(courseId, tab) {}
 
 // requestedTab: the value of ?tab=, or null if the URL has none
killedBy: InstructorCourseShowPage tests ?tab= in the URL ?tab=students opens the Students tab, and remembers it
statusReason: expected null to be 'students' // Object.is equality

[Killed] BlockStatement
src/main/utils/courseTabUtils.js:38:7
 }
 
 export function storeCourseTab(courseId, tab) {
-  try {
-    window.localStorage.setItem(courseTabStorageKey(courseId), tab);
-  } catch {
+  try {} catch {
     // ignored; see above
   }
killedBy: InstructorCourseShowPage tests ?tab= in the URL ?tab=students opens the Students tab, and remembers it
statusReason: expected null to be 'students' // Object.is equality

[Killed] BlockStatement
src/main/utils/courseTabUtils.js:53:75
 // while the course options are still loading, gives the default tab for now;
 // since this is worked out on every render, the requested tab takes over as
 // soon as it appears.
-export function chooseCourseTab({ requestedTab, storedTab, visibleTabs }) {
-  if (requestedTab !== null) {
-    return visibleTabs.includes(requestedTab)
-      ? requestedTab
-      : DEFAULT_COURSE_TAB;
-  }
-  return visibleTabs.includes(storedTab) ? storedTab : DEFAULT_COURSE_TAB;
-}
+export function chooseCourseTab({ requestedTab, storedTab, visibleTabs }) {}
 
killedBy: InstructorCourseShowPage tests Tab assertions
statusReason: expect(element).toHaveAttribute("aria-selected", "true") // element.getAttribute("aria-selected") === "true"

Expected the element to have attribute:
  aria-selected="true"
Received:
  aria-selected="false"

[Killed] EqualityOperator
src/main/utils/courseTabUtils.js:54:7
 // since this is worked out on every render, the requested tab takes over as
 // soon as it appears.
 export function chooseCourseTab({ requestedTab, storedTab, visibleTabs }) {
-  if (requestedTab !== null) {
+  if (requestedTab === null) {
     return visibleTabs.includes(requestedTab)
       ? requestedTab
killedBy: InstructorCourseShowPage tests Tab assertions
statusReason: expect(element).toHaveAttribute("aria-selected", "true") // element.getAttribute("aria-selected") === "true"

Expected the element to have attribute:
  aria-selected="true"
Received:
  aria-selected="false"

[Killed] BlockStatement
src/main/utils/courseTabUtils.js:54:30
 // since this is worked out on every render, the requested tab takes over as
 // soon as it appears.
 export function chooseCourseTab({ requestedTab, storedTab, visibleTabs }) {
-  if (requestedTab !== null) {
-    return visibleTabs.includes(requestedTab)
-      ? requestedTab
-      : DEFAULT_COURSE_TAB;
-  }
+  if (requestedTab !== null) {}
   return visibleTabs.includes(storedTab) ? storedTab : DEFAULT_COURSE_TAB;
 }
killedBy: InstructorCourseShowPage tests Tab assertions
statusReason: expect(element).toHaveAttribute("aria-selected", "true") // element.getAttribute("aria-selected") === "true"

Expected the element to have attribute:
  aria-selected="true"
Received:
  aria-selected="false"
