[Killed] StringLiteral
src/main/utils/jobLogUtils.js:9:33
 export const JOB_LOG_POLL_INTERVAL_SECONDS = 3;
 
 /** The endpoint that answers one poll: a job's status and its new log lines. */
-export const JOB_LOG_TAIL_URL = "/api/jobs/course/logs/tail";
+export const JOB_LOG_TAIL_URL = "";
 
 // The statuses of a job that is over and will not write any more log lines
killedBy: NewAssignmentsTable tests clicking the last job shows its log in a modal, following the job, and the modal can be closed
statusReason: Unable to find an element with the text: /Creating lab01-cgaucho/, which matches selector 'pre'. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 10

[Timeout] BlockStatement
src/main/utils/jobLogUtils.js:15:39
 const FINISHED_JOB_STATUSES = ["complete", "error", "cancelled", "interrupted"];
 
 /** Whether a job with this status is over, so that its log has stopped growing. */
-export function isJobFinished(status) {
-  return FINISHED_JOB_STATUSES.includes(status);
-}
+export function isJobFinished(status) {}
 
 /** The path of the page that shows a whole job log, for a job of a course. */

[Killed] BlockStatement
src/main/utils/jobLogUtils.js:20:49
 }
 
 /** The path of the page that shows a whole job log, for a job of a course. */
-export function jobLogPagePath(courseId, jobId) {
-  return `/instructor/courses/${courseId}/jobs/${jobId}/logs`;
-}
+export function jobLogPagePath(courseId, jobId) {}
 
killedBy: NewAssignmentsTable tests the last job is a link to the log of the job, for the assignments that have one
statusReason: expect(element).toHaveAttribute("href", "/instructor/courses/1/jobs/12/logs") // element.getAttribute("href") === "/instructor/courses/1/jobs/12/logs"

Expected the element to have attribute:
  href="/instructor/courses/1/jobs/12/logs"
Received:
  null

[Killed] StringLiteral
src/main/utils/jobLogUtils.js:21:10
 
 /** The path of the page that shows a whole job log, for a job of a course. */
 export function jobLogPagePath(courseId, jobId) {
-  return `/instructor/courses/${courseId}/jobs/${jobId}/logs`;
+  return ``;
 }
 
killedBy: NewAssignmentsTable tests the last job is a link to the log of the job, for the assignments that have one
statusReason: expect(element).toHaveAttribute("href", "/instructor/courses/1/jobs/12/logs") // element.getAttribute("href") === "/instructor/courses/1/jobs/12/logs"

Expected the element to have attribute:
  href="/instructor/courses/1/jobs/12/logs"
Received:
  href=""
