[Timeout] BlockStatement
src/main/utils/newAssignmentsUtils.js:6:47
 export const NEW_ASSIGNMENTS_URL = "/api/assignments";
 
 /** Query key for the list of a course's assignments. */
-export function assignmentsQueryKey(courseId) {
-  return `${NEW_ASSIGNMENTS_URL}?courseId=${courseId}`;
-}
+export function assignmentsQueryKey(courseId) {}
 
 // Creating or editing an assignment starts a job, which shows up on the Jobs tab

[Killed] StringLiteral
src/main/utils/newAssignmentsUtils.js:11:31
 }
 
 // Creating or editing an assignment starts a job, which shows up on the Jobs tab
-export const JOBS_QUERY_KEY = "/api/jobs/course";
+export const JOBS_QUERY_KEY = "";
 
 export const ASSIGNMENT_TYPE_LABELS = {
killedBy: newAssignmentsUtils tests urls and query keys
statusReason: expected '' to be '/api/jobs/course' // Object.is equality

[Killed] StringLiteral
src/main/utils/newAssignmentsUtils.js:15:9
 
 export const ASSIGNMENT_TYPE_LABELS = {
   INDIVIDUAL: "Individual",
-  TEAM: "Team",
+  TEAM: "",
 };
 
killedBy: NewAssignmentsTable tests renders headers, rows with readable labels, and buttons
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Team
Received:

[Killed] StringLiteral
src/main/utils/newAssignmentsUtils.js:24:9
 };
 
 export const PERMISSION_LABELS = {
-  READ: "Read",
+  READ: "",
   WRITE: "Write",
   MAINTAIN: "Maintain",
killedBy: NewAssignmentsTable tests renders headers, rows with readable labels, and buttons
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Read
Received:

[Killed] StringLiteral
src/main/utils/newAssignmentsUtils.js:26:13
 export const PERMISSION_LABELS = {
   READ: "Read",
   WRITE: "Write",
-  MAINTAIN: "Maintain",
+  MAINTAIN: "",
   ADMIN: "Admin",
 };
killedBy: NewIndividualAssignmentForm tests offers the same options as the individual assignment form of the Assignments tab
statusReason: expected [ [ 'READ', 'Read' ], …(3) ] to deeply equal [ [ 'READ', 'Read' ], …(3) ]

[Killed] StringLiteral
src/main/utils/newAssignmentsUtils.js:27:10
   READ: "Read",
   WRITE: "Write",
   MAINTAIN: "Maintain",
-  ADMIN: "Admin",
+  ADMIN: "",
 };
 
killedBy: newAssignmentsUtils tests labels
statusReason: expected { READ: 'Read', WRITE: 'Write', …(2) } to deeply equal { READ: 'Read', WRITE: 'Write', …(2) }

[Killed] ObjectLiteral
src/main/utils/newAssignmentsUtils.js:30:40
   ADMIN: "Admin",
 };
 
-export const CREATE_REPOS_FOR_LABELS = {
-  STUDENTS_ONLY: "Students Only",
-  STAFF_ONLY: "Staff Only",
-  STUDENTS_AND_STAFF: "Students and Staff",
-};
+export const CREATE_REPOS_FOR_LABELS = {};
 
 /** The team regular expression that matches every team. */
killedBy: NewAssignmentsTabComponent tests Create Individual Assignment opens the individual form; submitting sends POST, toasts the job, closes the modal and refreshes
statusReason: expected { courseId: 7, …(5) } to deeply equal { courseId: 7, …(5) }

[Killed] StringLiteral
src/main/utils/newAssignmentsUtils.js:31:18
 };
 
 export const CREATE_REPOS_FOR_LABELS = {
-  STUDENTS_ONLY: "Students Only",
+  STUDENTS_ONLY: "",
   STAFF_ONLY: "Staff Only",
   STUDENTS_AND_STAFF: "Students and Staff",
killedBy: NewAssignmentsTable tests renders headers, rows with readable labels, and buttons
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Students Only
Received:

[Killed] StringLiteral
src/main/utils/newAssignmentsUtils.js:37:35
 };
 
 /** The team regular expression that matches every team. */
-export const DEFAULT_TEAM_REGEX = ".*";
+export const DEFAULT_TEAM_REGEX = "";
 
 /**
killedBy: NewAssignmentsTabComponent tests Create Team Assignment opens the team form with the default team regex; submitting sends POST with the team regex
statusReason: expect(element).toHaveValue(.*)

Expected the element to have value:
  .*
Received:

[Killed] BlockStatement
src/main/utils/newAssignmentsUtils.js:47:53
  * @param {"INDIVIDUAL"|"TEAM"} asnType the type of the assignment
  * @param {object} formData what the form holds
  */
-export function formDataToParams(asnType, formData) {
-  const params = {
-    repoPrefix: formData.repoPrefix,
-    visibility: formData.isPrivate ? "PRIVATE" : "PUBLIC",
-    permission: formData.permission,
-  };
-  if (asnType === "TEAM") {
-    params.teamRegex = formData.teamRegex;
-  } else {
-    params.createReposFor = formData.createReposFor;
-  }
-  return params;
-}
+export function formDataToParams(asnType, formData) {}
 
 /** Converts an assignment into what the create/edit forms hold. */
killedBy: NewAssignmentsTable tests submitting the individual edit sends PUT without the type, toasts the job, and closes the modal
statusReason: expected { courseId: 1, assignmentId: 2 } to deeply equal { courseId: 1, assignmentId: 2, …(4) }

[Killed] StringLiteral
src/main/utils/newAssignmentsUtils.js:50:38
 export function formDataToParams(asnType, formData) {
   const params = {
     repoPrefix: formData.repoPrefix,
-    visibility: formData.isPrivate ? "PRIVATE" : "PUBLIC",
+    visibility: formData.isPrivate ? "" : "PUBLIC",
     permission: formData.permission,
   };
killedBy: NewAssignmentsTable tests editing a team assignment opens the team form, and submitting sends the team regex
statusReason: expected { courseId: 1, assignmentId: 3, …(4) } to deeply equal { courseId: 1, assignmentId: 3, …(4) }

[Killed] BlockStatement
src/main/utils/newAssignmentsUtils.js:53:27
     visibility: formData.isPrivate ? "PRIVATE" : "PUBLIC",
     permission: formData.permission,
   };
-  if (asnType === "TEAM") {
-    params.teamRegex = formData.teamRegex;
-  } else {
+  if (asnType === "TEAM") {} else {
     params.createReposFor = formData.createReposFor;
   }
killedBy: NewAssignmentsTable tests editing a team assignment opens the team form, and submitting sends the team regex
statusReason: expected { courseId: 1, assignmentId: 3, …(3) } to deeply equal { courseId: 1, assignmentId: 3, …(4) }

[Killed] ConditionalExpression
src/main/utils/newAssignmentsUtils.js:53:7
     visibility: formData.isPrivate ? "PRIVATE" : "PUBLIC",
     permission: formData.permission,
   };
-  if (asnType === "TEAM") {
+  if (false) {
     params.teamRegex = formData.teamRegex;
   } else {
killedBy: NewAssignmentsTable tests editing a team assignment opens the team form, and submitting sends the team regex
statusReason: expected { courseId: 1, assignmentId: 3, …(4) } to deeply equal { courseId: 1, assignmentId: 3, …(4) }

[Killed] BlockStatement
src/main/utils/newAssignmentsUtils.js:55:10
   };
   if (asnType === "TEAM") {
     params.teamRegex = formData.teamRegex;
-  } else {
-    params.createReposFor = formData.createReposFor;
-  }
+  } else {}
   return params;
 }
killedBy: NewAssignmentsTable tests submitting the individual edit sends PUT without the type, toasts the job, and closes the modal
statusReason: expected { courseId: 1, assignmentId: 2, …(3) } to deeply equal { courseId: 1, assignmentId: 2, …(4) }

[Killed] BlockStatement
src/main/utils/newAssignmentsUtils.js:62:50
 }
 
 /** Converts an assignment into what the create/edit forms hold. */
-export function assignmentToFormData(assignment) {
-  return {
-    repoPrefix: assignment.repoPrefix,
-    isPrivate: assignment.visibility === "PRIVATE",
-    permission: assignment.permission,
-    createReposFor: assignment.createReposFor,
-    teamRegex: assignment.teamRegex,
-  };
-}
+export function assignmentToFormData(assignment) {}
 
 /** The message toasted when an assignment has been saved and its job started. */
killedBy: NewAssignmentsTable tests editing an individual assignment opens the individual form, prefilled, without a way to change the type
statusReason: expect(element).toHaveValue(lab02)

Expected the element to have value:
  lab02
Received:

[Killed] ObjectLiteral
src/main/utils/newAssignmentsUtils.js:63:10
 
 /** Converts an assignment into what the create/edit forms hold. */
 export function assignmentToFormData(assignment) {
-  return {
-    repoPrefix: assignment.repoPrefix,
-    isPrivate: assignment.visibility === "PRIVATE",
-    permission: assignment.permission,
-    createReposFor: assignment.createReposFor,
-    teamRegex: assignment.teamRegex,
-  };
+  return {};
 }
 
killedBy: NewAssignmentsTable tests editing an individual assignment opens the individual form, prefilled, without a way to change the type
statusReason: expect(element).toHaveValue(lab02)

Expected the element to have value:
  lab02
Received:

[Killed] EqualityOperator
src/main/utils/newAssignmentsUtils.js:65:16
 export function assignmentToFormData(assignment) {
   return {
     repoPrefix: assignment.repoPrefix,
-    isPrivate: assignment.visibility === "PRIVATE",
+    isPrivate: assignment.visibility !== "PRIVATE",
     permission: assignment.permission,
     createReposFor: assignment.createReposFor,
killedBy: NewAssignmentsTable tests editing an individual assignment opens the individual form, prefilled, without a way to change the type
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  class="form-check-input"
  data-testid="NewIndividualAssignmentForm-isPrivate"
  id="isPrivate"
  name="isPrivate"

[Killed] ConditionalExpression
src/main/utils/newAssignmentsUtils.js:65:16
 export function assignmentToFormData(assignment) {
   return {
     repoPrefix: assignment.repoPrefix,
-    isPrivate: assignment.visibility === "PRIVATE",
+    isPrivate: true,
     permission: assignment.permission,
     createReposFor: assignment.createReposFor,
killedBy: newAssignmentsUtils tests assignmentToFormData
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/main/utils/newAssignmentsUtils.js:73:47
 }
 
 /** The message toasted when an assignment has been saved and its job started. */
-export function jobStartedMessage(verb, data) {
-  return `Assignment ${verb}. Job ${data.job.id} started to create its repositories; click the job number in the table to watch its log.`;
-}
+export function jobStartedMessage(verb, data) {}
 
 /** The message toasted when the job of an existing assignment has been started. */
killedBy: NewAssignmentsTabComponent tests Create Individual Assignment opens the individual form; submitting sends POST, toasts the job, closes the modal and refreshes
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Assignment created. Job 99 started to create its repositories; click the job number in the table to watch its log.",

[Killed] BlockStatement
src/main/utils/newAssignmentsUtils.js:78:42
 }
 
 /** The message toasted when the job of an existing assignment has been started. */
-export function jobLaunchedMessage(data) {
-  return `Job ${data.job.id} started to create the repositories of this assignment; click the job number in the table to watch its log.`;
-}
+export function jobLaunchedMessage(data) {}
 
 /** Shared onError handler for assignment mutations: shows the backend's message when it has one. */
killedBy: NewAssignmentsTable tests Refresh starts the job of the assignment, and says which job
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Job 99 started to create the repositories of this assignment; click the job number in the table to watch its log.",

[Killed] StringLiteral
src/main/utils/newAssignmentsUtils.js:79:10
 
 /** The message toasted when the job of an existing assignment has been started. */
 export function jobLaunchedMessage(data) {
-  return `Job ${data.job.id} started to create the repositories of this assignment; click the job number in the table to watch its log.`;
+  return ``;
 }
 
killedBy: NewAssignmentsTable tests Refresh starts the job of the assignment, and says which job
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Job 99 started to create the repositories of this assignment; click the job number in the table to watch its log.",

[Killed] BlockStatement
src/main/utils/newAssignmentsUtils.js:83:50
 }
 
 /** Shared onError handler for assignment mutations: shows the backend's message when it has one. */
-export function onAssignmentMutationError(error) {
-  toast(error.response?.data?.message ?? `${error}`);
-}
+export function onAssignmentMutationError(error) {}
 
killedBy: NewAssignmentsTabComponent tests a failed create shows the backend's message and keeps the modal open
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] OptionalChaining
src/main/utils/newAssignmentsUtils.js:84:9
 
 /** Shared onError handler for assignment mutations: shows the backend's message when it has one. */
 export function onAssignmentMutationError(error) {
-  toast(error.response?.data?.message ?? `${error}`);
+  toast(error.response.data?.message ?? `${error}`);
 }
 
killedBy: newAssignmentsUtils tests onAssignmentMutationError shows the error itself when there is no message
statusReason: Cannot read properties of undefined (reading 'data')

[Killed] LogicalOperator
src/main/utils/newAssignmentsUtils.js:84:9
 
 /** Shared onError handler for assignment mutations: shows the backend's message when it has one. */
 export function onAssignmentMutationError(error) {
-  toast(error.response?.data?.message ?? `${error}`);
+  toast(error.response?.data?.message && `${error}`);
 }
 
killedBy: NewAssignmentsTable tests a failed Refresh shows the backend's message
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "No linked GitHub Organization to CS156. Please link a GitHub Organization first.",
