[Killed] ArrayDeclaration
src/main/utils/useJobLogTail.js:22:38
  *   first answer; and the error of the request that made it stop, if there was one
  */
 export function useJobLogTail(courseId, jobId) {
-  const [lines, setLines] = useState([]);
+  const [lines, setLines] = useState(["Stryker was here"]);
   const [status, setStatus] = useState(null);
   const [error, setError] = useState(null);
killedBy: useJobLogTail tests what the very first render sees is nothing yet
statusReason: expected { lines: [ 'Stryker was here' ], …(2) } to deeply equal { Object (lines, status, ...) }

[Killed] BooleanLiteral
src/main/utils/useJobLogTail.js:27:19
   const [error, setError] = useState(null);
 
   useEffect(() => {
-    let stopped = false;
+    let stopped = true;
     let timer;
     // the id of the last log line received; the backend sends lines after it
killedBy: NewAssignmentsTable tests clicking the last job shows its log in a modal, following the job, and the modal can be closed
statusReason: Unable to find an element with the text: /Creating lab01-cgaucho/, which matches selector 'pre'. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 10

[Killed] BlockStatement
src/main/utils/useJobLogTail.js:36:30
     setStatus(null);
     setError(null);
 
-    const poll = async () => {
-      try {
-        const response = await axios.get(JOB_LOG_TAIL_URL, {
-          params: { courseId, jobId, afterId },
-        });
-        if (stopped) {
-          return;
-        }
-        const { status: newStatus, lines: newLines } = response.data;
-        if (newLines.length > 0) {
-          afterId = newLines[newLines.length - 1].id;
-          setLines((previous) => [
-            ...previous,
-            ...newLines.map((line) => line.message),
-          ]);
-        }
-        setStatus(newStatus);
-        if (!isJobFinished(newStatus)) {
-          timer = setTimeout(poll, JOB_LOG_POLL_INTERVAL_SECONDS * 1000);
-        }
-      } catch (e) {
-        // if the component is gone by now, this state is simply not used
-        setError(e);
-      }
-    };
+    const poll = async () => {};
 
     poll();
killedBy: NewAssignmentsTable tests clicking the last job shows its log in a modal, following the job, and the modal can be closed
statusReason: Unable to find an element with the text: /Creating lab01-cgaucho/, which matches selector 'pre'. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 10

[Killed] BlockStatement
src/main/utils/useJobLogTail.js:37:11
     setError(null);
 
     const poll = async () => {
-      try {
-        const response = await axios.get(JOB_LOG_TAIL_URL, {
-          params: { courseId, jobId, afterId },
-        });
-        if (stopped) {
-          return;
-        }
-        const { status: newStatus, lines: newLines } = response.data;
-        if (newLines.length > 0) {
-          afterId = newLines[newLines.length - 1].id;
-          setLines((previous) => [
-            ...previous,
-            ...newLines.map((line) => line.message),
-          ]);
-        }
-        setStatus(newStatus);
-        if (!isJobFinished(newStatus)) {
-          timer = setTimeout(poll, JOB_LOG_POLL_INTERVAL_SECONDS * 1000);
-        }
-      } catch (e) {
+      try {} catch (e) {
         // if the component is gone by now, this state is simply not used
         setError(e);
killedBy: NewAssignmentsTable tests clicking the last job shows its log in a modal, following the job, and the modal can be closed
statusReason: Unable to find an element with the text: /Creating lab01-cgaucho/, which matches selector 'pre'. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 10

[Killed] ObjectLiteral
src/main/utils/useJobLogTail.js:38:60
 
     const poll = async () => {
       try {
-        const response = await axios.get(JOB_LOG_TAIL_URL, {
-          params: { courseId, jobId, afterId },
-        });
+        const response = await axios.get(JOB_LOG_TAIL_URL, {});
         if (stopped) {
           return;
killedBy: NewAssignmentsTable tests clicking the last job shows its log in a modal, following the job, and the modal can be closed
statusReason: expected undefined to deeply equal { courseId: 1, jobId: 12, afterId: +0 }

[Killed] ConditionalExpression
src/main/utils/useJobLogTail.js:41:13
         const response = await axios.get(JOB_LOG_TAIL_URL, {
           params: { courseId, jobId, afterId },
         });
-        if (stopped) {
+        if (true) {
           return;
         }
killedBy: NewAssignmentsTable tests clicking the last job shows its log in a modal, following the job, and the modal can be closed
statusReason: Unable to find an element with the text: /Creating lab01-cgaucho/, which matches selector 'pre'. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 10

[Timeout] ConditionalExpression
src/main/utils/useJobLogTail.js:41:13
         const response = await axios.get(JOB_LOG_TAIL_URL, {
           params: { courseId, jobId, afterId },
         });
-        if (stopped) {
+        if (false) {
           return;
         }

[Killed] ConditionalExpression
src/main/utils/useJobLogTail.js:45:13
           return;
         }
         const { status: newStatus, lines: newLines } = response.data;
-        if (newLines.length > 0) {
+        if (true) {
           afterId = newLines[newLines.length - 1].id;
           setLines((previous) => [
killedBy: useJobLogTail tests a poll with no new lines keeps what it has, and asks after the same line again
statusReason: expected 2 to be 3 // Object.is equality

[Killed] ConditionalExpression
src/main/utils/useJobLogTail.js:45:13
           return;
         }
         const { status: newStatus, lines: newLines } = response.data;
-        if (newLines.length > 0) {
+        if (false) {
           afterId = newLines[newLines.length - 1].id;
           setLines((previous) => [
killedBy: NewAssignmentsTable tests clicking the last job shows its log in a modal, following the job, and the modal can be closed
statusReason: Unable to find an element with the text: /Creating lab01-cgaucho/, which matches selector 'pre'. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 10

[Killed] ArithmeticOperator
src/main/utils/useJobLogTail.js:46:30
         }
         const { status: newStatus, lines: newLines } = response.data;
         if (newLines.length > 0) {
-          afterId = newLines[newLines.length - 1].id;
+          afterId = newLines[newLines.length + 1].id;
           setLines((previous) => [
             ...previous,
killedBy: NewAssignmentsTable tests clicking the last job shows its log in a modal, following the job, and the modal can be closed
statusReason: Unable to find an element with the text: /Creating lab01-cgaucho/, which matches selector 'pre'. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 10

[Killed] ArrowFunction
src/main/utils/useJobLogTail.js:47:20
         const { status: newStatus, lines: newLines } = response.data;
         if (newLines.length > 0) {
           afterId = newLines[newLines.length - 1].id;
-          setLines((previous) => [
-            ...previous,
-            ...newLines.map((line) => line.message),
-          ]);
+          setLines(() => undefined);
         }
         setStatus(newStatus);
killedBy: NewAssignmentsTable tests clicking the last job shows its log in a modal, following the job, and the modal can be closed
statusReason: expect(element).toBeInTheDocument()

element could not be found in the document

[Killed] ArrowFunction
src/main/utils/useJobLogTail.js:49:29
           afterId = newLines[newLines.length - 1].id;
           setLines((previous) => [
             ...previous,
-            ...newLines.map((line) => line.message),
+            ...newLines.map(() => undefined),
           ]);
         }
killedBy: NewAssignmentsTable tests clicking the last job shows its log in a modal, following the job, and the modal can be closed
statusReason: Unable to find an element with the text: /Creating lab01-cgaucho/, which matches selector 'pre'. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 10

[Killed] ConditionalExpression
src/main/utils/useJobLogTail.js:53:13
           ]);
         }
         setStatus(newStatus);
-        if (!isJobFinished(newStatus)) {
+        if (false) {
           timer = setTimeout(poll, JOB_LOG_POLL_INTERVAL_SECONDS * 1000);
         }
killedBy: useJobLogTail tests polls again every 3 seconds, asking only for the lines after the last one it has
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BooleanLiteral
src/main/utils/useJobLogTail.js:53:13
           ]);
         }
         setStatus(newStatus);
-        if (!isJobFinished(newStatus)) {
+        if (isJobFinished(newStatus)) {
           timer = setTimeout(poll, JOB_LOG_POLL_INTERVAL_SECONDS * 1000);
         }
killedBy: useJobLogTail tests polls again every 3 seconds, asking only for the lines after the last one it has
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ArithmeticOperator
src/main/utils/useJobLogTail.js:54:36
         }
         setStatus(newStatus);
         if (!isJobFinished(newStatus)) {
-          timer = setTimeout(poll, JOB_LOG_POLL_INTERVAL_SECONDS * 1000);
+          timer = setTimeout(poll, JOB_LOG_POLL_INTERVAL_SECONDS / 1000);
         }
       } catch (e) {
killedBy: useJobLogTail tests starts with nothing, and asks for the whole log of the job of the course
statusReason: expected { lines: [ 'first', 'first' ], …(2) } to deeply equal { lines: [ 'first' ], …(2) }

[Killed] BlockStatement
src/main/utils/useJobLogTail.js:56:19
         if (!isJobFinished(newStatus)) {
           timer = setTimeout(poll, JOB_LOG_POLL_INTERVAL_SECONDS * 1000);
         }
-      } catch (e) {
-        // if the component is gone by now, this state is simply not used
-        setError(e);
-      }
+      } catch (e) {}
     };
 
killedBy: useJobLogTail tests stops polling, and says why, when a request fails
statusReason: expected null not to be null

[Killed] BlockStatement
src/main/utils/useJobLogTail.js:64:18
 
     poll();
 
-    return () => {
-      stopped = true;
-      clearTimeout(timer);
-    };
+    return () => {};
   }, [courseId, jobId]);
 
killedBy: useJobLogTail tests stops polling when the component goes away
statusReason: expected 21 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/main/utils/useJobLogTail.js:65:17
     poll();
 
     return () => {
-      stopped = true;
+      stopped = false;
       clearTimeout(timer);
     };
killedBy: useJobLogTail tests an answer that arrives after the component has gone away is dropped, and does not start polling again
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ArrayDeclaration
src/main/utils/useJobLogTail.js:68:6
       stopped = true;
       clearTimeout(timer);
     };
-  }, [courseId, jobId]);
+  }, []);
 
   return { lines, status, error };
killedBy: useJobLogTail tests a job with another id starts again from the beginning, and the old one is no longer followed
statusReason: expected { lines: [ 'old job' ], …(2) } to deeply equal { Object (lines, status, ...) }

[Killed] ObjectLiteral
src/main/utils/useJobLogTail.js:70:10
     };
   }, [courseId, jobId]);
 
-  return { lines, status, error };
+  return {};
 }
 
killedBy: NewAssignmentsTable tests clicking the last job shows its log in a modal, following the job, and the modal can be closed
statusReason: Cannot read properties of undefined (reading 'length')
