[Killed] ConditionalExpression
main/components/NewAssignments/NewIndividualAssignmentForm.jsx:41:15
           data-testid={`${testIdPrefix}-repoPrefix`}
           {...register("repoPrefix", {
             validate: (value) =>
-              value.trim().length > 0 || "Repository Prefix is required.",
+              false,
           })}
         />
killedBy: NewAssignmentsTabComponent tests Create Individual Assignment opens the individual form; submitting sends POST, toasts the job, closes the modal and refreshes
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""
