[Killed] EqualityOperator
main/components/NewAssignments/NewTeamAssignmentForm.jsx:42:15
           data-testid={`${testIdPrefix}-repoPrefix`}
           {...register("repoPrefix", {
             validate: (value) =>
-              value.trim().length > 0 || "Team Repository Prefix is required.",
+              value.trim().length <= 0 || "Team Repository Prefix is required.",
           })}
         />
killedBy: NewAssignmentsTable tests editing a team assignment opens the team form, and submitting sends the team regex
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""
