[Killed] StringLiteral
main/components/NewAssignments/NewAssignmentsTable.jsx:175:28
         );
       },
     },
-    ButtonColumn("Launch", "success", launchCallback, testIdPrefix),
+    ButtonColumn("Launch", "", launchCallback, testIdPrefix),
     ButtonColumn("Edit", "primary", editCallback, testIdPrefix),
     ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix),
killedBy: NewAssignmentsTable tests renders headers, rows with readable labels, and buttons
statusReason: expect(element).toHaveClass("btn-success")

Expected the element to have class:
  btn-success
Received:
  btn

[Killed] StringLiteral
main/components/NewAssignments/NewAssignmentsTable.jsx:176:26
       },
     },
     ButtonColumn("Launch", "success", launchCallback, testIdPrefix),
-    ButtonColumn("Edit", "primary", editCallback, testIdPrefix),
+    ButtonColumn("Edit", "", editCallback, testIdPrefix),
     ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix),
   ];
killedBy: NewAssignmentsTable tests renders headers, rows with readable labels, and buttons
statusReason: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn
