[Killed] ConditionalExpression
src/main/utils/newAssignmentsUtils.js:65:16
 export function assignmentToFormData(assignment) {
   return {
     repoPrefix: assignment.repoPrefix,
-    isPrivate: assignment.visibility === "PRIVATE",
+    isPrivate: false,
     permission: assignment.permission,
     createReposFor: assignment.createReposFor,
killedBy: newAssignmentsUtils tests assignmentToFormData
statusReason: expected { repoPrefix: 'proj-team', …(4) } to deeply equal { repoPrefix: 'proj-team', …(4) }
