[Killed] BlockStatement
src/main/utils/useJobLogTail.js:41:22
         const response = await axios.get(JOB_LOG_TAIL_URL, {
           params: { courseId, jobId, afterId },
         });
-        if (stopped) {
-          return;
-        }
+        if (stopped) {}
         const { status: newStatus, lines: newLines } = response.data;
         if (newLines.length > 0) {
killedBy: useJobLogTail tests an answer that arrives after the component has gone away is dropped, and does not start polling again
statusReason: expected 2 to be 1 // Object.is equality

[Killed] EqualityOperator
src/main/utils/useJobLogTail.js:45:13
           return;
         }
         const { status: newStatus, lines: newLines } = response.data;
-        if (newLines.length > 0) {
+        if (newLines.length <= 0) {
           afterId = newLines[newLines.length - 1].id;
           setLines((previous) => [
killedBy: NewAssignmentsTable tests clicking the last job shows its log in a modal, following the job, and the modal can be closed
statusReason: Unable to find an element with the text: /Creating lab01-cgaucho/, which matches selector 'pre'. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 10

[Killed] BlockStatement
src/main/utils/useJobLogTail.js:56:19
         if (!isJobFinished(newStatus)) {
           timer = setTimeout(poll, JOB_LOG_POLL_INTERVAL_SECONDS * 1000);
         }
-      } catch (e) {
-        if (!stopped) {
-          setError(e);
-        }
-      }
+      } catch (e) {}
     };
 
killedBy: useJobLogTail tests stops polling, and says why, when a request fails
statusReason: expected null not to be null

[Killed] BlockStatement
src/main/utils/useJobLogTail.js:57:23
           timer = setTimeout(poll, JOB_LOG_POLL_INTERVAL_SECONDS * 1000);
         }
       } catch (e) {
-        if (!stopped) {
-          setError(e);
-        }
+        if (!stopped) {}
       }
     };
killedBy: useJobLogTail tests stops polling, and says why, when a request fails
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/main/utils/useJobLogTail.js:57:13
           timer = setTimeout(poll, JOB_LOG_POLL_INTERVAL_SECONDS * 1000);
         }
       } catch (e) {
-        if (!stopped) {
+        if (false) {
           setError(e);
         }
killedBy: useJobLogTail tests stops polling, and says why, when a request fails
statusReason: expected null not to be null
