[Killed] ArrayDeclaration
main/components/Courses/CoursesTable.js:4:17
 import OurTable from "main/components/OurTable";
 import { Button } from "react-bootstrap";
 
-const columns = [
-  {
-    Header: "id",
-    accessor: "id", // accessor is the "key" in the data
-  },
-  {
-    Header: "Course Name",
-    accessor: "courseName",
-  },
-  {
-    Header: "Term",
-    accessor: "term",
-  },
-  {
-    Header: "School",
-    accessor: "school",
-  },
-];
+const columns = [];
 
 export default function CoursesTable({ courses, storybook = false }) {
statusReason: TestingLibraryElementError: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ObjectLiteral
main/components/Courses/CoursesTable.js:9:3
     Header: "id",
     accessor: "id", // accessor is the "key" in the data
   },
-  {
-    Header: "Course Name",
-    accessor: "courseName",
-  },
+  {},
   {
     Header: "Term",
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Courses/CoursesTable.js:13:3
     Header: "Course Name",
     accessor: "courseName",
   },
-  {
-    Header: "Term",
-    accessor: "term",
-  },
+  {},
   {
     Header: "School",
statusReason: Error: A column ID (or string accessor) is required!

[Killed] BooleanLiteral
main/components/Courses/CoursesTable.js:23:61
   },
 ];
 
-export default function CoursesTable({ courses, storybook = false }) {
+export default function CoursesTable({ courses, storybook = true }) {
   const joinCallback = (cell) => {
     // TODO: Implement the join functionality here
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "Join callback invoked for course with id: 2"

[Killed] BlockStatement
main/components/Courses/CoursesTable.js:24:34
 ];
 
 export default function CoursesTable({ courses, storybook = false }) {
-  const joinCallback = (cell) => {
-    // TODO: Implement the join functionality here
-    if (storybook) {
-      window.alert(
-        `Join callback invoked for course with id: ${cell.row.values.id}`,
-      );
-      return;
-    }
-  };
+  const joinCallback = (cell) => {};
 
   const viewInviteCallback = (cell) => {
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
main/components/Courses/CoursesTable.js:26:9
 export default function CoursesTable({ courses, storybook = false }) {
   const joinCallback = (cell) => {
     // TODO: Implement the join functionality here
-    if (storybook) {
+    if (false) {
       window.alert(
         `Join callback invoked for course with id: ${cell.row.values.id}`,
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/components/Courses/CoursesTable.js:26:20
 export default function CoursesTable({ courses, storybook = false }) {
   const joinCallback = (cell) => {
     // TODO: Implement the join functionality here
-    if (storybook) {
-      window.alert(
-        `Join callback invoked for course with id: ${cell.row.values.id}`,
-      );
-      return;
-    }
+    if (storybook) {}
   };
 
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:28:9
     // TODO: Implement the join functionality here
     if (storybook) {
       window.alert(
-        `Join callback invoked for course with id: ${cell.row.values.id}`,
+        ``,
       );
       return;
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Join callback invoked for course with id: 2"
Received: ""

Number of calls: 1

[Killed] BlockStatement
main/components/Courses/CoursesTable.js:34:40
     }
   };
 
-  const viewInviteCallback = (cell) => {
-    const organizationName = cell.row.original.orgName;
-    const gitInvite = `https://github.com/${organizationName}/invitation`;
-
-    window.open(gitInvite, "_blank");
-  };
+  const viewInviteCallback = (cell) => {};
 
   const columnsWithStatus = [
killedBy: CoursesTable tests Does not call window.alert when storybook is explicitly false for button 'View Invite'
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "https://github.com/ucsb-cs156-f25/invitation", "_blank"

Number of calls: 0

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:38:28
     const organizationName = cell.row.original.orgName;
     const gitInvite = `https://github.com/${organizationName}/invitation`;
 
-    window.open(gitInvite, "_blank");
+    window.open(gitInvite, "");
   };
 
killedBy: CoursesTable tests Does not call window.alert when storybook is explicitly false for button 'View Invite'
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "https://github.com/ucsb-cs156-f25/invitation", "_blank"
Received: "https://github.com/ucsb-cs156-f25/invitation", ""

Number of calls: 1

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:45:17
     ...columns,
     {
       Header: "Status",
-      accessor: "studentStatus",
+      accessor: "",
       Cell: ({ cell }) => {
         if (cell.value === "PENDING") {
killedBy: CoursesTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-studentStatus"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] EqualityOperator
main/components/Courses/CoursesTable.js:47:13
       Header: "Status",
       accessor: "studentStatus",
       Cell: ({ cell }) => {
-        if (cell.value === "PENDING") {
+        if (cell.value !== "PENDING") {
           return <span style={{ color: "orange" }}>Pending</span>;
         } else if (cell.value === "JOINCOURSE") {
killedBy: CoursesTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Pending
Received:
  PENDING

[Killed] ConditionalExpression
main/components/Courses/CoursesTable.js:47:13
       Header: "Status",
       accessor: "studentStatus",
       Cell: ({ cell }) => {
-        if (cell.value === "PENDING") {
+        if (true) {
           return <span style={{ color: "orange" }}>Pending</span>;
         } else if (cell.value === "JOINCOURSE") {
killedBy: CoursesTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Found multiple elements with the text: Pending

Here are the matching elements:

Ignored nodes: comments, script, style
<span
  style="color: orange;"
>

[Killed] BlockStatement
main/components/Courses/CoursesTable.js:49:49
       Cell: ({ cell }) => {
         if (cell.value === "PENDING") {
           return <span style={{ color: "orange" }}>Pending</span>;
-        } else if (cell.value === "JOINCOURSE") {
-          return (
-            <Button
-              variant={"primary"}
-              onClick={() => joinCallback(cell)}
-              data-testid={`CoursesTable-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
-            >
-              Join Course
-            </Button>
-          );
-        } else if (cell.value === "INVITED") {
+        } else if (cell.value === "JOINCOURSE") {} else if (cell.value === "INVITED") {
           return (
             <Button
killedBy: CoursesTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Join Course. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ConditionalExpression
main/components/Courses/CoursesTable.js:49:20
       Cell: ({ cell }) => {
         if (cell.value === "PENDING") {
           return <span style={{ color: "orange" }}>Pending</span>;
-        } else if (cell.value === "JOINCOURSE") {
+        } else if (true) {
           return (
             <Button
killedBy: CoursesTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Found multiple elements with the text: Join Course

Here are the matching elements:

Ignored nodes: comments, script, style
<button
  class="btn btn-primary"
  data-testid="CoursesTable-cell-row-1-col-studentStatus-button"

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:54:28
             <Button
               variant={"primary"}
               onClick={() => joinCallback(cell)}
-              data-testid={`CoursesTable-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
+              data-testid={``}
             >
               Join Course
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-1-col-status-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BlockStatement
main/components/Courses/CoursesTable.js:59:46
               Join Course
             </Button>
           );
-        } else if (cell.value === "INVITED") {
-          return (
-            <Button
-              variant={"primary"}
-              onClick={() => viewInviteCallback(cell)}
-              data-testid={`CoursesTable-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
-            >
-              View Invite
-            </Button>
-          );
-        } else if (cell.value === "OWNER") {
+        } else if (cell.value === "INVITED") {} else if (cell.value === "OWNER") {
           return <span style={{ color: "purple" }}>Owner</span>;
         } else if (cell.value === "MEMBER") {
killedBy: CoursesTable tests Does not call window.alert in default case for button'View Invite'
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-2-col-studentStatus-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] EqualityOperator
main/components/Courses/CoursesTable.js:59:20
               Join Course
             </Button>
           );
-        } else if (cell.value === "INVITED") {
+        } else if (cell.value !== "INVITED") {
           return (
             <Button
killedBy: CoursesTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Member. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:64:28
             <Button
               variant={"primary"}
               onClick={() => viewInviteCallback(cell)}
-              data-testid={`CoursesTable-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
+              data-testid={``}
             >
               View Invite
killedBy: CoursesTable tests Does not call window.alert in default case for button'View Invite'
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-2-col-studentStatus-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BlockStatement
main/components/Courses/CoursesTable.js:69:44
               View Invite
             </Button>
           );
-        } else if (cell.value === "OWNER") {
-          return <span style={{ color: "purple" }}>Owner</span>;
-        } else if (cell.value === "MEMBER") {
+        } else if (cell.value === "OWNER") {} else if (cell.value === "MEMBER") {
           return <span style={{ color: "blue" }}>Member</span>;
         }
killedBy: CoursesTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Owner. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ConditionalExpression
main/components/Courses/CoursesTable.js:69:20
               View Invite
             </Button>
           );
-        } else if (cell.value === "OWNER") {
+        } else if (true) {
           return <span style={{ color: "purple" }}>Owner</span>;
         } else if (cell.value === "MEMBER") {
killedBy: CoursesTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Member. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] EqualityOperator
main/components/Courses/CoursesTable.js:71:20
           );
         } else if (cell.value === "OWNER") {
           return <span style={{ color: "purple" }}>Owner</span>;
-        } else if (cell.value === "MEMBER") {
+        } else if (cell.value !== "MEMBER") {
           return <span style={{ color: "blue" }}>Member</span>;
         }
killedBy: CoursesTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Illegal status that will never occur. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"

[Killed] ConditionalExpression
main/components/Courses/CoursesTable.js:71:20
           );
         } else if (cell.value === "OWNER") {
           return <span style={{ color: "purple" }}>Owner</span>;
-        } else if (cell.value === "MEMBER") {
+        } else if (true) {
           return <span style={{ color: "blue" }}>Member</span>;
         }
killedBy: CoursesTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Found multiple elements with the text: Member

Here are the matching elements:

Ignored nodes: comments, script, style
<span
  style="color: blue;"
>

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:82:15
     <OurTable
       data={courses}
       columns={columnsWithStatus}
-      testid={"CoursesTable"}
+      testid={""}
     />
   );
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
