[Killed] ObjectLiteral
main/components/Courses/InstructorCoursesTable.js:10:3
     Header: "id",
     accessor: "id", // accessor is the "key" in the data
   },
-  {
-    Header: "Course Name",
-    accessor: "courseName",
-    Cell: ({ cell }) => {
-      return (
-        <a
-          href={`/instructor/courses/${cell.row.values.id}`}
-          data-testid={`CoursesTable-cell-row-${cell.row.index}-col-${cell.column.id}-link`}
-        >
-          {cell.value}
-        </a>
-      );
-    },
-  },
+  {},
   {
     Header: "Term",
killedBy: InstructorCoursesTable tests Has the expected column headers and content for instructor user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] BlockStatement
main/components/Courses/InstructorCoursesTable.js:13:25
   {
     Header: "Course Name",
     accessor: "courseName",
-    Cell: ({ cell }) => {
-      return (
-        <a
-          href={`/instructor/courses/${cell.row.values.id}`}
-          data-testid={`CoursesTable-cell-row-${cell.row.index}-col-${cell.column.id}-link`}
-        >
-          {cell.value}
-        </a>
-      );
-    },
+    Cell: ({ cell }) => {},
   },
   {
killedBy: InstructorCoursesTable tests Has the expected column headers and content for instructor user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  CMPSC 156
Received:

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.js:17:24
       return (
         <a
           href={`/instructor/courses/${cell.row.values.id}`}
-          data-testid={`CoursesTable-cell-row-${cell.row.index}-col-${cell.column.id}-link`}
+          data-testid={``}
         >
           {cell.value}
killedBy: InstructorCoursesTable tests Has the expected column headers and content for instructor user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-courseName-link"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.js:25:13
     },
   },
   {
-    Header: "Term",
+    Header: "",
     accessor: "term",
   },
statusReason: TestingLibraryElementError: Unable to find an element with the text: Term. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.js:29:13
     accessor: "term",
   },
   {
-    Header: "School",
+    Header: "",
     accessor: "school",
   },
statusReason: TestingLibraryElementError: Unable to find an element with the text: School. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.js:38:12
   courses,
   storybook = false,
   currentUser,
-  testId = "InstructorCoursesTable",
+  testId = "",
 }) {
   const installCallback = (cell) => {
killedBy: InstructorCoursesTable tests Has the expected column headers and content for instructor user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ConditionalExpression
main/components/Courses/InstructorCoursesTable.js:42:9
 }) {
   const installCallback = (cell) => {
     const url = `/api/courses/redirect?courseId=${cell.row.values.id}`;
-    if (storybook) {
+    if (false) {
       window.alert(`would have navigated to: ${url}`);
       return;
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/components/Courses/InstructorCoursesTable.js:49:31
     window.location.href = url;
   };
 
-  const canInstall = (row) => {
-    if ("orgName" in row.values && row.values.orgName) {
-      return { canInstall: false, reason: "already-installed" };
-    }
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return { canInstall: true, reason: "admin" };
-    }
-    if (
-      hasRole(currentUser, "ROLE_INSTRUCTOR") &&
-      row.values.createdByEmail === currentUser.root.user.email
-    ) {
-      return { canInstall: true, reason: "instructor-created-course" };
-    }
-
-    return { canInstall: false, reason: "not-authorized" };
-  };
+  const canInstall = (row) => {};
 
   const columnsWithInstall = [
statusReason: TypeError: Cannot read properties of undefined (reading 'canInstall')

[Killed] LogicalOperator
main/components/Courses/InstructorCoursesTable.js:50:9
   };
 
   const canInstall = (row) => {
-    if ("orgName" in row.values && row.values.orgName) {
+    if ("orgName" in row.values || row.values.orgName) {
       return { canInstall: false, reason: "already-installed" };
     }
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-2-col-orgName-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ConditionalExpression
main/components/Courses/InstructorCoursesTable.js:50:9
   };
 
   const canInstall = (row) => {
-    if ("orgName" in row.values && row.values.orgName) {
+    if (false) {
       return { canInstall: false, reason: "already-installed" };
     }
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  ucsb-cs156-s25
Received:
  Install Github App

[Killed] BooleanLiteral
main/components/Courses/InstructorCoursesTable.js:51:28
 
   const canInstall = (row) => {
     if ("orgName" in row.values && row.values.orgName) {
-      return { canInstall: false, reason: "already-installed" };
+      return { canInstall: true, reason: "already-installed" };
     }
     if (hasRole(currentUser, "ROLE_ADMIN")) {
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  ucsb-cs156-s25
Received:
  Install Github App

[Killed] BlockStatement
main/components/Courses/InstructorCoursesTable.js:53:45
     if ("orgName" in row.values && row.values.orgName) {
       return { canInstall: false, reason: "already-installed" };
     }
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return { canInstall: true, reason: "admin" };
-    }
+    if (hasRole(currentUser, "ROLE_ADMIN")) {}
     if (
       hasRole(currentUser, "ROLE_INSTRUCTOR") &&
killedBy: InstructorCoursesTable tests Has the expected column headers and content for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-2-col-orgName-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BooleanLiteral
main/components/Courses/InstructorCoursesTable.js:54:28
       return { canInstall: false, reason: "already-installed" };
     }
     if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return { canInstall: true, reason: "admin" };
+      return { canInstall: false, reason: "admin" };
     }
     if (
killedBy: InstructorCoursesTable tests Has the expected column headers and content for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-2-col-orgName-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ConditionalExpression
main/components/Courses/InstructorCoursesTable.js:57:7
       return { canInstall: true, reason: "admin" };
     }
     if (
-      hasRole(currentUser, "ROLE_INSTRUCTOR") &&
-      row.values.createdByEmail === currentUser.root.user.email
+      true
     ) {
       return { canInstall: true, reason: "instructor-created-course" };
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-3-col-orgName-cannot-install-not-authorized"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ConditionalExpression
main/components/Courses/InstructorCoursesTable.js:57:7
       return { canInstall: true, reason: "admin" };
     }
     if (
-      hasRole(currentUser, "ROLE_INSTRUCTOR") &&
-      row.values.createdByEmail === currentUser.root.user.email
+      false
     ) {
       return { canInstall: true, reason: "instructor-created-course" };
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] EqualityOperator
main/components/Courses/InstructorCoursesTable.js:58:7
     }
     if (
       hasRole(currentUser, "ROLE_INSTRUCTOR") &&
-      row.values.createdByEmail === currentUser.root.user.email
+      row.values.createdByEmail !== currentUser.root.user.email
     ) {
       return { canInstall: true, reason: "instructor-created-course" };
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] ConditionalExpression
main/components/Courses/InstructorCoursesTable.js:58:7
     }
     if (
       hasRole(currentUser, "ROLE_INSTRUCTOR") &&
-      row.values.createdByEmail === currentUser.root.user.email
+      true
     ) {
       return { canInstall: true, reason: "instructor-created-course" };
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-3-col-orgName-cannot-install-not-authorized"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BlockStatement
main/components/Courses/InstructorCoursesTable.js:59:7
     if (
       hasRole(currentUser, "ROLE_INSTRUCTOR") &&
       row.values.createdByEmail === currentUser.root.user.email
-    ) {
-      return { canInstall: true, reason: "instructor-created-course" };
-    }
+    ) {}
 
     return { canInstall: false, reason: "not-authorized" };
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] BooleanLiteral
main/components/Courses/InstructorCoursesTable.js:60:28
       hasRole(currentUser, "ROLE_INSTRUCTOR") &&
       row.values.createdByEmail === currentUser.root.user.email
     ) {
-      return { canInstall: true, reason: "instructor-created-course" };
+      return { canInstall: false, reason: "instructor-created-course" };
     }
 
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-2-col-orgName-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BooleanLiteral
main/components/Courses/InstructorCoursesTable.js:63:26
       return { canInstall: true, reason: "instructor-created-course" };
     }
 
-    return { canInstall: false, reason: "not-authorized" };
+    return { canInstall: true, reason: "not-authorized" };
   };
 
statusReason: Error: expect(element).toHaveTextContent()

Checking with empty string will always match, use .toBeEmptyDOMElement() instead:

Received:
  Install Github App

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.js:63:41
       return { canInstall: true, reason: "instructor-created-course" };
     }
 
-    return { canInstall: false, reason: "not-authorized" };
+    return { canInstall: false, reason: "" };
   };
 
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-3-col-orgName-cannot-install-not-authorized"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.js:69:15
   const columnsWithInstall = [
     ...columns,
     {
-      Header: "Github Org",
+      Header: "",
       accessor: "orgName",
       Cell: ({ cell }) => {
statusReason: TestingLibraryElementError: Unable to find an element with the text: Github Org. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BlockStatement
main/components/Courses/InstructorCoursesTable.js:71:27
     {
       Header: "Github Org",
       accessor: "orgName",
-      Cell: ({ cell }) => {
-        const result = canInstall(cell.row);
-        if (result.canInstall) {
-          return (
-            <Button
-              variant={"primary"}
-              onClick={() => installCallback(cell)}
-              data-testid={`${testId}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
-              data-reason={result.reason}
-            >
-              Install Github App
-            </Button>
-          );
-        } else {
-          return (
-            <span
-              data-testid={`${testId}-cell-row-${cell.row.index}-col-${cell.column.id}-cannot-install-${result.reason}`}
-            >
-              {cell.value}
-            </span>
-          );
-        }
-      },
+      Cell: ({ cell }) => {},
     },
     {
statusReason: TestingLibraryElementError: Unable to find an element with the text: wsu-cpts489-fa20. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/components/Courses/InstructorCoursesTable.js:73:13
       accessor: "orgName",
       Cell: ({ cell }) => {
         const result = canInstall(cell.row);
-        if (result.canInstall) {
+        if (false) {
           return (
             <Button
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] ConditionalExpression
main/components/Courses/InstructorCoursesTable.js:73:13
       accessor: "orgName",
       Cell: ({ cell }) => {
         const result = canInstall(cell.row);
-        if (result.canInstall) {
+        if (true) {
           return (
             <Button
statusReason: TestingLibraryElementError: Unable to find an element with the text: wsu-cpts489-fa20. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/components/Courses/InstructorCoursesTable.js:77:24
           return (
             <Button
               variant={"primary"}
-              onClick={() => installCallback(cell)}
+              onClick={() => undefined}
               data-testid={`${testId}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
               data-reason={result.reason}
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.js:78:28
             <Button
               variant={"primary"}
               onClick={() => installCallback(cell)}
-              data-testid={`${testId}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
+              data-testid={``}
               data-reason={result.reason}
             >
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] BlockStatement
main/components/Courses/InstructorCoursesTable.js:84:16
               Install Github App
             </Button>
           );
-        } else {
-          return (
-            <span
-              data-testid={`${testId}-cell-row-${cell.row.index}-col-${cell.column.id}-cannot-install-${result.reason}`}
-            >
-              {cell.value}
-            </span>
-          );
-        }
+        } else {}
       },
     },
statusReason: TestingLibraryElementError: Unable to find an element with the text: wsu-cpts489-fa20. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.js:87:28
         } else {
           return (
             <span
-              data-testid={`${testId}-cell-row-${cell.row.index}-col-${cell.column.id}-cannot-install-${result.reason}`}
+              data-testid={``}
             >
               {cell.value}
killedBy: InstructorCoursesTable tests Has the expected column headers and content for instructor user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-0-col-orgName-cannot-install-already-installed"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.js:96:15
       },
     },
     {
-      Header: "Created By",
+      Header: "",
       accessor: "createdByEmail",
     },
statusReason: TestingLibraryElementError: Unable to find an element with the text: Created By. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.js:97:17
     },
     {
       Header: "Created By",
-      accessor: "createdByEmail",
+      accessor: "",
     },
   ];
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-0-col-createdByEmail"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
