[Killed] ObjectLiteral
main/components/RosterStudent/RosterStudentForm.js:47:37
           id="firstName"
           type="text"
           isInvalid={Boolean(errors.firstName)}
-          {...register("firstName", {
-            required: "First Name is required.",
-          })}
+          {...register("firstName", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: RosterStudentForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /First Name is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
