[Killed] BlockStatement
main/components/Users/RoleEmailTable.js:15:61
   testIdPrefix = "RoleEmailTable",
   customDeleteCallback = null, // optional deleteCallback, used in AdminsIndexPage
 }) {
-  const cellToAxiosParamsDelete = (cell, deleteEndpoint) => {
-    return {
-      url: deleteEndpoint,
-      method: "DELETE",
-      params: {
-        email: cell.row.values.email,
-      },
-    };
-  };
+  const cellToAxiosParamsDelete = (cell, deleteEndpoint) => {};
 
   const onDeleteSuccess = (message) => {
killedBy: RoleEmailTable Check defaults for api endpoints
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/components/Users/RoleEmailTable.js:19:15
     return {
       url: deleteEndpoint,
       method: "DELETE",
-      params: {
-        email: cell.row.values.email,
-      },
+      params: {},
     };
   };
killedBy: AdminsIndexPage tests what happens when you click delete
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "email": "instructor1@example.com",
- }

[Killed] ArrowFunction
main/components/Users/RoleEmailTable.js:30:5
   };
 
   const deleteMutation = useBackendMutation(
-    (cell) => cellToAxiosParamsDelete(cell, deleteEndpoint),
+    () => undefined,
     { onSuccess: onDeleteSuccess },
     [getEndpoint],
killedBy: RoleEmailTable Check defaults for api endpoints
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/components/Users/RoleEmailTable.js:31:5
 
   const deleteMutation = useBackendMutation(
     (cell) => cellToAxiosParamsDelete(cell, deleteEndpoint),
-    { onSuccess: onDeleteSuccess },
+    {},
     [getEndpoint],
   );
killedBy: AdminsIndexPage tests what happens when you click delete
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "first instructor deleted"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] BlockStatement
main/components/Users/RoleEmailTable.js:48:27
     {
       Header: "Delete",
       accessor: "isInAdminEmails",
-      Cell: ({ cell }) => {
-        if (
-          !("isInAdminEmails" in cell.row.values) ||
-          !cell.row.values.isInAdminEmails
-        ) {
-          return (
-            <Button
-              className="btn btn-danger"
-              onClick={() => deleteCallback(cell)}
-              data-testid={`${testIdPrefix}-cell-row-${cell.row.index}-col-delete-button`}
-            >
-              Delete
-            </Button>
-          );
-        }
-        return (
-          <span
-            data-testid={`${testIdPrefix}-cell-row-${cell.row.index}-cannot-delete`}
-          >
-            In <code>ADMIN_EMAILS</code>
-          </span>
-        );
-      },
+      Cell: ({ cell }) => {},
     },
   ];
killedBy: RoleEmailTable renders table with email data
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "button" and name `/delete/i`

Here are the accessible roles:

  table:

  Name "":
  <table

[Killed] BooleanLiteral
main/components/Users/RoleEmailTable.js:50:11
       accessor: "isInAdminEmails",
       Cell: ({ cell }) => {
         if (
-          !("isInAdminEmails" in cell.row.values) ||
+          "isInAdminEmails" in cell.row.values ||
           !cell.row.values.isInAdminEmails
         ) {
killedBy: RoleEmailTable renders table with email data plus isInAdminEmails
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RoleEmailTable-cell-row-0-cannot-delete"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] LogicalOperator
main/components/Users/RoleEmailTable.js:50:11
       accessor: "isInAdminEmails",
       Cell: ({ cell }) => {
         if (
-          !("isInAdminEmails" in cell.row.values) ||
-          !cell.row.values.isInAdminEmails
+          !("isInAdminEmails" in cell.row.values) && !cell.row.values.isInAdminEmails
         ) {
           return (
killedBy: RoleEmailTable renders table with email data
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "button" and name `/delete/i`

Here are the accessible roles:

  table:

  Name "":
  <table

[Killed] BooleanLiteral
main/components/Users/RoleEmailTable.js:51:11
       Cell: ({ cell }) => {
         if (
           !("isInAdminEmails" in cell.row.values) ||
-          !cell.row.values.isInAdminEmails
+          cell.row.values.isInAdminEmails
         ) {
           return (
killedBy: InstructorsIndexPage tests renders three items correctly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="InstructorsIndexPage-cell-row-0-col-delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/components/Users/RoleEmailTable.js:52:11
         if (
           !("isInAdminEmails" in cell.row.values) ||
           !cell.row.values.isInAdminEmails
-        ) {
-          return (
-            <Button
-              className="btn btn-danger"
-              onClick={() => deleteCallback(cell)}
-              data-testid={`${testIdPrefix}-cell-row-${cell.row.index}-col-delete-button`}
-            >
-              Delete
-            </Button>
-          );
-        }
+        ) {}
         return (
           <span
killedBy: RoleEmailTable renders table with email data
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "button" and name `/delete/i`

Here are the accessible roles:

  table:

  Name "":
  <table

[Killed] ArrowFunction
main/components/Users/RoleEmailTable.js:56:24
           return (
             <Button
               className="btn btn-danger"
-              onClick={() => deleteCallback(cell)}
+              onClick={() => undefined}
               data-testid={`${testIdPrefix}-cell-row-${cell.row.index}-col-delete-button`}
             >
killedBy: RoleEmailTable calls deleteCallback when Delete button clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ArrayDeclaration
main/components/Users/RoleEmailTable.js:76:42
 
   return (
     <OurTable
-      data={Array.isArray(data) ? data : []}
+      data={Array.isArray(data) ? data : ["Stryker was here"]}
       columns={columns}
       testid={testIdPrefix}
killedBy: RoleEmailTable renders empty table correctly when data is null
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-danger btn btn-primary" data-testid="RoleEmailTable-cell-row-0-col-delete-button" type="button">Delete</button> instead
