[Killed] BlockStatement
main/pages/Instructors/CoursesIndexPage.js:8:44
 import InstructorCoursesTable from "main/components/Courses/InstructorCoursesTable";
 import { useCurrentUser } from "main/utils/currentUser";
 
-export default function CoursesIndexPage() {
-  const { data: currentUser } = useCurrentUser();
-
-  const {
-    data: courses,
-    error: _error,
-    status: _status,
-  } = useBackend(
-    // Stryker disable next-line all : don't test internal caching of React Query
-    ["/api/courses/all"],
-    { method: "GET", url: "/api/courses/all" },
-    // Stryker disable next-line all : don't test default value of empty list
-    [],
-  );
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Courses</h1>
-        <InstructorCoursesTable courses={courses} currentUser={currentUser} />
-      </div>
-    </BasicLayout>
-  );
-}
+export default function CoursesIndexPage() {}
 
killedBy: CoursesIndexPage tests renders correctly for instructor user
statusReason: Error: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] StringLiteral
main/pages/Instructors/CoursesIndexPage.js:18:27
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/courses/all"],
-    { method: "GET", url: "/api/courses/all" },
+    { method: "GET", url: "" },
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: CoursesIndexPage tests renders correctly for instructor user
statusReason: Error: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
